{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. ********************* 1. Data Import and Transformation:************************
. *                  - Importing and transforming data from the CSV file.
.    
. import delimited using "data/04-half-hourly.csv"
{res}{txt}(encoding automatically selected: ISO-8859-1)
{text}(46 vars, 1,264,072 obs)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\Alex\AppData\Local\Temp\STD4cc_000000.tmp"
{txt}
{com}. gen date_new=date(date_local,"YMD")
{txt}
{com}. format date_new %td
{txt}
{com}. drop date_local
{txt}
{com}. rename date_new date
{res}{txt}
{com}. //DST Date
. gen dst_date_new = date(dst_date, "YMD")
{txt}
{com}. format dst_date_new %td
{txt}
{com}. drop dst_date
{txt}
{com}. rename dst_date_new dst_date
{res}{txt}
{com}. 
. * dst_now_here, Weekend
. *Converts dst_start
. gen dst_start_temp = 0
{txt}
{com}. replace dst_start_temp = 1 if dst_start == "TRUE"
{txt}(649,560 real changes made)

{com}. drop dst_start
{txt}
{com}. rename dst_start_temp dst_start
{res}{txt}
{com}. //after_transition 
. gen after_transition_temp = 0
{txt}
{com}. replace after_transition_temp = 1 if after_transition == "TRUE"
{txt}(629,272 real changes made)

{com}. drop after_transition
{txt}
{com}. rename after_transition_temp after_transition
{res}{txt}
{com}. //dst_now_anywhere
. gen dst_now_anywhere_temp = 0
{txt}
{com}. replace dst_now_anywhere_temp = 1 if dst_now_anywhere == "TRUE"
{txt}(626,280 real changes made)

{com}. drop dst_now_anywhere
{txt}
{com}. rename dst_now_anywhere_temp dst_now_anywhere
{res}{txt}
{com}. //dst_here_anytime
. gen dst_here_anytime_temp = 0
{txt}
{com}. replace dst_here_anytime_temp = 1 if dst_here_anytime == "TRUE"
{txt}(1,011,256 real changes made)

{com}. drop dst_here_anytime
{txt}
{com}. rename dst_here_anytime_temp dst_here_anytime
{res}{txt}
{com}. //Converts dst_now_here
. gen dst_now_here_temp = 0
{txt}
{com}. replace dst_now_here_temp = 1 if dst_now_here == "TRUE"
{txt}(501,000 real changes made)

{com}. drop dst_now_here
{txt}
{com}. rename dst_now_here_temp dst_now_here
{res}{txt}
{com}. //Converts Weekend
. gen Weekend_local_temp = 0
{txt}
{com}. replace Weekend_local_temp = 1 if weekend_local == "TRUE"
{txt}(360,952 real changes made)

{com}. drop weekend_local
{txt}
{com}. rename Weekend_local_temp weekend_local
{res}{txt}
{com}. //Converts public holiday
. gen public_holiday_temp = 0
{txt}
{com}. replace public_holiday_temp = 1 if public_holiday == "TRUE"
{txt}(42,732 real changes made)

{com}. drop public_holiday
{txt}
{com}. rename public_holiday_temp public_holiday
{res}{txt}
{com}. 
. //Converts dst_direction, start is 1
. gen dst_direction_temp = 0
{txt}
{com}. replace dst_direction_temp = 1 if dst_direction == "start"
{txt}(649,560 real changes made)

{com}. drop dst_direction
{txt}
{com}. rename dst_direction_temp dst_direction
{res}{txt}
{com}. //Encodes region id and dst transition
. encode regionid, gen(regionid1)
{txt}
{com}. encode dst_transition_id,gen(dst_transition1)
{txt}
{com}. //Scale by 1/10000 to increase coefficient size for interpretation
. rename wind_km_per_h wind
{res}{txt}
{com}. gen wind_3 = (wind*wind*wind)/10000
{txt}
{com}. //Generate not midday variable for DDD
. gen not_midday = 0
{txt}
{com}. replace not_midday = 1 if not_midday_control_local == "TRUE"
{txt}(1,132,397 real changes made)

{com}. 
. //Generating Labels
. // Labeling variables
. // Labeling variables
. label variable regionid "Region ID"
{txt}
{com}. label variable midday_control_fixed "Midday(Noon time) Control (Fixed Time)"
{txt}
{com}. label variable dst_now_anywhere "DST Now in Any Region (Time)"
{txt}
{com}. label variable not_midday_control_local "Not Midday Control (Local Time)"
{txt}
{com}. label variable co2_kg_per_capita "KG CO2 Emissions per Capita per 30 Minutes"
{txt}
{com}. label variable dst_here_anytime "DST Region (Treatment)"
{txt}
{com}. label variable dst_transition_id "DST Transition ID, per year 2 IDs"
{txt}
{com}. label variable not_midday_control_fixed "Not Midday Control (Fixed Time)"
{txt}
{com}. label variable energy_kwh_per_capita "kWh Electricity Consumption per Capita per 30 Minutes"
{txt}
{com}. label variable dst_now_here "DST Active Here (Treatment*Time)"
{txt}
{com}. label variable days_before_transition "Days Before DST Transition"
{txt}
{com}. label variable hr_local "Local Half-Hour Time"
{txt}
{com}. label variable energy_kwh_adj_rooftop_solar_per "Adjusted kWh Electricity Consumption per Capita per 30 Minutes"
{txt}
{com}. label variable days_after_transition "Days After DST Transition"
{txt}
{com}. label variable hr_fixed "Fixed Half-Hour Time"
{txt}
{com}. label variable total_renewables_today_twh "Total Renewables Today (TWh)"
{txt}
{com}. label variable total_renewables_today_twh_uigf "Total Renewables Today (TWh) - Uncertain Future"
{txt}
{com}. label variable co2_kg_per_capita_midday "Kg CO2 Emissions per Capita compared to the Midday period"
{txt}
{com}. label variable regionid1 "Region ID (Encoded)"
{txt}
{com}. label variable dst_transition1 "DST Transition (Encoded)"
{txt}
{com}. label variable dst_direction "Direction of DST for given transition"
{txt}
{com}. label variable wind "Mean Wind Speed (km/h) per day"
{txt}
{com}. label variable wind_3 "Daily mean Wind Speed (km/h) Cubed"
{txt}
{com}. label variable not_midday "Not Midday time period as a 0 or 1"
{txt}
{com}. label variable rooftop_solar_energy_mwh "Rooftop Solar Energy (MWh) per day"
{txt}
{com}. label variable hh_end_fixed "Fixed End Time"
{txt}
{com}. label variable hh_end_local "Local End Time"
{txt}
{com}. label variable hh_start_fixed "Fixed Start Time"
{txt}
{com}. label variable hh_start_local "Local Start Time"
{txt}
{com}. label variable date_fixed "Fixed Date"
{txt}
{com}. label variable midday_control_local "Midday Control (Local Time)"
{txt}
{com}. label variable midday_control_fixed "Midday Control (Fixed Time)"
{txt}
{com}. label variable not_midday_control_local "Not Midday Control (Local Time)"
{txt}
{com}. label variable not_midday_control_fixed "Not Midday Control (Fixed Time)"
{txt}
{com}. label variable hr_local "Local Half-Hour"
{txt}
{com}. label variable hr_fixed "Fixed Half-Hour"
{txt}
{com}. label variable day_of_week_local "Day of Week (Local Time)"
{txt}
{com}. label variable day_of_week_fixed "Day of Week (Fixed Time)"
{txt}
{com}. label variable weekend_local "Weekend (Local)"
{txt}
{com}. label variable weekend_fixed "Weekend (Fixed)"
{txt}
{com}. label variable public_holiday "1 if Public holiday in Region, 0 otherwise"
{txt}
{com}. label variable days_into_dst_extreme_outlier  "Days into DST for Extreme Outliers"
{txt}
{com}. label variable days_into_dst_outlier "Days into DST for Outliers"
{txt}
{com}. label variable population "Population in given State and Time period"
{txt}
{com}. label variable temperature "Mean Daily Temperature Â°C in given State"
{txt}
{com}. label variable solar_exposure "Solar Exposure Coefficient"
{txt}
{com}. label variable co2_kg_per_capita "KG CO2 Emissions per Capita per 30 Minutes"
{txt}
{com}. label variable energy_kwh_per_capita "kwh Electricity Consumption per Capita per 30 Minutes"
{txt}
{com}. label variable energy_kwh_per_capita_midday "Mean Electricity Consumption (kWh) per Capita during the Midday period"
{txt}
{com}. label variable co2_g_per_capita_vs_midday "CO2 Emissions (g) per Capita compared to the Midday period"
{txt}
{com}. label variable date "Date"
{txt}
{com}. label variable dst_date "DST Date"
{txt}
{com}. label variable dst_start "DST Start"
{txt}
{com}. label variable after_transition "After Transition"
{txt}
{com}. label variable dst_transition_id_and_region "DST Transition ID and Region"
{txt}
{com}. label variable energy_wh_per_capita_vs_midday "Electricity Consumption (Wh) per Capita compared to the Midday period"
{txt}
{com}. label variable days_into_dst "Number of Days into the DST transition"
{txt}
{com}. 
. save "data/05-half-hourly.dta", replace
{txt}{p 0 4 2}
file {bf}
data/05-half-hourly.dta{rm}
saved
{p_end}

{com}. 
{txt}end of do-file

{com}. do "C:\Users\Alex\AppData\Local\Temp\STD4cc_000000.tmp"
{txt}
{com}. 
. //Base 
. reg co2_kg_per_capita c.dst_here_anytime##c.dst_now_anywhere ///
> [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(2, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1525
                                                {txt}Root MSE          =    {res} .14878

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}co2_kg_per_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.1332327{col 27}{space 2}  .039085{col 38}{space 1}   -3.41{col 47}{space 3}0.027{col 55}{space 4}  -.24175{col 68}{space 3}-.0247153
{txt}dst_now_any~e {c |}{col 15}{res}{space 2} .0242945{col 27}{space 2} 1.50e-14{col 38}{space 1} 1.6e+12{col 47}{space 3}0.000{col 55}{space 4} .0242945{col 68}{space 3} .0242945
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0329705{col 27}{space 2} .0066293{col 38}{space 1}   -4.97{col 47}{space 3}0.008{col 55}{space 4}-.0513763{col 68}{space 3}-.0145647
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .5759782{col 27}{space 2} 1.41e-14{col 38}{space 1} 4.1e+13{col 47}{space 3}0.000{col 55}{space 4} .5759782{col 68}{space 3} .5759782
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo CO2_Base
{txt}
{com}. //Controls
. reg co2_kg_per_capita c.dst_here_anytime##c.dst_now_anywhere ///
> weekend_local public_holiday c.temperature##c.temperature solar_exposure ///
> wind_3 [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.2132
                                                {txt}Root MSE          =    {res} .14335

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}co2_kg_per_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.1439874{col 27}{space 2} .0280714{col 38}{space 1}   -5.13{col 47}{space 3}0.007{col 55}{space 4}-.2219261{col 68}{space 3}-.0660486
{txt}dst_now_any~e {c |}{col 15}{res}{space 2} .0262619{col 27}{space 2} .0173514{col 38}{space 1}    1.51{col 47}{space 3}0.205{col 55}{space 4}-.0219132{col 68}{space 3} .0744371
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0181134{col 27}{space 2} .0222476{col 38}{space 1}   -0.81{col 47}{space 3}0.461{col 55}{space 4}-.0798827{col 68}{space 3} .0436559
{txt}{space 13} {c |}
weekend_local {c |}{col 15}{res}{space 2} -.033831{col 27}{space 2} .0013227{col 38}{space 1}  -25.58{col 47}{space 3}0.000{col 55}{space 4}-.0375035{col 68}{space 3}-.0301586
{txt}public_holi~y {c |}{col 15}{res}{space 2}-.0377945{col 27}{space 2} .0055602{col 38}{space 1}   -6.80{col 47}{space 3}0.002{col 55}{space 4}-.0532319{col 68}{space 3} -.022357
{txt}{space 2}temperature {c |}{col 15}{res}{space 2}-.0108863{col 27}{space 2} .0141706{col 38}{space 1}   -0.77{col 47}{space 3}0.485{col 55}{space 4}-.0502303{col 68}{space 3} .0284577
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2} .0002718{col 27}{space 2} .0002346{col 38}{space 1}    1.16{col 47}{space 3}0.311{col 55}{space 4}-.0003796{col 68}{space 3} .0009232
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2}-.0042183{col 27}{space 2}   .00631{col 38}{space 1}   -0.67{col 47}{space 3}0.540{col 55}{space 4}-.0217375{col 68}{space 3}  .013301
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2}-.0593653{col 27}{space 2} .0249105{col 38}{space 1}   -2.38{col 47}{space 3}0.076{col 55}{space 4}-.1285278{col 68}{space 3} .0097972
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} .7364206{col 27}{space 2} .2152255{col 38}{space 1}    3.42{col 47}{space 3}0.027{col 55}{space 4} .1388589{col 68}{space 3} 1.333982
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo CO2_DiD
{txt}
{com}. 
. /// Elec_DiD
> //Base
. reg energy_kwh_per_capita c.dst_here_anytime##c.dst_now_anywhere ///
> [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(2, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.3262
                                                {txt}Root MSE          =    {res} .12666

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}energy_kwh_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.1795521{col 27}{space 2} .0284118{col 38}{space 1}   -6.32{col 47}{space 3}0.003{col 55}{space 4}-.2584358{col 68}{space 3}-.1006684
{txt}dst_now_any~e {c |}{col 15}{res}{space 2} .0316603{col 27}{space 2} 6.03e-15{col 38}{space 1} 5.2e+12{col 47}{space 3}0.000{col 55}{space 4} .0316603{col 68}{space 3} .0316603
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0567784{col 27}{space 2} .0091992{col 38}{space 1}   -6.17{col 47}{space 3}0.003{col 55}{space 4}-.0823196{col 68}{space 3}-.0312372
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .6559489{col 27}{space 2} 6.97e-15{col 38}{space 1} 9.4e+13{col 47}{space 3}0.000{col 55}{space 4} .6559489{col 68}{space 3} .6559489
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo Elec_Base
{txt}
{com}. 
. // Controls
. reg energy_kwh_per_capita c.dst_here_anytime##c.dst_now_anywhere ///
> weekend_local public_holiday c.temperature##c.temperature solar_exposure ///
> wind_3 [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.3781
                                                {txt}Root MSE          =    {res} .12168

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}energy_kwh_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.2149418{col 27}{space 2} .0197522{col 38}{space 1}  -10.88{col 47}{space 3}0.000{col 55}{space 4}-.2697827{col 68}{space 3}-.1601009
{txt}dst_now_any~e {c |}{col 15}{res}{space 2}  .031467{col 27}{space 2} .0173533{col 38}{space 1}    1.81{col 47}{space 3}0.144{col 55}{space 4}-.0167136{col 68}{space 3} .0796476
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0235068{col 27}{space 2} .0160757{col 38}{space 1}   -1.46{col 47}{space 3}0.217{col 55}{space 4}  -.06814{col 68}{space 3} .0211264
{txt}{space 13} {c |}
weekend_local {c |}{col 15}{res}{space 2}-.0461566{col 27}{space 2} .0018091{col 38}{space 1}  -25.51{col 47}{space 3}0.000{col 55}{space 4}-.0511796{col 68}{space 3}-.0411336
{txt}public_holi~y {c |}{col 15}{res}{space 2}-.0498073{col 27}{space 2} .0038723{col 38}{space 1}  -12.86{col 47}{space 3}0.000{col 55}{space 4}-.0605586{col 68}{space 3} -.039056
{txt}{space 2}temperature {c |}{col 15}{res}{space 2}-.0250168{col 27}{space 2}  .016778{col 38}{space 1}   -1.49{col 47}{space 3}0.210{col 55}{space 4}   -.0716{col 68}{space 3} .0215664
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2} .0005213{col 27}{space 2} .0002887{col 38}{space 1}    1.81{col 47}{space 3}0.145{col 55}{space 4}-.0002803{col 68}{space 3} .0013228
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2}-.0081455{col 27}{space 2} .0059962{col 38}{space 1}   -1.36{col 47}{space 3}0.246{col 55}{space 4}-.0247938{col 68}{space 3} .0085027
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2} .0041665{col 27}{space 2} .0118573{col 38}{space 1}    0.35{col 47}{space 3}0.743{col 55}{space 4}-.0287546{col 68}{space 3} .0370876
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} 1.007665{col 27}{space 2} .2649951{col 38}{space 1}    3.80{col 47}{space 3}0.019{col 55}{space 4}  .271921{col 68}{space 3}  1.74341
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo Elec_DiD
{txt}
{com}. 
. esttab CO2_Base Elec_Base CO2_DiD Elec_DiD using "results/DiD-results.tex", ///
>  label se stats(r2 r2_a) replace
{res}{txt}(output written to {browse  `"results/DiD-results.tex"'})

{com}. 
{txt}end of do-file

{com}. do "C:\Users\Alex\AppData\Local\Temp\STD4cc_000000.tmp"
{txt}
{com}. 
. use "data/05-half-hourly.dta", clear
{txt}
{com}. gen timevar = .
{txt}(1,264,072 missing values generated)

{com}. replace timevar = days_into_dst if dst_here_anytime == 1
{txt}(1,011,256 real changes made)

{com}. 
. eventdd co2_kg_per_capita public_holiday c.temperature##c.temperature ///
> solar_exposure wind_3  [aweight = population], timevar(timevar) ///
> method(hdfe, absorb(regionid1 date) cluster(regionid1)) ///
> graph_op(ytitle("Co2 kg per capita") xtitle("Days until DST transition") ///
>  title("Event Study - CO2 Emissions"))
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}{txt}warning: missing F statistic; dropped variables due to collinearity or too few clusters
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,264,072
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F( 190,      4)}{col 67}=          {res}.
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.7944
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7935
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0317
{txt}{col 1}Number of clusters ({res}regionid1{txt}) {col 30}= {res}         5{txt}{col 51}Root MSE{col 67}= {res}    0.0734

{txt}{ralign 78:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}co2_kg_per~a{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
public_hol~y {c |}{col 14}{res}{space 2}-.0218586{col 26}{space 2} .0063584{col 37}{space 1}   -3.44{col 46}{space 3}0.026{col 54}{space 4}-.0395124{col 67}{space 3}-.0042048
{txt}{space 1}temperature {c |}{col 14}{res}{space 2}-.0042563{col 26}{space 2} .0033137{col 37}{space 1}   -1.28{col 46}{space 3}0.268{col 54}{space 4}-.0134566{col 67}{space 3}  .004944
{txt}{space 12} {c |}
{space 10}c. {c |}
{space 1}temperature#{c |}
{space 10}c. {c |}
{space 1}temperature {c |}{col 14}{res}{space 2} .0001287{col 26}{space 2} .0000618{col 37}{space 1}    2.08{col 46}{space 3}0.106{col 54}{space 4}-.0000428{col 67}{space 3} .0003002
{txt}{space 12} {c |}
solar_expo~e {c |}{col 14}{res}{space 2}-.0001296{col 26}{space 2} .0010202{col 37}{space 1}   -0.13{col 46}{space 3}0.905{col 54}{space 4}-.0029622{col 67}{space 3} .0027029
{txt}{space 6}wind_3 {c |}{col 14}{res}{space 2}-.0119872{col 26}{space 2} .0034973{col 37}{space 1}   -3.43{col 46}{space 3}0.027{col 54}{space 4}-.0216972{col 67}{space 3}-.0022771
{txt}{space 6}lead94 {c |}{col 14}{res}{space 2} .0350427{col 26}{space 2} .0274609{col 37}{space 1}    1.28{col 46}{space 3}0.271{col 54}{space 4}-.0412011{col 67}{space 3} .1112865
{txt}{space 6}lead93 {c |}{col 14}{res}{space 2} .0314533{col 26}{space 2} .0289465{col 37}{space 1}    1.09{col 46}{space 3}0.338{col 54}{space 4}-.0489151{col 67}{space 3} .1118217
{txt}{space 6}lead92 {c |}{col 14}{res}{space 2} .0220171{col 26}{space 2} .0248344{col 37}{space 1}    0.89{col 46}{space 3}0.425{col 54}{space 4}-.0469342{col 67}{space 3} .0909684
{txt}{space 6}lead91 {c |}{col 14}{res}{space 2} .0398514{col 26}{space 2} .0133499{col 37}{space 1}    2.99{col 46}{space 3}0.041{col 54}{space 4} .0027861{col 67}{space 3} .0769168
{txt}{space 6}lead90 {c |}{col 14}{res}{space 2}  .037605{col 26}{space 2} .0139601{col 37}{space 1}    2.69{col 46}{space 3}0.054{col 54}{space 4}-.0011546{col 67}{space 3} .0763645
{txt}{space 6}lead89 {c |}{col 14}{res}{space 2} .0418116{col 26}{space 2} .0179443{col 37}{space 1}    2.33{col 46}{space 3}0.080{col 54}{space 4}-.0080096{col 67}{space 3} .0916329
{txt}{space 6}lead88 {c |}{col 14}{res}{space 2}  .042687{col 26}{space 2} .0156983{col 37}{space 1}    2.72{col 46}{space 3}0.053{col 54}{space 4}-.0008986{col 67}{space 3} .0862725
{txt}{space 6}lead87 {c |}{col 14}{res}{space 2} .0467888{col 26}{space 2} .0176167{col 37}{space 1}    2.66{col 46}{space 3}0.057{col 54}{space 4} -.002123{col 67}{space 3} .0957007
{txt}{space 6}lead86 {c |}{col 14}{res}{space 2} .0502186{col 26}{space 2} .0173444{col 37}{space 1}    2.90{col 46}{space 3}0.044{col 54}{space 4} .0020628{col 67}{space 3} .0983744
{txt}{space 6}lead85 {c |}{col 14}{res}{space 2} .0481788{col 26}{space 2} .0170066{col 37}{space 1}    2.83{col 46}{space 3}0.047{col 54}{space 4} .0009609{col 67}{space 3} .0953967
{txt}{space 6}lead84 {c |}{col 14}{res}{space 2} .0384569{col 26}{space 2} .0172337{col 37}{space 1}    2.23{col 46}{space 3}0.089{col 54}{space 4}-.0093917{col 67}{space 3} .0863054
{txt}{space 6}lead83 {c |}{col 14}{res}{space 2} .0388528{col 26}{space 2} .0156439{col 37}{space 1}    2.48{col 46}{space 3}0.068{col 54}{space 4}-.0045818{col 67}{space 3} .0822873
{txt}{space 6}lead82 {c |}{col 14}{res}{space 2}  .041965{col 26}{space 2} .0163983{col 37}{space 1}    2.56{col 46}{space 3}0.063{col 54}{space 4}-.0035639{col 67}{space 3} .0874939
{txt}{space 6}lead81 {c |}{col 14}{res}{space 2} .0389094{col 26}{space 2} .0179423{col 37}{space 1}    2.17{col 46}{space 3}0.096{col 54}{space 4}-.0109063{col 67}{space 3} .0887251
{txt}{space 6}lead80 {c |}{col 14}{res}{space 2} .0401438{col 26}{space 2} .0173438{col 37}{space 1}    2.31{col 46}{space 3}0.082{col 54}{space 4}-.0080104{col 67}{space 3} .0882981
{txt}{space 6}lead79 {c |}{col 14}{res}{space 2} .0432433{col 26}{space 2} .0182887{col 37}{space 1}    2.36{col 46}{space 3}0.077{col 54}{space 4}-.0075342{col 67}{space 3} .0940209
{txt}{space 6}lead78 {c |}{col 14}{res}{space 2} .0420741{col 26}{space 2} .0172579{col 37}{space 1}    2.44{col 46}{space 3}0.071{col 54}{space 4}-.0058414{col 67}{space 3} .0899897
{txt}{space 6}lead77 {c |}{col 14}{res}{space 2} .0378748{col 26}{space 2} .0147254{col 37}{space 1}    2.57{col 46}{space 3}0.062{col 54}{space 4}-.0030094{col 67}{space 3} .0787589
{txt}{space 6}lead76 {c |}{col 14}{res}{space 2} .0449152{col 26}{space 2} .0150935{col 37}{space 1}    2.98{col 46}{space 3}0.041{col 54}{space 4} .0030088{col 67}{space 3} .0868215
{txt}{space 6}lead75 {c |}{col 14}{res}{space 2} .0427233{col 26}{space 2} .0149073{col 37}{space 1}    2.87{col 46}{space 3}0.046{col 54}{space 4}  .001334{col 67}{space 3} .0841126
{txt}{space 6}lead74 {c |}{col 14}{res}{space 2}  .048149{col 26}{space 2} .0132211{col 37}{space 1}    3.64{col 46}{space 3}0.022{col 54}{space 4} .0114412{col 67}{space 3} .0848567
{txt}{space 6}lead73 {c |}{col 14}{res}{space 2} .0442691{col 26}{space 2}  .014803{col 37}{space 1}    2.99{col 46}{space 3}0.040{col 54}{space 4} .0031695{col 67}{space 3} .0853688
{txt}{space 6}lead72 {c |}{col 14}{res}{space 2} .0396293{col 26}{space 2} .0169283{col 37}{space 1}    2.34{col 46}{space 3}0.079{col 54}{space 4}-.0073712{col 67}{space 3} .0866298
{txt}{space 6}lead71 {c |}{col 14}{res}{space 2} .0429221{col 26}{space 2}  .015815{col 37}{space 1}    2.71{col 46}{space 3}0.053{col 54}{space 4}-.0009873{col 67}{space 3} .0868316
{txt}{space 6}lead70 {c |}{col 14}{res}{space 2} .0389362{col 26}{space 2} .0126962{col 37}{space 1}    3.07{col 46}{space 3}0.037{col 54}{space 4}  .003686{col 67}{space 3} .0741864
{txt}{space 6}lead69 {c |}{col 14}{res}{space 2}  .047634{col 26}{space 2} .0118974{col 37}{space 1}    4.00{col 46}{space 3}0.016{col 54}{space 4} .0146016{col 67}{space 3} .0806665
{txt}{space 6}lead68 {c |}{col 14}{res}{space 2} .0527786{col 26}{space 2} .0118918{col 37}{space 1}    4.44{col 46}{space 3}0.011{col 54}{space 4} .0197615{col 67}{space 3} .0857956
{txt}{space 6}lead67 {c |}{col 14}{res}{space 2} .0508542{col 26}{space 2}    .0098{col 37}{space 1}    5.19{col 46}{space 3}0.007{col 54}{space 4}  .023645{col 67}{space 3} .0780635
{txt}{space 6}lead66 {c |}{col 14}{res}{space 2}  .049123{col 26}{space 2} .0137985{col 37}{space 1}    3.56{col 46}{space 3}0.024{col 54}{space 4} .0108122{col 67}{space 3} .0874338
{txt}{space 6}lead65 {c |}{col 14}{res}{space 2} .0487087{col 26}{space 2} .0119926{col 37}{space 1}    4.06{col 46}{space 3}0.015{col 54}{space 4}  .015412{col 67}{space 3} .0820054
{txt}{space 6}lead64 {c |}{col 14}{res}{space 2} .0368039{col 26}{space 2} .0132538{col 37}{space 1}    2.78{col 46}{space 3}0.050{col 54}{space 4} 5.42e-06{col 67}{space 3} .0736023
{txt}{space 6}lead63 {c |}{col 14}{res}{space 2} .0330634{col 26}{space 2} .0133433{col 37}{space 1}    2.48{col 46}{space 3}0.068{col 54}{space 4}-.0039836{col 67}{space 3} .0701103
{txt}{space 6}lead62 {c |}{col 14}{res}{space 2} .0437757{col 26}{space 2} .0151702{col 37}{space 1}    2.89{col 46}{space 3}0.045{col 54}{space 4} .0016565{col 67}{space 3} .0858949
{txt}{space 6}lead61 {c |}{col 14}{res}{space 2} .0497398{col 26}{space 2} .0147093{col 37}{space 1}    3.38{col 46}{space 3}0.028{col 54}{space 4} .0089003{col 67}{space 3} .0905794
{txt}{space 6}lead60 {c |}{col 14}{res}{space 2} .0468237{col 26}{space 2} .0126739{col 37}{space 1}    3.69{col 46}{space 3}0.021{col 54}{space 4} .0116353{col 67}{space 3}  .082012
{txt}{space 6}lead59 {c |}{col 14}{res}{space 2} .0471815{col 26}{space 2} .0144082{col 37}{space 1}    3.27{col 46}{space 3}0.031{col 54}{space 4} .0071779{col 67}{space 3} .0871851
{txt}{space 6}lead58 {c |}{col 14}{res}{space 2} .0446971{col 26}{space 2} .0115146{col 37}{space 1}    3.88{col 46}{space 3}0.018{col 54}{space 4} .0127276{col 67}{space 3} .0766666
{txt}{space 6}lead57 {c |}{col 14}{res}{space 2} .0436218{col 26}{space 2} .0075638{col 37}{space 1}    5.77{col 46}{space 3}0.004{col 54}{space 4} .0226214{col 67}{space 3} .0646222
{txt}{space 6}lead56 {c |}{col 14}{res}{space 2} .0453675{col 26}{space 2}  .010074{col 37}{space 1}    4.50{col 46}{space 3}0.011{col 54}{space 4} .0173975{col 67}{space 3} .0733374
{txt}{space 6}lead55 {c |}{col 14}{res}{space 2} .0485805{col 26}{space 2} .0103136{col 37}{space 1}    4.71{col 46}{space 3}0.009{col 54}{space 4} .0199453{col 67}{space 3} .0772157
{txt}{space 6}lead54 {c |}{col 14}{res}{space 2} .0516011{col 26}{space 2} .0097593{col 37}{space 1}    5.29{col 46}{space 3}0.006{col 54}{space 4} .0245048{col 67}{space 3} .0786973
{txt}{space 6}lead53 {c |}{col 14}{res}{space 2} .0433131{col 26}{space 2} .0098073{col 37}{space 1}    4.42{col 46}{space 3}0.012{col 54}{space 4} .0160836{col 67}{space 3} .0705426
{txt}{space 6}lead52 {c |}{col 14}{res}{space 2} .0423231{col 26}{space 2} .0084885{col 37}{space 1}    4.99{col 46}{space 3}0.008{col 54}{space 4} .0187552{col 67}{space 3}  .065891
{txt}{space 6}lead51 {c |}{col 14}{res}{space 2} .0461533{col 26}{space 2} .0086743{col 37}{space 1}    5.32{col 46}{space 3}0.006{col 54}{space 4} .0220695{col 67}{space 3} .0702371
{txt}{space 6}lead50 {c |}{col 14}{res}{space 2} .0404271{col 26}{space 2} .0065075{col 37}{space 1}    6.21{col 46}{space 3}0.003{col 54}{space 4} .0223594{col 67}{space 3} .0584949
{txt}{space 6}lead49 {c |}{col 14}{res}{space 2} .0425213{col 26}{space 2} .0063266{col 37}{space 1}    6.72{col 46}{space 3}0.003{col 54}{space 4} .0249558{col 67}{space 3} .0600868
{txt}{space 6}lead48 {c |}{col 14}{res}{space 2} .0464228{col 26}{space 2} .0055237{col 37}{space 1}    8.40{col 46}{space 3}0.001{col 54}{space 4} .0310867{col 67}{space 3}  .061759
{txt}{space 6}lead47 {c |}{col 14}{res}{space 2} .0437113{col 26}{space 2} .0055694{col 37}{space 1}    7.85{col 46}{space 3}0.001{col 54}{space 4} .0282483{col 67}{space 3} .0591744
{txt}{space 6}lead46 {c |}{col 14}{res}{space 2} .0390017{col 26}{space 2} .0089704{col 37}{space 1}    4.35{col 46}{space 3}0.012{col 54}{space 4} .0140959{col 67}{space 3} .0639074
{txt}{space 6}lead45 {c |}{col 14}{res}{space 2} .0346201{col 26}{space 2} .0114489{col 37}{space 1}    3.02{col 46}{space 3}0.039{col 54}{space 4} .0028329{col 67}{space 3} .0664074
{txt}{space 6}lead44 {c |}{col 14}{res}{space 2} .0299977{col 26}{space 2} .0100667{col 37}{space 1}    2.98{col 46}{space 3}0.041{col 54}{space 4} .0020482{col 67}{space 3} .0579473
{txt}{space 6}lead43 {c |}{col 14}{res}{space 2} .0293643{col 26}{space 2} .0099167{col 37}{space 1}    2.96{col 46}{space 3}0.042{col 54}{space 4}  .001831{col 67}{space 3} .0568976
{txt}{space 6}lead42 {c |}{col 14}{res}{space 2} .0265425{col 26}{space 2} .0079861{col 37}{space 1}    3.32{col 46}{space 3}0.029{col 54}{space 4} .0043695{col 67}{space 3} .0487155
{txt}{space 6}lead41 {c |}{col 14}{res}{space 2} .0366755{col 26}{space 2} .0071668{col 37}{space 1}    5.12{col 46}{space 3}0.007{col 54}{space 4} .0167773{col 67}{space 3} .0565737
{txt}{space 6}lead40 {c |}{col 14}{res}{space 2} .0403879{col 26}{space 2} .0059486{col 37}{space 1}    6.79{col 46}{space 3}0.002{col 54}{space 4} .0238721{col 67}{space 3} .0569038
{txt}{space 6}lead39 {c |}{col 14}{res}{space 2} .0392556{col 26}{space 2} .0059176{col 37}{space 1}    6.63{col 46}{space 3}0.003{col 54}{space 4} .0228258{col 67}{space 3} .0556855
{txt}{space 6}lead38 {c |}{col 14}{res}{space 2} .0350344{col 26}{space 2} .0079737{col 37}{space 1}    4.39{col 46}{space 3}0.012{col 54}{space 4} .0128958{col 67}{space 3}  .057173
{txt}{space 6}lead37 {c |}{col 14}{res}{space 2} .0360856{col 26}{space 2} .0075319{col 37}{space 1}    4.79{col 46}{space 3}0.009{col 54}{space 4} .0151738{col 67}{space 3} .0569974
{txt}{space 6}lead36 {c |}{col 14}{res}{space 2} .0279891{col 26}{space 2} .0089795{col 37}{space 1}    3.12{col 46}{space 3}0.036{col 54}{space 4} .0030579{col 67}{space 3} .0529202
{txt}{space 6}lead35 {c |}{col 14}{res}{space 2} .0277323{col 26}{space 2} .0088235{col 37}{space 1}    3.14{col 46}{space 3}0.035{col 54}{space 4} .0032342{col 67}{space 3} .0522304
{txt}{space 6}lead34 {c |}{col 14}{res}{space 2} .0334329{col 26}{space 2} .0059637{col 37}{space 1}    5.61{col 46}{space 3}0.005{col 54}{space 4} .0168752{col 67}{space 3} .0499907
{txt}{space 6}lead33 {c |}{col 14}{res}{space 2} .0300722{col 26}{space 2} .0065946{col 37}{space 1}    4.56{col 46}{space 3}0.010{col 54}{space 4} .0117626{col 67}{space 3} .0483818
{txt}{space 6}lead32 {c |}{col 14}{res}{space 2} .0328734{col 26}{space 2}  .003615{col 37}{space 1}    9.09{col 46}{space 3}0.001{col 54}{space 4} .0228364{col 67}{space 3} .0429103
{txt}{space 6}lead31 {c |}{col 14}{res}{space 2} .0284634{col 26}{space 2} .0037521{col 37}{space 1}    7.59{col 46}{space 3}0.002{col 54}{space 4} .0180459{col 67}{space 3} .0388809
{txt}{space 6}lead30 {c |}{col 14}{res}{space 2} .0255301{col 26}{space 2} .0059764{col 37}{space 1}    4.27{col 46}{space 3}0.013{col 54}{space 4}  .008937{col 67}{space 3} .0421233
{txt}{space 6}lead29 {c |}{col 14}{res}{space 2} .0342967{col 26}{space 2} .0068752{col 37}{space 1}    4.99{col 46}{space 3}0.008{col 54}{space 4} .0152081{col 67}{space 3} .0533853
{txt}{space 6}lead28 {c |}{col 14}{res}{space 2}  .027804{col 26}{space 2} .0042242{col 37}{space 1}    6.58{col 46}{space 3}0.003{col 54}{space 4} .0160758{col 67}{space 3} .0395322
{txt}{space 6}lead27 {c |}{col 14}{res}{space 2} .0231151{col 26}{space 2} .0073629{col 37}{space 1}    3.14{col 46}{space 3}0.035{col 54}{space 4} .0026725{col 67}{space 3} .0435577
{txt}{space 6}lead26 {c |}{col 14}{res}{space 2} .0215501{col 26}{space 2} .0045856{col 37}{space 1}    4.70{col 46}{space 3}0.009{col 54}{space 4} .0088185{col 67}{space 3} .0342818
{txt}{space 6}lead25 {c |}{col 14}{res}{space 2} .0247845{col 26}{space 2} .0047248{col 37}{space 1}    5.25{col 46}{space 3}0.006{col 54}{space 4} .0116665{col 67}{space 3} .0379026
{txt}{space 6}lead24 {c |}{col 14}{res}{space 2} .0197462{col 26}{space 2}  .003705{col 37}{space 1}    5.33{col 46}{space 3}0.006{col 54}{space 4} .0094596{col 67}{space 3} .0300329
{txt}{space 6}lead23 {c |}{col 14}{res}{space 2} .0154082{col 26}{space 2} .0059867{col 37}{space 1}    2.57{col 46}{space 3}0.062{col 54}{space 4}-.0012135{col 67}{space 3} .0320299
{txt}{space 6}lead22 {c |}{col 14}{res}{space 2} .0147286{col 26}{space 2} .0027876{col 37}{space 1}    5.28{col 46}{space 3}0.006{col 54}{space 4} .0069889{col 67}{space 3} .0224684
{txt}{space 6}lead21 {c |}{col 14}{res}{space 2} .0147372{col 26}{space 2} .0031465{col 37}{space 1}    4.68{col 46}{space 3}0.009{col 54}{space 4}  .006001{col 67}{space 3} .0234735
{txt}{space 6}lead20 {c |}{col 14}{res}{space 2}  .019604{col 26}{space 2} .0017159{col 37}{space 1}   11.42{col 46}{space 3}0.000{col 54}{space 4} .0148399{col 67}{space 3} .0243681
{txt}{space 6}lead19 {c |}{col 14}{res}{space 2} .0264664{col 26}{space 2} .0015505{col 37}{space 1}   17.07{col 46}{space 3}0.000{col 54}{space 4} .0221615{col 67}{space 3} .0307712
{txt}{space 6}lead18 {c |}{col 14}{res}{space 2} .0208007{col 26}{space 2} .0013037{col 37}{space 1}   15.96{col 46}{space 3}0.000{col 54}{space 4} .0171811{col 67}{space 3} .0244204
{txt}{space 6}lead17 {c |}{col 14}{res}{space 2} .0192021{col 26}{space 2} .0015997{col 37}{space 1}   12.00{col 46}{space 3}0.000{col 54}{space 4} .0147606{col 67}{space 3} .0236437
{txt}{space 6}lead16 {c |}{col 14}{res}{space 2} .0091732{col 26}{space 2} .0015494{col 37}{space 1}    5.92{col 46}{space 3}0.004{col 54}{space 4} .0048714{col 67}{space 3}  .013475
{txt}{space 6}lead15 {c |}{col 14}{res}{space 2} .0018351{col 26}{space 2} .0024576{col 37}{space 1}    0.75{col 46}{space 3}0.497{col 54}{space 4}-.0049883{col 67}{space 3} .0086585
{txt}{space 6}lead14 {c |}{col 14}{res}{space 2} .0008908{col 26}{space 2} .0049136{col 37}{space 1}    0.18{col 46}{space 3}0.865{col 54}{space 4}-.0127515{col 67}{space 3} .0145332
{txt}{space 6}lead13 {c |}{col 14}{res}{space 2} .0038943{col 26}{space 2} .0019498{col 37}{space 1}    2.00{col 46}{space 3}0.116{col 54}{space 4}-.0015191{col 67}{space 3} .0093077
{txt}{space 6}lead12 {c |}{col 14}{res}{space 2} .0062269{col 26}{space 2} .0021891{col 37}{space 1}    2.84{col 46}{space 3}0.047{col 54}{space 4}  .000149{col 67}{space 3} .0123049
{txt}{space 6}lead11 {c |}{col 14}{res}{space 2} .0047007{col 26}{space 2} .0010052{col 37}{space 1}    4.68{col 46}{space 3}0.009{col 54}{space 4} .0019099{col 67}{space 3} .0074916
{txt}{space 6}lead10 {c |}{col 14}{res}{space 2}  .006671{col 26}{space 2} .0012833{col 37}{space 1}    5.20{col 46}{space 3}0.007{col 54}{space 4}  .003108{col 67}{space 3}  .010234
{txt}{space 7}lead9 {c |}{col 14}{res}{space 2} .0122594{col 26}{space 2} .0024545{col 37}{space 1}    4.99{col 46}{space 3}0.008{col 54}{space 4} .0054445{col 67}{space 3} .0190743
{txt}{space 7}lead8 {c |}{col 14}{res}{space 2}  .015931{col 26}{space 2}  .001906{col 37}{space 1}    8.36{col 46}{space 3}0.001{col 54}{space 4} .0106392{col 67}{space 3} .0212228
{txt}{space 7}lead7 {c |}{col 14}{res}{space 2}  .002843{col 26}{space 2} .0027237{col 37}{space 1}    1.04{col 46}{space 3}0.355{col 54}{space 4}-.0047191{col 67}{space 3} .0104052
{txt}{space 7}lead6 {c |}{col 14}{res}{space 2}-.0011334{col 26}{space 2} .0019349{col 37}{space 1}   -0.59{col 46}{space 3}0.589{col 54}{space 4}-.0065056{col 67}{space 3} .0042388
{txt}{space 7}lead5 {c |}{col 14}{res}{space 2} .0011339{col 26}{space 2} .0013525{col 37}{space 1}    0.84{col 46}{space 3}0.449{col 54}{space 4}-.0026214{col 67}{space 3} .0048892
{txt}{space 7}lead4 {c |}{col 14}{res}{space 2} .0096778{col 26}{space 2} .0022062{col 37}{space 1}    4.39{col 46}{space 3}0.012{col 54}{space 4} .0035523{col 67}{space 3} .0158032
{txt}{space 7}lead3 {c |}{col 14}{res}{space 2}  .008466{col 26}{space 2} .0045868{col 37}{space 1}    1.85{col 46}{space 3}0.139{col 54}{space 4}-.0042691{col 67}{space 3} .0212011
{txt}{space 7}lead2 {c |}{col 14}{res}{space 2} .0046238{col 26}{space 2} .0015502{col 37}{space 1}    2.98{col 46}{space 3}0.041{col 54}{space 4} .0003196{col 67}{space 3} .0089279
{txt}{space 8}lag0 {c |}{col 14}{res}{space 2} .0010874{col 26}{space 2} .0047543{col 37}{space 1}    0.23{col 46}{space 3}0.830{col 54}{space 4}-.0121127{col 67}{space 3} .0142874
{txt}{space 8}lag1 {c |}{col 14}{res}{space 2}-.0023664{col 26}{space 2} .0043518{col 37}{space 1}   -0.54{col 46}{space 3}0.615{col 54}{space 4} -.014449{col 67}{space 3} .0097161
{txt}{space 8}lag2 {c |}{col 14}{res}{space 2} .0052666{col 26}{space 2} .0031419{col 37}{space 1}    1.68{col 46}{space 3}0.169{col 54}{space 4}-.0034566{col 67}{space 3} .0139899
{txt}{space 8}lag3 {c |}{col 14}{res}{space 2} .0103663{col 26}{space 2} .0018517{col 37}{space 1}    5.60{col 46}{space 3}0.005{col 54}{space 4} .0052251{col 67}{space 3} .0155075
{txt}{space 8}lag4 {c |}{col 14}{res}{space 2}-.0002424{col 26}{space 2} .0011591{col 37}{space 1}   -0.21{col 46}{space 3}0.845{col 54}{space 4}-.0034604{col 67}{space 3} .0029757
{txt}{space 8}lag5 {c |}{col 14}{res}{space 2} .0019102{col 26}{space 2}   .00129{col 37}{space 1}    1.48{col 46}{space 3}0.213{col 54}{space 4}-.0016714{col 67}{space 3} .0054917
{txt}{space 8}lag6 {c |}{col 14}{res}{space 2}  .003698{col 26}{space 2} .0018715{col 37}{space 1}    1.98{col 46}{space 3}0.119{col 54}{space 4}-.0014981{col 67}{space 3} .0088942
{txt}{space 8}lag7 {c |}{col 14}{res}{space 2} .0057498{col 26}{space 2} .0017967{col 37}{space 1}    3.20{col 46}{space 3}0.033{col 54}{space 4} .0007613{col 67}{space 3} .0107382
{txt}{space 8}lag8 {c |}{col 14}{res}{space 2} .0048291{col 26}{space 2}  .001724{col 37}{space 1}    2.80{col 46}{space 3}0.049{col 54}{space 4} .0000426{col 67}{space 3} .0096156
{txt}{space 8}lag9 {c |}{col 14}{res}{space 2} .0083291{col 26}{space 2} .0021126{col 37}{space 1}    3.94{col 46}{space 3}0.017{col 54}{space 4} .0024636{col 67}{space 3} .0141947
{txt}{space 7}lag10 {c |}{col 14}{res}{space 2} .0054413{col 26}{space 2}  .001399{col 37}{space 1}    3.89{col 46}{space 3}0.018{col 54}{space 4}  .001557{col 67}{space 3} .0093256
{txt}{space 7}lag11 {c |}{col 14}{res}{space 2} .0044247{col 26}{space 2} .0019851{col 37}{space 1}    2.23{col 46}{space 3}0.090{col 54}{space 4}-.0010867{col 67}{space 3} .0099362
{txt}{space 7}lag12 {c |}{col 14}{res}{space 2} .0108434{col 26}{space 2} .0022219{col 37}{space 1}    4.88{col 46}{space 3}0.008{col 54}{space 4} .0046744{col 67}{space 3} .0170124
{txt}{space 7}lag13 {c |}{col 14}{res}{space 2} .0048891{col 26}{space 2} .0033581{col 37}{space 1}    1.46{col 46}{space 3}0.219{col 54}{space 4}-.0044346{col 67}{space 3} .0142128
{txt}{space 7}lag14 {c |}{col 14}{res}{space 2} .0042339{col 26}{space 2} .0016316{col 37}{space 1}    2.59{col 46}{space 3}0.060{col 54}{space 4}-.0002961{col 67}{space 3} .0087639
{txt}{space 7}lag15 {c |}{col 14}{res}{space 2} .0071102{col 26}{space 2} .0018944{col 37}{space 1}    3.75{col 46}{space 3}0.020{col 54}{space 4} .0018504{col 67}{space 3}   .01237
{txt}{space 7}lag16 {c |}{col 14}{res}{space 2} .0141267{col 26}{space 2} .0036585{col 37}{space 1}    3.86{col 46}{space 3}0.018{col 54}{space 4} .0039691{col 67}{space 3} .0242843
{txt}{space 7}lag17 {c |}{col 14}{res}{space 2} .0031162{col 26}{space 2} .0020913{col 37}{space 1}    1.49{col 46}{space 3}0.210{col 54}{space 4}-.0026901{col 67}{space 3} .0089225
{txt}{space 7}lag18 {c |}{col 14}{res}{space 2}  .006399{col 26}{space 2} .0020277{col 37}{space 1}    3.16{col 46}{space 3}0.034{col 54}{space 4} .0007692{col 67}{space 3} .0120288
{txt}{space 7}lag19 {c |}{col 14}{res}{space 2} .0113461{col 26}{space 2} .0073418{col 37}{space 1}    1.55{col 46}{space 3}0.197{col 54}{space 4}-.0090381{col 67}{space 3} .0317303
{txt}{space 7}lag20 {c |}{col 14}{res}{space 2} .0015785{col 26}{space 2} .0059784{col 37}{space 1}    0.26{col 46}{space 3}0.805{col 54}{space 4}-.0150202{col 67}{space 3} .0181772
{txt}{space 7}lag21 {c |}{col 14}{res}{space 2}-.0034021{col 26}{space 2} .0031009{col 37}{space 1}   -1.10{col 46}{space 3}0.334{col 54}{space 4}-.0120118{col 67}{space 3} .0052075
{txt}{space 7}lag22 {c |}{col 14}{res}{space 2} .0009607{col 26}{space 2} .0040437{col 37}{space 1}    0.24{col 46}{space 3}0.824{col 54}{space 4}-.0102666{col 67}{space 3} .0121879
{txt}{space 7}lag23 {c |}{col 14}{res}{space 2} .0051576{col 26}{space 2} .0044499{col 37}{space 1}    1.16{col 46}{space 3}0.311{col 54}{space 4}-.0071973{col 67}{space 3} .0175125
{txt}{space 7}lag24 {c |}{col 14}{res}{space 2}  .003314{col 26}{space 2} .0062102{col 37}{space 1}    0.53{col 46}{space 3}0.622{col 54}{space 4}-.0139282{col 67}{space 3} .0205562
{txt}{space 7}lag25 {c |}{col 14}{res}{space 2}  .003031{col 26}{space 2} .0058056{col 37}{space 1}    0.52{col 46}{space 3}0.629{col 54}{space 4}-.0130879{col 67}{space 3} .0191499
{txt}{space 7}lag26 {c |}{col 14}{res}{space 2} .0051315{col 26}{space 2} .0034201{col 37}{space 1}    1.50{col 46}{space 3}0.208{col 54}{space 4}-.0043643{col 67}{space 3} .0146272
{txt}{space 7}lag27 {c |}{col 14}{res}{space 2}  .010342{col 26}{space 2} .0015314{col 37}{space 1}    6.75{col 46}{space 3}0.003{col 54}{space 4}   .00609{col 67}{space 3} .0145939
{txt}{space 7}lag28 {c |}{col 14}{res}{space 2} .0066209{col 26}{space 2} .0029355{col 37}{space 1}    2.26{col 46}{space 3}0.087{col 54}{space 4}-.0015294{col 67}{space 3} .0147712
{txt}{space 7}lag29 {c |}{col 14}{res}{space 2} .0096346{col 26}{space 2} .0022794{col 37}{space 1}    4.23{col 46}{space 3}0.013{col 54}{space 4}  .003306{col 67}{space 3} .0159631
{txt}{space 7}lag30 {c |}{col 14}{res}{space 2} .0079994{col 26}{space 2} .0023377{col 37}{space 1}    3.42{col 46}{space 3}0.027{col 54}{space 4}  .001509{col 67}{space 3} .0144898
{txt}{space 7}lag31 {c |}{col 14}{res}{space 2} .0151834{col 26}{space 2} .0034083{col 37}{space 1}    4.45{col 46}{space 3}0.011{col 54}{space 4} .0057204{col 67}{space 3} .0246465
{txt}{space 7}lag32 {c |}{col 14}{res}{space 2} .0146536{col 26}{space 2} .0039246{col 37}{space 1}    3.73{col 46}{space 3}0.020{col 54}{space 4} .0037571{col 67}{space 3} .0255501
{txt}{space 7}lag33 {c |}{col 14}{res}{space 2} .0123724{col 26}{space 2} .0021101{col 37}{space 1}    5.86{col 46}{space 3}0.004{col 54}{space 4} .0065139{col 67}{space 3} .0182309
{txt}{space 7}lag34 {c |}{col 14}{res}{space 2} .0087906{col 26}{space 2} .0024816{col 37}{space 1}    3.54{col 46}{space 3}0.024{col 54}{space 4} .0019006{col 67}{space 3} .0156806
{txt}{space 7}lag35 {c |}{col 14}{res}{space 2}-.0022255{col 26}{space 2} .0018715{col 37}{space 1}   -1.19{col 46}{space 3}0.300{col 54}{space 4}-.0074215{col 67}{space 3} .0029705
{txt}{space 7}lag36 {c |}{col 14}{res}{space 2}-.0067105{col 26}{space 2} .0018182{col 37}{space 1}   -3.69{col 46}{space 3}0.021{col 54}{space 4}-.0117586{col 67}{space 3}-.0016625
{txt}{space 7}lag37 {c |}{col 14}{res}{space 2}-.0072655{col 26}{space 2} .0014697{col 37}{space 1}   -4.94{col 46}{space 3}0.008{col 54}{space 4}-.0113461{col 67}{space 3}-.0031849
{txt}{space 7}lag38 {c |}{col 14}{res}{space 2}-.0014549{col 26}{space 2} .0024416{col 37}{space 1}   -0.60{col 46}{space 3}0.583{col 54}{space 4}-.0082337{col 67}{space 3}  .005324
{txt}{space 7}lag39 {c |}{col 14}{res}{space 2} .0019553{col 26}{space 2} .0034673{col 37}{space 1}    0.56{col 46}{space 3}0.603{col 54}{space 4}-.0076715{col 67}{space 3} .0115821
{txt}{space 7}lag40 {c |}{col 14}{res}{space 2}-.0042994{col 26}{space 2} .0019114{col 37}{space 1}   -2.25{col 46}{space 3}0.088{col 54}{space 4}-.0096062{col 67}{space 3} .0010074
{txt}{space 7}lag41 {c |}{col 14}{res}{space 2}-.0072456{col 26}{space 2} .0018915{col 37}{space 1}   -3.83{col 46}{space 3}0.019{col 54}{space 4}-.0124973{col 67}{space 3}-.0019938
{txt}{space 7}lag42 {c |}{col 14}{res}{space 2}-.0061894{col 26}{space 2} .0044934{col 37}{space 1}   -1.38{col 46}{space 3}0.240{col 54}{space 4}-.0186651{col 67}{space 3} .0062863
{txt}{space 7}lag43 {c |}{col 14}{res}{space 2}-.0041847{col 26}{space 2} .0027993{col 37}{space 1}   -1.49{col 46}{space 3}0.209{col 54}{space 4}-.0119569{col 67}{space 3} .0035876
{txt}{space 7}lag44 {c |}{col 14}{res}{space 2} .0005681{col 26}{space 2} .0034307{col 37}{space 1}    0.17{col 46}{space 3}0.877{col 54}{space 4}-.0089571{col 67}{space 3} .0100934
{txt}{space 7}lag45 {c |}{col 14}{res}{space 2}-.0083468{col 26}{space 2} .0033609{col 37}{space 1}   -2.48{col 46}{space 3}0.068{col 54}{space 4}-.0176783{col 67}{space 3} .0009846
{txt}{space 7}lag46 {c |}{col 14}{res}{space 2}-.0126428{col 26}{space 2} .0018641{col 37}{space 1}   -6.78{col 46}{space 3}0.002{col 54}{space 4}-.0178184{col 67}{space 3}-.0074672
{txt}{space 7}lag47 {c |}{col 14}{res}{space 2}-.0053448{col 26}{space 2} .0035673{col 37}{space 1}   -1.50{col 46}{space 3}0.208{col 54}{space 4}-.0152493{col 67}{space 3} .0045598
{txt}{space 7}lag48 {c |}{col 14}{res}{space 2}-.0017281{col 26}{space 2} .0037924{col 37}{space 1}   -0.46{col 46}{space 3}0.672{col 54}{space 4}-.0122575{col 67}{space 3} .0088013
{txt}{space 7}lag49 {c |}{col 14}{res}{space 2}-.0044835{col 26}{space 2} .0040555{col 37}{space 1}   -1.11{col 46}{space 3}0.331{col 54}{space 4}-.0157434{col 67}{space 3} .0067765
{txt}{space 7}lag50 {c |}{col 14}{res}{space 2} .0000545{col 26}{space 2} .0024893{col 37}{space 1}    0.02{col 46}{space 3}0.984{col 54}{space 4} -.006857{col 67}{space 3} .0069659
{txt}{space 7}lag51 {c |}{col 14}{res}{space 2} .0007797{col 26}{space 2} .0035347{col 37}{space 1}    0.22{col 46}{space 3}0.836{col 54}{space 4}-.0090342{col 67}{space 3} .0105936
{txt}{space 7}lag52 {c |}{col 14}{res}{space 2}-.0018752{col 26}{space 2}  .002718{col 37}{space 1}   -0.69{col 46}{space 3}0.528{col 54}{space 4}-.0094217{col 67}{space 3} .0056713
{txt}{space 7}lag53 {c |}{col 14}{res}{space 2} .0000372{col 26}{space 2} .0032351{col 37}{space 1}    0.01{col 46}{space 3}0.991{col 54}{space 4} -.008945{col 67}{space 3} .0090193
{txt}{space 7}lag54 {c |}{col 14}{res}{space 2}-.0009474{col 26}{space 2} .0042956{col 37}{space 1}   -0.22{col 46}{space 3}0.836{col 54}{space 4} -.012874{col 67}{space 3} .0109793
{txt}{space 7}lag55 {c |}{col 14}{res}{space 2}-.0026855{col 26}{space 2}  .008566{col 37}{space 1}   -0.31{col 46}{space 3}0.770{col 54}{space 4}-.0264684{col 67}{space 3} .0210975
{txt}{space 7}lag56 {c |}{col 14}{res}{space 2}-.0091677{col 26}{space 2}  .004345{col 37}{space 1}   -2.11{col 46}{space 3}0.102{col 54}{space 4}-.0212314{col 67}{space 3} .0028959
{txt}{space 7}lag57 {c |}{col 14}{res}{space 2}-.0098426{col 26}{space 2} .0053771{col 37}{space 1}   -1.83{col 46}{space 3}0.141{col 54}{space 4}-.0247716{col 67}{space 3} .0050865
{txt}{space 7}lag58 {c |}{col 14}{res}{space 2}-.0124077{col 26}{space 2} .0060415{col 37}{space 1}   -2.05{col 46}{space 3}0.109{col 54}{space 4}-.0291815{col 67}{space 3} .0043662
{txt}{space 7}lag59 {c |}{col 14}{res}{space 2}-.0156228{col 26}{space 2} .0038498{col 37}{space 1}   -4.06{col 46}{space 3}0.015{col 54}{space 4}-.0263116{col 67}{space 3} -.004934
{txt}{space 7}lag60 {c |}{col 14}{res}{space 2} -.007941{col 26}{space 2} .0037879{col 37}{space 1}   -2.10{col 46}{space 3}0.104{col 54}{space 4} -.018458{col 67}{space 3}  .002576
{txt}{space 7}lag61 {c |}{col 14}{res}{space 2}-.0082504{col 26}{space 2} .0030442{col 37}{space 1}   -2.71{col 46}{space 3}0.054{col 54}{space 4}-.0167024{col 67}{space 3} .0002016
{txt}{space 7}lag62 {c |}{col 14}{res}{space 2} .0024918{col 26}{space 2} .0033215{col 37}{space 1}    0.75{col 46}{space 3}0.495{col 54}{space 4}-.0067301{col 67}{space 3} .0117136
{txt}{space 7}lag63 {c |}{col 14}{res}{space 2}-.0019699{col 26}{space 2}  .003868{col 37}{space 1}   -0.51{col 46}{space 3}0.637{col 54}{space 4}-.0127093{col 67}{space 3} .0087695
{txt}{space 7}lag64 {c |}{col 14}{res}{space 2} .0012003{col 26}{space 2} .0057562{col 37}{space 1}    0.21{col 46}{space 3}0.845{col 54}{space 4}-.0147815{col 67}{space 3}  .017182
{txt}{space 7}lag65 {c |}{col 14}{res}{space 2}  .007677{col 26}{space 2} .0059422{col 37}{space 1}    1.29{col 46}{space 3}0.266{col 54}{space 4}-.0088212{col 67}{space 3} .0241752
{txt}{space 7}lag66 {c |}{col 14}{res}{space 2}-.0006977{col 26}{space 2} .0072625{col 37}{space 1}   -0.10{col 46}{space 3}0.928{col 54}{space 4}-.0208616{col 67}{space 3} .0194661
{txt}{space 7}lag67 {c |}{col 14}{res}{space 2}-.0113447{col 26}{space 2} .0071628{col 37}{space 1}   -1.58{col 46}{space 3}0.188{col 54}{space 4}-.0312318{col 67}{space 3} .0085424
{txt}{space 7}lag68 {c |}{col 14}{res}{space 2}-.0075767{col 26}{space 2} .0063651{col 37}{space 1}   -1.19{col 46}{space 3}0.300{col 54}{space 4}-.0252492{col 67}{space 3} .0100957
{txt}{space 7}lag69 {c |}{col 14}{res}{space 2}-.0051472{col 26}{space 2} .0038609{col 37}{space 1}   -1.33{col 46}{space 3}0.253{col 54}{space 4}-.0158668{col 67}{space 3} .0055724
{txt}{space 7}lag70 {c |}{col 14}{res}{space 2}-.0013194{col 26}{space 2} .0038697{col 37}{space 1}   -0.34{col 46}{space 3}0.750{col 54}{space 4}-.0120633{col 67}{space 3} .0094246
{txt}{space 7}lag71 {c |}{col 14}{res}{space 2} .0050821{col 26}{space 2} .0047539{col 37}{space 1}    1.07{col 46}{space 3}0.345{col 54}{space 4}-.0081169{col 67}{space 3} .0182811
{txt}{space 7}lag72 {c |}{col 14}{res}{space 2} .0051855{col 26}{space 2} .0046609{col 37}{space 1}    1.11{col 46}{space 3}0.328{col 54}{space 4}-.0077552{col 67}{space 3} .0181262
{txt}{space 7}lag73 {c |}{col 14}{res}{space 2} .0041115{col 26}{space 2} .0064992{col 37}{space 1}    0.63{col 46}{space 3}0.561{col 54}{space 4}-.0139333{col 67}{space 3} .0221562
{txt}{space 7}lag74 {c |}{col 14}{res}{space 2} .0007713{col 26}{space 2} .0047266{col 37}{space 1}    0.16{col 46}{space 3}0.878{col 54}{space 4}-.0123518{col 67}{space 3} .0138943
{txt}{space 7}lag75 {c |}{col 14}{res}{space 2}-.0001236{col 26}{space 2} .0061568{col 37}{space 1}   -0.02{col 46}{space 3}0.985{col 54}{space 4}-.0172176{col 67}{space 3} .0169705
{txt}{space 7}lag76 {c |}{col 14}{res}{space 2}-.0001029{col 26}{space 2} .0069426{col 37}{space 1}   -0.01{col 46}{space 3}0.989{col 54}{space 4}-.0193787{col 67}{space 3} .0191729
{txt}{space 7}lag77 {c |}{col 14}{res}{space 2}  -.00019{col 26}{space 2} .0062008{col 37}{space 1}   -0.03{col 46}{space 3}0.977{col 54}{space 4}-.0174063{col 67}{space 3} .0170263
{txt}{space 7}lag78 {c |}{col 14}{res}{space 2}  .002053{col 26}{space 2} .0068197{col 37}{space 1}    0.30{col 46}{space 3}0.778{col 54}{space 4}-.0168816{col 67}{space 3} .0209877
{txt}{space 7}lag79 {c |}{col 14}{res}{space 2} .0048696{col 26}{space 2} .0049956{col 37}{space 1}    0.97{col 46}{space 3}0.385{col 54}{space 4}-.0090003{col 67}{space 3} .0187395
{txt}{space 7}lag80 {c |}{col 14}{res}{space 2} .0056182{col 26}{space 2} .0028563{col 37}{space 1}    1.97{col 46}{space 3}0.121{col 54}{space 4}-.0023121{col 67}{space 3} .0135486
{txt}{space 7}lag81 {c |}{col 14}{res}{space 2} .0043345{col 26}{space 2} .0032504{col 37}{space 1}    1.33{col 46}{space 3}0.253{col 54}{space 4}-.0046901{col 67}{space 3} .0133591
{txt}{space 7}lag82 {c |}{col 14}{res}{space 2}-.0010933{col 26}{space 2} .0022195{col 37}{space 1}   -0.49{col 46}{space 3}0.648{col 54}{space 4}-.0072556{col 67}{space 3} .0050689
{txt}{space 7}lag83 {c |}{col 14}{res}{space 2}-.0060107{col 26}{space 2} .0042598{col 37}{space 1}   -1.41{col 46}{space 3}0.231{col 54}{space 4}-.0178378{col 67}{space 3} .0058164
{txt}{space 7}lag84 {c |}{col 14}{res}{space 2}-.0083701{col 26}{space 2} .0036091{col 37}{space 1}   -2.32{col 46}{space 3}0.081{col 54}{space 4}-.0183905{col 67}{space 3} .0016503
{txt}{space 7}lag85 {c |}{col 14}{res}{space 2}-.0036931{col 26}{space 2} .0048982{col 37}{space 1}   -0.75{col 46}{space 3}0.493{col 54}{space 4}-.0172927{col 67}{space 3} .0099066
{txt}{space 7}lag86 {c |}{col 14}{res}{space 2} .0008474{col 26}{space 2} .0055408{col 37}{space 1}    0.15{col 46}{space 3}0.886{col 54}{space 4}-.0145362{col 67}{space 3}  .016231
{txt}{space 7}lag87 {c |}{col 14}{res}{space 2} .0022013{col 26}{space 2} .0043802{col 37}{space 1}    0.50{col 46}{space 3}0.642{col 54}{space 4}  -.00996{col 67}{space 3} .0143627
{txt}{space 7}lag88 {c |}{col 14}{res}{space 2}  .011108{col 26}{space 2} .0041677{col 37}{space 1}    2.67{col 46}{space 3}0.056{col 54}{space 4}-.0004635{col 67}{space 3} .0226794
{txt}{space 7}lag89 {c |}{col 14}{res}{space 2} .0067809{col 26}{space 2} .0065513{col 37}{space 1}    1.04{col 46}{space 3}0.359{col 54}{space 4}-.0114085{col 67}{space 3} .0249702
{txt}{space 7}lag90 {c |}{col 14}{res}{space 2} .0067299{col 26}{space 2}  .004561{col 37}{space 1}    1.48{col 46}{space 3}0.214{col 54}{space 4}-.0059335{col 67}{space 3} .0193932
{txt}{space 7}lag91 {c |}{col 14}{res}{space 2} .0095412{col 26}{space 2}  .004672{col 37}{space 1}    2.04{col 46}{space 3}0.111{col 54}{space 4}-.0034304{col 67}{space 3} .0225128
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4922477{col 26}{space 2} .0463163{col 37}{space 1}   10.63{col 46}{space 3}0.000{col 54}{space 4}  .363653{col 67}{space 3} .6208424
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}   regionid1{col 14}{c |}{space 1}        5{col 27}{space 1}        5{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}        date{col 14}{c |}{space 1}     5267{col 27}{space 1}        1{col 39}{result}{space 1}     5266{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. graph export "results/EventStudy-Co2.png", replace
{txt}{p 0 4 2}
file {bf}
results/EventStudy-Co2.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. eventdd energy_kwh_per_capita public_holiday c.temperature##c.temperature ///
> solar_exposure wind_3  [aweight = population], timevar(timevar) ///
>  method(hdfe, absorb(regionid1 date) cluster(regionid1)) ///
>  graph_op(ytitle("Kwh energy p.c.") xtitle("Days until DST transition") ///
>  title("Event Study - Electricity Consumption"))
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}{txt}warning: missing F statistic; dropped variables due to collinearity or too few clusters
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,264,072
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F( 190,      4)}{col 67}=          {res}.
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.7469
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7458
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0582
{txt}{col 1}Number of clusters ({res}regionid1{txt}) {col 30}= {res}         5{txt}{col 51}Root MSE{col 67}= {res}    0.0778

{txt}{ralign 78:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}energy_kwh~a{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
public_hol~y {c |}{col 14}{res}{space 2}-.0219825{col 26}{space 2} .0029596{col 37}{space 1}   -7.43{col 46}{space 3}0.002{col 54}{space 4}-.0301996{col 67}{space 3}-.0137654
{txt}{space 1}temperature {c |}{col 14}{res}{space 2}-.0166145{col 26}{space 2} .0064803{col 37}{space 1}   -2.56{col 46}{space 3}0.062{col 54}{space 4}-.0346066{col 67}{space 3} .0013776
{txt}{space 12} {c |}
{space 10}c. {c |}
{space 1}temperature#{c |}
{space 10}c. {c |}
{space 1}temperature {c |}{col 14}{res}{space 2} .0003735{col 26}{space 2} .0001291{col 37}{space 1}    2.89{col 46}{space 3}0.044{col 54}{space 4}  .000015{col 67}{space 3} .0007319
{txt}{space 12} {c |}
solar_expo~e {c |}{col 14}{res}{space 2}-.0009928{col 26}{space 2}  .000503{col 37}{space 1}   -1.97{col 46}{space 3}0.120{col 54}{space 4}-.0023893{col 67}{space 3} .0004036
{txt}{space 6}wind_3 {c |}{col 14}{res}{space 2} .0032744{col 26}{space 2}  .002993{col 37}{space 1}    1.09{col 46}{space 3}0.335{col 54}{space 4}-.0050355{col 67}{space 3} .0115843
{txt}{space 6}lead94 {c |}{col 14}{res}{space 2} .0663487{col 26}{space 2} .0177856{col 37}{space 1}    3.73{col 46}{space 3}0.020{col 54}{space 4} .0169679{col 67}{space 3} .1157296
{txt}{space 6}lead93 {c |}{col 14}{res}{space 2} .0561053{col 26}{space 2} .0166184{col 37}{space 1}    3.38{col 46}{space 3}0.028{col 54}{space 4} .0099652{col 67}{space 3} .1022454
{txt}{space 6}lead92 {c |}{col 14}{res}{space 2} .0442249{col 26}{space 2} .0130577{col 37}{space 1}    3.39{col 46}{space 3}0.028{col 54}{space 4}  .007971{col 67}{space 3} .0804787
{txt}{space 6}lead91 {c |}{col 14}{res}{space 2} .0320048{col 26}{space 2} .0141906{col 37}{space 1}    2.26{col 46}{space 3}0.087{col 54}{space 4}-.0073947{col 67}{space 3} .0714043
{txt}{space 6}lead90 {c |}{col 14}{res}{space 2} .0344443{col 26}{space 2} .0141389{col 37}{space 1}    2.44{col 46}{space 3}0.072{col 54}{space 4}-.0048116{col 67}{space 3} .0737003
{txt}{space 6}lead89 {c |}{col 14}{res}{space 2} .0423295{col 26}{space 2} .0137927{col 37}{space 1}    3.07{col 46}{space 3}0.037{col 54}{space 4} .0040349{col 67}{space 3} .0806242
{txt}{space 6}lead88 {c |}{col 14}{res}{space 2} .0442689{col 26}{space 2} .0130504{col 37}{space 1}    3.39{col 46}{space 3}0.027{col 54}{space 4} .0080352{col 67}{space 3} .0805027
{txt}{space 6}lead87 {c |}{col 14}{res}{space 2} .0492219{col 26}{space 2}   .01159{col 37}{space 1}    4.25{col 46}{space 3}0.013{col 54}{space 4} .0170429{col 67}{space 3}  .081401
{txt}{space 6}lead86 {c |}{col 14}{res}{space 2} .0508744{col 26}{space 2} .0130338{col 37}{space 1}    3.90{col 46}{space 3}0.017{col 54}{space 4} .0146868{col 67}{space 3} .0870619
{txt}{space 6}lead85 {c |}{col 14}{res}{space 2} .0454438{col 26}{space 2} .0139924{col 37}{space 1}    3.25{col 46}{space 3}0.031{col 54}{space 4} .0065948{col 67}{space 3} .0842928
{txt}{space 6}lead84 {c |}{col 14}{res}{space 2} .0378006{col 26}{space 2} .0152513{col 37}{space 1}    2.48{col 46}{space 3}0.068{col 54}{space 4}-.0045439{col 67}{space 3} .0801451
{txt}{space 6}lead83 {c |}{col 14}{res}{space 2} .0398532{col 26}{space 2} .0138634{col 37}{space 1}    2.87{col 46}{space 3}0.045{col 54}{space 4} .0013623{col 67}{space 3} .0783441
{txt}{space 6}lead82 {c |}{col 14}{res}{space 2} .0416137{col 26}{space 2} .0142901{col 37}{space 1}    2.91{col 46}{space 3}0.044{col 54}{space 4}  .001938{col 67}{space 3} .0812893
{txt}{space 6}lead81 {c |}{col 14}{res}{space 2}  .040876{col 26}{space 2} .0133165{col 37}{space 1}    3.07{col 46}{space 3}0.037{col 54}{space 4} .0039035{col 67}{space 3} .0778484
{txt}{space 6}lead80 {c |}{col 14}{res}{space 2} .0420116{col 26}{space 2} .0120388{col 37}{space 1}    3.49{col 46}{space 3}0.025{col 54}{space 4} .0085865{col 67}{space 3} .0754367
{txt}{space 6}lead79 {c |}{col 14}{res}{space 2} .0436566{col 26}{space 2} .0134243{col 37}{space 1}    3.25{col 46}{space 3}0.031{col 54}{space 4} .0063847{col 67}{space 3} .0809286
{txt}{space 6}lead78 {c |}{col 14}{res}{space 2} .0432167{col 26}{space 2}  .014258{col 37}{space 1}    3.03{col 46}{space 3}0.039{col 54}{space 4} .0036302{col 67}{space 3} .0828032
{txt}{space 6}lead77 {c |}{col 14}{res}{space 2} .0339747{col 26}{space 2} .0144698{col 37}{space 1}    2.35{col 46}{space 3}0.079{col 54}{space 4}-.0061998{col 67}{space 3} .0741492
{txt}{space 6}lead76 {c |}{col 14}{res}{space 2} .0439969{col 26}{space 2} .0125215{col 37}{space 1}    3.51{col 46}{space 3}0.025{col 54}{space 4} .0092316{col 67}{space 3} .0787622
{txt}{space 6}lead75 {c |}{col 14}{res}{space 2} .0517404{col 26}{space 2}  .011076{col 37}{space 1}    4.67{col 46}{space 3}0.010{col 54}{space 4} .0209884{col 67}{space 3} .0824925
{txt}{space 6}lead74 {c |}{col 14}{res}{space 2} .0514533{col 26}{space 2} .0104952{col 37}{space 1}    4.90{col 46}{space 3}0.008{col 54}{space 4} .0223139{col 67}{space 3} .0805928
{txt}{space 6}lead73 {c |}{col 14}{res}{space 2} .0487152{col 26}{space 2} .0096624{col 37}{space 1}    5.04{col 46}{space 3}0.007{col 54}{space 4} .0218881{col 67}{space 3} .0755422
{txt}{space 6}lead72 {c |}{col 14}{res}{space 2} .0481117{col 26}{space 2} .0112168{col 37}{space 1}    4.29{col 46}{space 3}0.013{col 54}{space 4} .0169688{col 67}{space 3} .0792546
{txt}{space 6}lead71 {c |}{col 14}{res}{space 2} .0399651{col 26}{space 2} .0134286{col 37}{space 1}    2.98{col 46}{space 3}0.041{col 54}{space 4} .0026813{col 67}{space 3} .0772488
{txt}{space 6}lead70 {c |}{col 14}{res}{space 2} .0333488{col 26}{space 2}  .012187{col 37}{space 1}    2.74{col 46}{space 3}0.052{col 54}{space 4}-.0004877{col 67}{space 3} .0671853
{txt}{space 6}lead69 {c |}{col 14}{res}{space 2} .0457263{col 26}{space 2}  .009435{col 37}{space 1}    4.85{col 46}{space 3}0.008{col 54}{space 4} .0195305{col 67}{space 3} .0719222
{txt}{space 6}lead68 {c |}{col 14}{res}{space 2} .0519591{col 26}{space 2} .0096817{col 37}{space 1}    5.37{col 46}{space 3}0.006{col 54}{space 4} .0250785{col 67}{space 3} .0788397
{txt}{space 6}lead67 {c |}{col 14}{res}{space 2} .0479192{col 26}{space 2} .0071523{col 37}{space 1}    6.70{col 46}{space 3}0.003{col 54}{space 4} .0280613{col 67}{space 3} .0677771
{txt}{space 6}lead66 {c |}{col 14}{res}{space 2} .0487696{col 26}{space 2}  .009079{col 37}{space 1}    5.37{col 46}{space 3}0.006{col 54}{space 4} .0235624{col 67}{space 3} .0739768
{txt}{space 6}lead65 {c |}{col 14}{res}{space 2} .0492254{col 26}{space 2}  .009853{col 37}{space 1}    5.00{col 46}{space 3}0.008{col 54}{space 4} .0218692{col 67}{space 3} .0765816
{txt}{space 6}lead64 {c |}{col 14}{res}{space 2} .0416033{col 26}{space 2} .0109704{col 37}{space 1}    3.79{col 46}{space 3}0.019{col 54}{space 4} .0111447{col 67}{space 3} .0720619
{txt}{space 6}lead63 {c |}{col 14}{res}{space 2} .0359634{col 26}{space 2} .0118713{col 37}{space 1}    3.03{col 46}{space 3}0.039{col 54}{space 4} .0030033{col 67}{space 3} .0689235
{txt}{space 6}lead62 {c |}{col 14}{res}{space 2} .0463594{col 26}{space 2} .0133144{col 37}{space 1}    3.48{col 46}{space 3}0.025{col 54}{space 4} .0093925{col 67}{space 3} .0833262
{txt}{space 6}lead61 {c |}{col 14}{res}{space 2} .0500888{col 26}{space 2} .0104121{col 37}{space 1}    4.81{col 46}{space 3}0.009{col 54}{space 4} .0211803{col 67}{space 3} .0789974
{txt}{space 6}lead60 {c |}{col 14}{res}{space 2} .0457075{col 26}{space 2} .0102004{col 37}{space 1}    4.48{col 46}{space 3}0.011{col 54}{space 4} .0173868{col 67}{space 3} .0740282
{txt}{space 6}lead59 {c |}{col 14}{res}{space 2} .0469973{col 26}{space 2} .0093543{col 37}{space 1}    5.02{col 46}{space 3}0.007{col 54}{space 4} .0210255{col 67}{space 3} .0729691
{txt}{space 6}lead58 {c |}{col 14}{res}{space 2} .0452994{col 26}{space 2}    .0076{col 37}{space 1}    5.96{col 46}{space 3}0.004{col 54}{space 4} .0241984{col 67}{space 3} .0664003
{txt}{space 6}lead57 {c |}{col 14}{res}{space 2} .0407081{col 26}{space 2}  .008649{col 37}{space 1}    4.71{col 46}{space 3}0.009{col 54}{space 4} .0166946{col 67}{space 3} .0647216
{txt}{space 6}lead56 {c |}{col 14}{res}{space 2}   .03458{col 26}{space 2} .0112528{col 37}{space 1}    3.07{col 46}{space 3}0.037{col 54}{space 4} .0033372{col 67}{space 3} .0658229
{txt}{space 6}lead55 {c |}{col 14}{res}{space 2} .0404054{col 26}{space 2} .0098588{col 37}{space 1}    4.10{col 46}{space 3}0.015{col 54}{space 4} .0130328{col 67}{space 3} .0677779
{txt}{space 6}lead54 {c |}{col 14}{res}{space 2} .0458679{col 26}{space 2}   .00722{col 37}{space 1}    6.35{col 46}{space 3}0.003{col 54}{space 4}  .025822{col 67}{space 3} .0659139
{txt}{space 6}lead53 {c |}{col 14}{res}{space 2} .0481434{col 26}{space 2} .0069769{col 37}{space 1}    6.90{col 46}{space 3}0.002{col 54}{space 4} .0287725{col 67}{space 3} .0675143
{txt}{space 6}lead52 {c |}{col 14}{res}{space 2} .0463985{col 26}{space 2} .0065798{col 37}{space 1}    7.05{col 46}{space 3}0.002{col 54}{space 4} .0281301{col 67}{space 3} .0646669
{txt}{space 6}lead51 {c |}{col 14}{res}{space 2} .0473799{col 26}{space 2} .0065819{col 37}{space 1}    7.20{col 46}{space 3}0.002{col 54}{space 4} .0291057{col 67}{space 3} .0656541
{txt}{space 6}lead50 {c |}{col 14}{res}{space 2} .0374316{col 26}{space 2} .0072801{col 37}{space 1}    5.14{col 46}{space 3}0.007{col 54}{space 4} .0172187{col 67}{space 3} .0576444
{txt}{space 6}lead49 {c |}{col 14}{res}{space 2} .0374842{col 26}{space 2} .0074541{col 37}{space 1}    5.03{col 46}{space 3}0.007{col 54}{space 4} .0167884{col 67}{space 3} .0581799
{txt}{space 6}lead48 {c |}{col 14}{res}{space 2} .0430842{col 26}{space 2} .0072626{col 37}{space 1}    5.93{col 46}{space 3}0.004{col 54}{space 4} .0229201{col 67}{space 3} .0632484
{txt}{space 6}lead47 {c |}{col 14}{res}{space 2} .0446613{col 26}{space 2} .0056969{col 37}{space 1}    7.84{col 46}{space 3}0.001{col 54}{space 4} .0288441{col 67}{space 3} .0604784
{txt}{space 6}lead46 {c |}{col 14}{res}{space 2} .0449958{col 26}{space 2} .0068102{col 37}{space 1}    6.61{col 46}{space 3}0.003{col 54}{space 4} .0260876{col 67}{space 3} .0639039
{txt}{space 6}lead45 {c |}{col 14}{res}{space 2} .0449695{col 26}{space 2} .0068484{col 37}{space 1}    6.57{col 46}{space 3}0.003{col 54}{space 4} .0259554{col 67}{space 3} .0639836
{txt}{space 6}lead44 {c |}{col 14}{res}{space 2} .0413513{col 26}{space 2} .0059127{col 37}{space 1}    6.99{col 46}{space 3}0.002{col 54}{space 4} .0249349{col 67}{space 3} .0577676
{txt}{space 6}lead43 {c |}{col 14}{res}{space 2}  .034448{col 26}{space 2}  .006158{col 37}{space 1}    5.59{col 46}{space 3}0.005{col 54}{space 4} .0173507{col 67}{space 3} .0515453
{txt}{space 6}lead42 {c |}{col 14}{res}{space 2} .0205274{col 26}{space 2} .0071249{col 37}{space 1}    2.88{col 46}{space 3}0.045{col 54}{space 4} .0007456{col 67}{space 3} .0403092
{txt}{space 6}lead41 {c |}{col 14}{res}{space 2} .0324235{col 26}{space 2} .0061985{col 37}{space 1}    5.23{col 46}{space 3}0.006{col 54}{space 4} .0152137{col 67}{space 3} .0496332
{txt}{space 6}lead40 {c |}{col 14}{res}{space 2} .0335647{col 26}{space 2} .0036748{col 37}{space 1}    9.13{col 46}{space 3}0.001{col 54}{space 4} .0233619{col 67}{space 3} .0437676
{txt}{space 6}lead39 {c |}{col 14}{res}{space 2} .0375381{col 26}{space 2} .0039057{col 37}{space 1}    9.61{col 46}{space 3}0.001{col 54}{space 4}  .026694{col 67}{space 3} .0483821
{txt}{space 6}lead38 {c |}{col 14}{res}{space 2} .0322789{col 26}{space 2} .0055853{col 37}{space 1}    5.78{col 46}{space 3}0.004{col 54}{space 4} .0167716{col 67}{space 3} .0477862
{txt}{space 6}lead37 {c |}{col 14}{res}{space 2} .0340609{col 26}{space 2} .0052377{col 37}{space 1}    6.50{col 46}{space 3}0.003{col 54}{space 4} .0195187{col 67}{space 3}  .048603
{txt}{space 6}lead36 {c |}{col 14}{res}{space 2} .0333805{col 26}{space 2} .0063236{col 37}{space 1}    5.28{col 46}{space 3}0.006{col 54}{space 4} .0158234{col 67}{space 3} .0509376
{txt}{space 6}lead35 {c |}{col 14}{res}{space 2} .0310803{col 26}{space 2} .0075747{col 37}{space 1}    4.10{col 46}{space 3}0.015{col 54}{space 4} .0100497{col 67}{space 3}  .052111
{txt}{space 6}lead34 {c |}{col 14}{res}{space 2}  .039273{col 26}{space 2} .0057293{col 37}{space 1}    6.85{col 46}{space 3}0.002{col 54}{space 4} .0233659{col 67}{space 3} .0551801
{txt}{space 6}lead33 {c |}{col 14}{res}{space 2}  .040541{col 26}{space 2} .0041445{col 37}{space 1}    9.78{col 46}{space 3}0.001{col 54}{space 4}  .029034{col 67}{space 3}  .052048
{txt}{space 6}lead32 {c |}{col 14}{res}{space 2} .0403753{col 26}{space 2} .0037207{col 37}{space 1}   10.85{col 46}{space 3}0.000{col 54}{space 4}  .030045{col 67}{space 3} .0507057
{txt}{space 6}lead31 {c |}{col 14}{res}{space 2} .0375794{col 26}{space 2} .0031235{col 37}{space 1}   12.03{col 46}{space 3}0.000{col 54}{space 4}  .028907{col 67}{space 3} .0462517
{txt}{space 6}lead30 {c |}{col 14}{res}{space 2}  .037191{col 26}{space 2} .0038132{col 37}{space 1}    9.75{col 46}{space 3}0.001{col 54}{space 4} .0266038{col 67}{space 3} .0477781
{txt}{space 6}lead29 {c |}{col 14}{res}{space 2} .0357409{col 26}{space 2} .0027482{col 37}{space 1}   13.01{col 46}{space 3}0.000{col 54}{space 4} .0281107{col 67}{space 3} .0433711
{txt}{space 6}lead28 {c |}{col 14}{res}{space 2} .0281107{col 26}{space 2} .0045423{col 37}{space 1}    6.19{col 46}{space 3}0.003{col 54}{space 4} .0154993{col 67}{space 3} .0407221
{txt}{space 6}lead27 {c |}{col 14}{res}{space 2} .0305149{col 26}{space 2} .0055406{col 37}{space 1}    5.51{col 46}{space 3}0.005{col 54}{space 4} .0151317{col 67}{space 3}  .045898
{txt}{space 6}lead26 {c |}{col 14}{res}{space 2} .0295899{col 26}{space 2} .0020952{col 37}{space 1}   14.12{col 46}{space 3}0.000{col 54}{space 4} .0237728{col 67}{space 3}  .035407
{txt}{space 6}lead25 {c |}{col 14}{res}{space 2} .0318913{col 26}{space 2} .0032966{col 37}{space 1}    9.67{col 46}{space 3}0.001{col 54}{space 4} .0227384{col 67}{space 3} .0410442
{txt}{space 6}lead24 {c |}{col 14}{res}{space 2} .0260874{col 26}{space 2} .0022789{col 37}{space 1}   11.45{col 46}{space 3}0.000{col 54}{space 4} .0197603{col 67}{space 3} .0324145
{txt}{space 6}lead23 {c |}{col 14}{res}{space 2}  .024356{col 26}{space 2}  .001908{col 37}{space 1}   12.77{col 46}{space 3}0.000{col 54}{space 4} .0190587{col 67}{space 3} .0296534
{txt}{space 6}lead22 {c |}{col 14}{res}{space 2} .0181099{col 26}{space 2}  .002505{col 37}{space 1}    7.23{col 46}{space 3}0.002{col 54}{space 4}  .011155{col 67}{space 3} .0250647
{txt}{space 6}lead21 {c |}{col 14}{res}{space 2} .0130377{col 26}{space 2} .0014385{col 37}{space 1}    9.06{col 46}{space 3}0.001{col 54}{space 4} .0090438{col 67}{space 3} .0170316
{txt}{space 6}lead20 {c |}{col 14}{res}{space 2} .0187241{col 26}{space 2} .0025413{col 37}{space 1}    7.37{col 46}{space 3}0.002{col 54}{space 4} .0116682{col 67}{space 3} .0257799
{txt}{space 6}lead19 {c |}{col 14}{res}{space 2} .0262775{col 26}{space 2} .0020205{col 37}{space 1}   13.01{col 46}{space 3}0.000{col 54}{space 4} .0206676{col 67}{space 3} .0318873
{txt}{space 6}lead18 {c |}{col 14}{res}{space 2} .0264228{col 26}{space 2} .0029823{col 37}{space 1}    8.86{col 46}{space 3}0.001{col 54}{space 4} .0181426{col 67}{space 3} .0347029
{txt}{space 6}lead17 {c |}{col 14}{res}{space 2} .0235683{col 26}{space 2} .0041618{col 37}{space 1}    5.66{col 46}{space 3}0.005{col 54}{space 4} .0120133{col 67}{space 3} .0351233
{txt}{space 6}lead16 {c |}{col 14}{res}{space 2} .0201743{col 26}{space 2} .0042411{col 37}{space 1}    4.76{col 46}{space 3}0.009{col 54}{space 4}  .008399{col 67}{space 3} .0319495
{txt}{space 6}lead15 {c |}{col 14}{res}{space 2} .0133391{col 26}{space 2} .0030197{col 37}{space 1}    4.42{col 46}{space 3}0.012{col 54}{space 4}  .004955{col 67}{space 3} .0217232
{txt}{space 6}lead14 {c |}{col 14}{res}{space 2} .0129794{col 26}{space 2} .0028642{col 37}{space 1}    4.53{col 46}{space 3}0.011{col 54}{space 4} .0050271{col 67}{space 3} .0209318
{txt}{space 6}lead13 {c |}{col 14}{res}{space 2} .0129182{col 26}{space 2} .0020726{col 37}{space 1}    6.23{col 46}{space 3}0.003{col 54}{space 4} .0071637{col 67}{space 3} .0186727
{txt}{space 6}lead12 {c |}{col 14}{res}{space 2} .0145831{col 26}{space 2}  .002137{col 37}{space 1}    6.82{col 46}{space 3}0.002{col 54}{space 4} .0086499{col 67}{space 3} .0205164
{txt}{space 6}lead11 {c |}{col 14}{res}{space 2} .0111009{col 26}{space 2} .0046371{col 37}{space 1}    2.39{col 46}{space 3}0.075{col 54}{space 4}-.0017738{col 67}{space 3} .0239755
{txt}{space 6}lead10 {c |}{col 14}{res}{space 2} .0073146{col 26}{space 2} .0030024{col 37}{space 1}    2.44{col 46}{space 3}0.071{col 54}{space 4}-.0010213{col 67}{space 3} .0156506
{txt}{space 7}lead9 {c |}{col 14}{res}{space 2} .0107729{col 26}{space 2} .0033272{col 37}{space 1}    3.24{col 46}{space 3}0.032{col 54}{space 4} .0015351{col 67}{space 3} .0200107
{txt}{space 7}lead8 {c |}{col 14}{res}{space 2} .0112593{col 26}{space 2} .0012923{col 37}{space 1}    8.71{col 46}{space 3}0.001{col 54}{space 4} .0076714{col 67}{space 3} .0148473
{txt}{space 7}lead7 {c |}{col 14}{res}{space 2} .0010925{col 26}{space 2} .0015579{col 37}{space 1}    0.70{col 46}{space 3}0.522{col 54}{space 4}-.0032328{col 67}{space 3} .0054178
{txt}{space 7}lead6 {c |}{col 14}{res}{space 2}  .002312{col 26}{space 2} .0026185{col 37}{space 1}    0.88{col 46}{space 3}0.427{col 54}{space 4}-.0049582{col 67}{space 3} .0095821
{txt}{space 7}lead5 {c |}{col 14}{res}{space 2} .0042562{col 26}{space 2}  .002956{col 37}{space 1}    1.44{col 46}{space 3}0.223{col 54}{space 4}-.0039508{col 67}{space 3} .0124633
{txt}{space 7}lead4 {c |}{col 14}{res}{space 2}  .010975{col 26}{space 2} .0027131{col 37}{space 1}    4.05{col 46}{space 3}0.016{col 54}{space 4} .0034422{col 67}{space 3} .0185078
{txt}{space 7}lead3 {c |}{col 14}{res}{space 2}    .0048{col 26}{space 2}  .003018{col 37}{space 1}    1.59{col 46}{space 3}0.187{col 54}{space 4}-.0035794{col 67}{space 3} .0131794
{txt}{space 7}lead2 {c |}{col 14}{res}{space 2}  .004953{col 26}{space 2} .0020679{col 37}{space 1}    2.40{col 46}{space 3}0.075{col 54}{space 4}-.0007885{col 67}{space 3} .0106945
{txt}{space 8}lag0 {c |}{col 14}{res}{space 2}-.0021629{col 26}{space 2} .0029923{col 37}{space 1}   -0.72{col 46}{space 3}0.510{col 54}{space 4}-.0104708{col 67}{space 3} .0061451
{txt}{space 8}lag1 {c |}{col 14}{res}{space 2}-.0009058{col 26}{space 2} .0043708{col 37}{space 1}   -0.21{col 46}{space 3}0.846{col 54}{space 4}-.0130413{col 67}{space 3} .0112296
{txt}{space 8}lag2 {c |}{col 14}{res}{space 2} .0035535{col 26}{space 2}  .002025{col 37}{space 1}    1.75{col 46}{space 3}0.154{col 54}{space 4}-.0020688{col 67}{space 3} .0091758
{txt}{space 8}lag3 {c |}{col 14}{res}{space 2} .0075214{col 26}{space 2}  .001046{col 37}{space 1}    7.19{col 46}{space 3}0.002{col 54}{space 4} .0046172{col 67}{space 3} .0104256
{txt}{space 8}lag4 {c |}{col 14}{res}{space 2}-.0010772{col 26}{space 2} .0008911{col 37}{space 1}   -1.21{col 46}{space 3}0.293{col 54}{space 4}-.0035513{col 67}{space 3} .0013969
{txt}{space 8}lag5 {c |}{col 14}{res}{space 2}-.0005784{col 26}{space 2} .0015631{col 37}{space 1}   -0.37{col 46}{space 3}0.730{col 54}{space 4}-.0049183{col 67}{space 3} .0037616
{txt}{space 8}lag6 {c |}{col 14}{res}{space 2}-.0035929{col 26}{space 2} .0017746{col 37}{space 1}   -2.02{col 46}{space 3}0.113{col 54}{space 4}  -.00852{col 67}{space 3} .0013343
{txt}{space 8}lag7 {c |}{col 14}{res}{space 2}-.0026556{col 26}{space 2} .0031845{col 37}{space 1}   -0.83{col 46}{space 3}0.451{col 54}{space 4}-.0114972{col 67}{space 3} .0061861
{txt}{space 8}lag8 {c |}{col 14}{res}{space 2} .0002029{col 26}{space 2} .0034319{col 37}{space 1}    0.06{col 46}{space 3}0.956{col 54}{space 4}-.0093256{col 67}{space 3} .0097315
{txt}{space 8}lag9 {c |}{col 14}{res}{space 2} .0057665{col 26}{space 2} .0013971{col 37}{space 1}    4.13{col 46}{space 3}0.015{col 54}{space 4} .0018874{col 67}{space 3} .0096456
{txt}{space 7}lag10 {c |}{col 14}{res}{space 2} .0009541{col 26}{space 2} .0018044{col 37}{space 1}    0.53{col 46}{space 3}0.625{col 54}{space 4}-.0040558{col 67}{space 3} .0059639
{txt}{space 7}lag11 {c |}{col 14}{res}{space 2} .0019607{col 26}{space 2} .0015344{col 37}{space 1}    1.28{col 46}{space 3}0.270{col 54}{space 4}-.0022993{col 67}{space 3} .0062208
{txt}{space 7}lag12 {c |}{col 14}{res}{space 2} .0092618{col 26}{space 2}  .002266{col 37}{space 1}    4.09{col 46}{space 3}0.015{col 54}{space 4} .0029705{col 67}{space 3} .0155531
{txt}{space 7}lag13 {c |}{col 14}{res}{space 2} .0028502{col 26}{space 2} .0050511{col 37}{space 1}    0.56{col 46}{space 3}0.603{col 54}{space 4}-.0111739{col 67}{space 3} .0168742
{txt}{space 7}lag14 {c |}{col 14}{res}{space 2}-.0058446{col 26}{space 2} .0031371{col 37}{space 1}   -1.86{col 46}{space 3}0.136{col 54}{space 4}-.0145545{col 67}{space 3} .0028653
{txt}{space 7}lag15 {c |}{col 14}{res}{space 2} .0030561{col 26}{space 2} .0047629{col 37}{space 1}    0.64{col 46}{space 3}0.556{col 54}{space 4}-.0101678{col 67}{space 3}   .01628
{txt}{space 7}lag16 {c |}{col 14}{res}{space 2} .0053994{col 26}{space 2} .0037136{col 37}{space 1}    1.45{col 46}{space 3}0.220{col 54}{space 4}-.0049113{col 67}{space 3}   .01571
{txt}{space 7}lag17 {c |}{col 14}{res}{space 2}-.0034828{col 26}{space 2} .0027867{col 37}{space 1}   -1.25{col 46}{space 3}0.280{col 54}{space 4}  -.01122{col 67}{space 3} .0042544
{txt}{space 7}lag18 {c |}{col 14}{res}{space 2}-.0036389{col 26}{space 2} .0035141{col 37}{space 1}   -1.04{col 46}{space 3}0.359{col 54}{space 4}-.0133955{col 67}{space 3} .0061177
{txt}{space 7}lag19 {c |}{col 14}{res}{space 2}-.0046787{col 26}{space 2} .0027561{col 37}{space 1}   -1.70{col 46}{space 3}0.165{col 54}{space 4}-.0123308{col 67}{space 3} .0029735
{txt}{space 7}lag20 {c |}{col 14}{res}{space 2}-.0152517{col 26}{space 2} .0042488{col 37}{space 1}   -3.59{col 46}{space 3}0.023{col 54}{space 4}-.0270483{col 67}{space 3}-.0034552
{txt}{space 7}lag21 {c |}{col 14}{res}{space 2}-.0145845{col 26}{space 2} .0047782{col 37}{space 1}   -3.05{col 46}{space 3}0.038{col 54}{space 4}-.0278508{col 67}{space 3}-.0013181
{txt}{space 7}lag22 {c |}{col 14}{res}{space 2}-.0067265{col 26}{space 2}  .002819{col 37}{space 1}   -2.39{col 46}{space 3}0.075{col 54}{space 4}-.0145535{col 67}{space 3} .0011004
{txt}{space 7}lag23 {c |}{col 14}{res}{space 2}-.0063677{col 26}{space 2} .0021382{col 37}{space 1}   -2.98{col 46}{space 3}0.041{col 54}{space 4}-.0123043{col 67}{space 3} -.000431
{txt}{space 7}lag24 {c |}{col 14}{res}{space 2} -.009029{col 26}{space 2} .0030612{col 37}{space 1}   -2.95{col 46}{space 3}0.042{col 54}{space 4}-.0175283{col 67}{space 3}-.0005297
{txt}{space 7}lag25 {c |}{col 14}{res}{space 2} -.006645{col 26}{space 2} .0035124{col 37}{space 1}   -1.89{col 46}{space 3}0.131{col 54}{space 4}-.0163972{col 67}{space 3} .0031071
{txt}{space 7}lag26 {c |}{col 14}{res}{space 2}-.0020701{col 26}{space 2} .0057809{col 37}{space 1}   -0.36{col 46}{space 3}0.738{col 54}{space 4}-.0181204{col 67}{space 3} .0139802
{txt}{space 7}lag27 {c |}{col 14}{res}{space 2}-.0079834{col 26}{space 2} .0065416{col 37}{space 1}   -1.22{col 46}{space 3}0.289{col 54}{space 4}-.0261456{col 67}{space 3} .0101789
{txt}{space 7}lag28 {c |}{col 14}{res}{space 2}-.0054707{col 26}{space 2} .0065939{col 37}{space 1}   -0.83{col 46}{space 3}0.453{col 54}{space 4}-.0237784{col 67}{space 3} .0128369
{txt}{space 7}lag29 {c |}{col 14}{res}{space 2}-.0085333{col 26}{space 2} .0070225{col 37}{space 1}   -1.22{col 46}{space 3}0.291{col 54}{space 4} -.028031{col 67}{space 3} .0109645
{txt}{space 7}lag30 {c |}{col 14}{res}{space 2}-.0094661{col 26}{space 2} .0079603{col 37}{space 1}   -1.19{col 46}{space 3}0.300{col 54}{space 4}-.0315675{col 67}{space 3} .0126353
{txt}{space 7}lag31 {c |}{col 14}{res}{space 2}-.0016151{col 26}{space 2} .0034988{col 37}{space 1}   -0.46{col 46}{space 3}0.668{col 54}{space 4}-.0113295{col 67}{space 3} .0080992
{txt}{space 7}lag32 {c |}{col 14}{res}{space 2}-.0061865{col 26}{space 2} .0036884{col 37}{space 1}   -1.68{col 46}{space 3}0.169{col 54}{space 4} -.016427{col 67}{space 3} .0040541
{txt}{space 7}lag33 {c |}{col 14}{res}{space 2}-.0037428{col 26}{space 2} .0040728{col 37}{space 1}   -0.92{col 46}{space 3}0.410{col 54}{space 4}-.0150507{col 67}{space 3} .0075652
{txt}{space 7}lag34 {c |}{col 14}{res}{space 2}-.0068311{col 26}{space 2}  .004922{col 37}{space 1}   -1.39{col 46}{space 3}0.237{col 54}{space 4}-.0204967{col 67}{space 3} .0068345
{txt}{space 7}lag35 {c |}{col 14}{res}{space 2}-.0141332{col 26}{space 2} .0057112{col 37}{space 1}   -2.47{col 46}{space 3}0.069{col 54}{space 4}-.0299899{col 67}{space 3} .0017235
{txt}{space 7}lag36 {c |}{col 14}{res}{space 2}-.0136505{col 26}{space 2}  .006313{col 37}{space 1}   -2.16{col 46}{space 3}0.097{col 54}{space 4}-.0311783{col 67}{space 3} .0038773
{txt}{space 7}lag37 {c |}{col 14}{res}{space 2}-.0115749{col 26}{space 2} .0055868{col 37}{space 1}   -2.07{col 46}{space 3}0.107{col 54}{space 4}-.0270863{col 67}{space 3} .0039366
{txt}{space 7}lag38 {c |}{col 14}{res}{space 2}-.0057481{col 26}{space 2} .0041748{col 37}{space 1}   -1.38{col 46}{space 3}0.241{col 54}{space 4}-.0173393{col 67}{space 3} .0058431
{txt}{space 7}lag39 {c |}{col 14}{res}{space 2}-.0045442{col 26}{space 2} .0044632{col 37}{space 1}   -1.02{col 46}{space 3}0.366{col 54}{space 4}-.0169361{col 67}{space 3} .0078476
{txt}{space 7}lag40 {c |}{col 14}{res}{space 2} -.012551{col 26}{space 2} .0061987{col 37}{space 1}   -2.02{col 46}{space 3}0.113{col 54}{space 4}-.0297613{col 67}{space 3} .0046594
{txt}{space 7}lag41 {c |}{col 14}{res}{space 2} -.013728{col 26}{space 2} .0073774{col 37}{space 1}   -1.86{col 46}{space 3}0.136{col 54}{space 4}-.0342109{col 67}{space 3}  .006755
{txt}{space 7}lag42 {c |}{col 14}{res}{space 2} -.012939{col 26}{space 2} .0096503{col 37}{space 1}   -1.34{col 46}{space 3}0.251{col 54}{space 4}-.0397325{col 67}{space 3} .0138545
{txt}{space 7}lag43 {c |}{col 14}{res}{space 2}-.0143196{col 26}{space 2} .0067771{col 37}{space 1}   -2.11{col 46}{space 3}0.102{col 54}{space 4}-.0331358{col 67}{space 3} .0044967
{txt}{space 7}lag44 {c |}{col 14}{res}{space 2}-.0092798{col 26}{space 2} .0059362{col 37}{space 1}   -1.56{col 46}{space 3}0.193{col 54}{space 4}-.0257614{col 67}{space 3} .0072017
{txt}{space 7}lag45 {c |}{col 14}{res}{space 2} -.019952{col 26}{space 2} .0062653{col 37}{space 1}   -3.18{col 46}{space 3}0.033{col 54}{space 4}-.0373472{col 67}{space 3}-.0025567
{txt}{space 7}lag46 {c |}{col 14}{res}{space 2}-.0192118{col 26}{space 2} .0085055{col 37}{space 1}   -2.26{col 46}{space 3}0.087{col 54}{space 4}-.0428267{col 67}{space 3} .0044032
{txt}{space 7}lag47 {c |}{col 14}{res}{space 2}-.0162245{col 26}{space 2}  .007447{col 37}{space 1}   -2.18{col 46}{space 3}0.095{col 54}{space 4}-.0369006{col 67}{space 3} .0044516
{txt}{space 7}lag48 {c |}{col 14}{res}{space 2} -.016293{col 26}{space 2} .0102073{col 37}{space 1}   -1.60{col 46}{space 3}0.186{col 54}{space 4} -.044633{col 67}{space 3}  .012047
{txt}{space 7}lag49 {c |}{col 14}{res}{space 2}-.0204741{col 26}{space 2} .0099332{col 37}{space 1}   -2.06{col 46}{space 3}0.108{col 54}{space 4}-.0480531{col 67}{space 3} .0071048
{txt}{space 7}lag50 {c |}{col 14}{res}{space 2}-.0090782{col 26}{space 2} .0084788{col 37}{space 1}   -1.07{col 46}{space 3}0.345{col 54}{space 4}-.0326191{col 67}{space 3} .0144626
{txt}{space 7}lag51 {c |}{col 14}{res}{space 2}-.0080104{col 26}{space 2} .0046793{col 37}{space 1}   -1.71{col 46}{space 3}0.162{col 54}{space 4}-.0210022{col 67}{space 3} .0049813
{txt}{space 7}lag52 {c |}{col 14}{res}{space 2}-.0046684{col 26}{space 2} .0053936{col 37}{space 1}   -0.87{col 46}{space 3}0.436{col 54}{space 4}-.0196436{col 67}{space 3} .0103067
{txt}{space 7}lag53 {c |}{col 14}{res}{space 2}-.0077198{col 26}{space 2}  .006369{col 37}{space 1}   -1.21{col 46}{space 3}0.292{col 54}{space 4}-.0254031{col 67}{space 3} .0099636
{txt}{space 7}lag54 {c |}{col 14}{res}{space 2}-.0086365{col 26}{space 2} .0084054{col 37}{space 1}   -1.03{col 46}{space 3}0.362{col 54}{space 4}-.0319738{col 67}{space 3} .0147007
{txt}{space 7}lag55 {c |}{col 14}{res}{space 2} -.010095{col 26}{space 2} .0117703{col 37}{space 1}   -0.86{col 46}{space 3}0.439{col 54}{space 4}-.0427747{col 67}{space 3} .0225847
{txt}{space 7}lag56 {c |}{col 14}{res}{space 2}-.0211869{col 26}{space 2}  .010486{col 37}{space 1}   -2.02{col 46}{space 3}0.113{col 54}{space 4}-.0503007{col 67}{space 3} .0079269
{txt}{space 7}lag57 {c |}{col 14}{res}{space 2}-.0169185{col 26}{space 2} .0108346{col 37}{space 1}   -1.56{col 46}{space 3}0.193{col 54}{space 4}    -.047{col 67}{space 3} .0131631
{txt}{space 7}lag58 {c |}{col 14}{res}{space 2}-.0155163{col 26}{space 2} .0100323{col 37}{space 1}   -1.55{col 46}{space 3}0.197{col 54}{space 4}-.0433704{col 67}{space 3} .0123378
{txt}{space 7}lag59 {c |}{col 14}{res}{space 2}-.0253821{col 26}{space 2} .0076864{col 37}{space 1}   -3.30{col 46}{space 3}0.030{col 54}{space 4}-.0467229{col 67}{space 3}-.0040413
{txt}{space 7}lag60 {c |}{col 14}{res}{space 2}-.0160595{col 26}{space 2} .0092544{col 37}{space 1}   -1.74{col 46}{space 3}0.158{col 54}{space 4}-.0417539{col 67}{space 3} .0096349
{txt}{space 7}lag61 {c |}{col 14}{res}{space 2}-.0191245{col 26}{space 2} .0093167{col 37}{space 1}   -2.05{col 46}{space 3}0.109{col 54}{space 4}-.0449918{col 67}{space 3} .0067429
{txt}{space 7}lag62 {c |}{col 14}{res}{space 2}-.0160806{col 26}{space 2} .0103638{col 37}{space 1}   -1.55{col 46}{space 3}0.196{col 54}{space 4}-.0448551{col 67}{space 3} .0126939
{txt}{space 7}lag63 {c |}{col 14}{res}{space 2} -.014331{col 26}{space 2}  .012376{col 37}{space 1}   -1.16{col 46}{space 3}0.311{col 54}{space 4}-.0486923{col 67}{space 3} .0200304
{txt}{space 7}lag64 {c |}{col 14}{res}{space 2}-.0119235{col 26}{space 2} .0117149{col 37}{space 1}   -1.02{col 46}{space 3}0.366{col 54}{space 4}-.0444494{col 67}{space 3} .0206024
{txt}{space 7}lag65 {c |}{col 14}{res}{space 2}-.0070355{col 26}{space 2} .0122594{col 37}{space 1}   -0.57{col 46}{space 3}0.597{col 54}{space 4}-.0410731{col 67}{space 3} .0270021
{txt}{space 7}lag66 {c |}{col 14}{res}{space 2}-.0116285{col 26}{space 2} .0097794{col 37}{space 1}   -1.19{col 46}{space 3}0.300{col 54}{space 4}-.0387806{col 67}{space 3} .0155235
{txt}{space 7}lag67 {c |}{col 14}{res}{space 2}-.0237869{col 26}{space 2} .0130915{col 37}{space 1}   -1.82{col 46}{space 3}0.143{col 54}{space 4}-.0601347{col 67}{space 3} .0125609
{txt}{space 7}lag68 {c |}{col 14}{res}{space 2} -.022726{col 26}{space 2} .0113396{col 37}{space 1}   -2.00{col 46}{space 3}0.116{col 54}{space 4}-.0542097{col 67}{space 3} .0087576
{txt}{space 7}lag69 {c |}{col 14}{res}{space 2}-.0198474{col 26}{space 2} .0092616{col 37}{space 1}   -2.14{col 46}{space 3}0.099{col 54}{space 4}-.0455618{col 67}{space 3} .0058671
{txt}{space 7}lag70 {c |}{col 14}{res}{space 2}-.0171496{col 26}{space 2} .0084589{col 37}{space 1}   -2.03{col 46}{space 3}0.113{col 54}{space 4}-.0406353{col 67}{space 3} .0063361
{txt}{space 7}lag71 {c |}{col 14}{res}{space 2}-.0074389{col 26}{space 2} .0094523{col 37}{space 1}   -0.79{col 46}{space 3}0.475{col 54}{space 4}-.0336826{col 67}{space 3} .0188047
{txt}{space 7}lag72 {c |}{col 14}{res}{space 2}-.0075793{col 26}{space 2} .0122051{col 37}{space 1}   -0.62{col 46}{space 3}0.568{col 54}{space 4}-.0414661{col 67}{space 3} .0263074
{txt}{space 7}lag73 {c |}{col 14}{res}{space 2}-.0094679{col 26}{space 2} .0123904{col 37}{space 1}   -0.76{col 46}{space 3}0.487{col 54}{space 4}-.0438692{col 67}{space 3} .0249335
{txt}{space 7}lag74 {c |}{col 14}{res}{space 2}-.0116499{col 26}{space 2} .0088051{col 37}{space 1}   -1.32{col 46}{space 3}0.256{col 54}{space 4}-.0360967{col 67}{space 3} .0127968
{txt}{space 7}lag75 {c |}{col 14}{res}{space 2}-.0115518{col 26}{space 2}  .011804{col 37}{space 1}   -0.98{col 46}{space 3}0.383{col 54}{space 4} -.044325{col 67}{space 3} .0212213
{txt}{space 7}lag76 {c |}{col 14}{res}{space 2}-.0135058{col 26}{space 2} .0137512{col 37}{space 1}   -0.98{col 46}{space 3}0.382{col 54}{space 4}-.0516852{col 67}{space 3} .0246737
{txt}{space 7}lag77 {c |}{col 14}{res}{space 2}-.0150825{col 26}{space 2} .0134952{col 37}{space 1}   -1.12{col 46}{space 3}0.326{col 54}{space 4}-.0525511{col 67}{space 3}  .022386
{txt}{space 7}lag78 {c |}{col 14}{res}{space 2}-.0108693{col 26}{space 2} .0140151{col 37}{space 1}   -0.78{col 46}{space 3}0.481{col 54}{space 4}-.0497814{col 67}{space 3} .0280429
{txt}{space 7}lag79 {c |}{col 14}{res}{space 2}-.0052342{col 26}{space 2} .0115642{col 37}{space 1}   -0.45{col 46}{space 3}0.674{col 54}{space 4}-.0373415{col 67}{space 3} .0268732
{txt}{space 7}lag80 {c |}{col 14}{res}{space 2}-.0078973{col 26}{space 2}  .010837{col 37}{space 1}   -0.73{col 46}{space 3}0.507{col 54}{space 4}-.0379857{col 67}{space 3}  .022191
{txt}{space 7}lag81 {c |}{col 14}{res}{space 2}-.0047139{col 26}{space 2}  .013439{col 37}{space 1}   -0.35{col 46}{space 3}0.743{col 54}{space 4}-.0420265{col 67}{space 3} .0325987
{txt}{space 7}lag82 {c |}{col 14}{res}{space 2}-.0028741{col 26}{space 2} .0089462{col 37}{space 1}   -0.32{col 46}{space 3}0.764{col 54}{space 4}-.0277127{col 67}{space 3} .0219645
{txt}{space 7}lag83 {c |}{col 14}{res}{space 2}-.0125256{col 26}{space 2}  .009656{col 37}{space 1}   -1.30{col 46}{space 3}0.264{col 54}{space 4}-.0393351{col 67}{space 3} .0142838
{txt}{space 7}lag84 {c |}{col 14}{res}{space 2}-.0160032{col 26}{space 2} .0095689{col 37}{space 1}   -1.67{col 46}{space 3}0.170{col 54}{space 4}-.0425707{col 67}{space 3} .0105643
{txt}{space 7}lag85 {c |}{col 14}{res}{space 2}-.0093499{col 26}{space 2} .0125642{col 37}{space 1}   -0.74{col 46}{space 3}0.498{col 54}{space 4}-.0442337{col 67}{space 3} .0255339
{txt}{space 7}lag86 {c |}{col 14}{res}{space 2}-.0042069{col 26}{space 2} .0117561{col 37}{space 1}   -0.36{col 46}{space 3}0.739{col 54}{space 4} -.036847{col 67}{space 3} .0284333
{txt}{space 7}lag87 {c |}{col 14}{res}{space 2}-.0031277{col 26}{space 2} .0121253{col 37}{space 1}   -0.26{col 46}{space 3}0.809{col 54}{space 4}-.0367929{col 67}{space 3} .0305376
{txt}{space 7}lag88 {c |}{col 14}{res}{space 2} -.002966{col 26}{space 2} .0129678{col 37}{space 1}   -0.23{col 46}{space 3}0.830{col 54}{space 4}-.0389705{col 67}{space 3} .0330385
{txt}{space 7}lag89 {c |}{col 14}{res}{space 2}-.0065717{col 26}{space 2} .0145257{col 37}{space 1}   -0.45{col 46}{space 3}0.674{col 54}{space 4}-.0469015{col 67}{space 3}  .033758
{txt}{space 7}lag90 {c |}{col 14}{res}{space 2}-.0099258{col 26}{space 2}  .012237{col 37}{space 1}   -0.81{col 46}{space 3}0.463{col 54}{space 4} -.043901{col 67}{space 3} .0240494
{txt}{space 7}lag91 {c |}{col 14}{res}{space 2}-.0049867{col 26}{space 2} .0131769{col 37}{space 1}   -0.38{col 46}{space 3}0.724{col 54}{space 4}-.0415716{col 67}{space 3} .0315982
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6775089{col 26}{space 2}  .074125{col 37}{space 1}    9.14{col 46}{space 3}0.001{col 54}{space 4} .4717049{col 67}{space 3} .8833129
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}   regionid1{col 14}{c |}{space 1}        5{col 27}{space 1}        5{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}        date{col 14}{c |}{space 1}     5267{col 27}{space 1}        1{col 39}{result}{space 1}     5266{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. graph export "results/EventStudy-Elec.png", replace
{txt}{p 0 4 2}
file {bf}
results/EventStudy-Elec.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. /******************** 4. **DDD Design and Event Study:**************************
>    - DiD regressions with additional interaction terms for DDD design.
>    - Event studies for CO2 emissions and electricity consumption in DDD design.
>    - Results are stored in `eststo CO2_DDD` and `eststo Elec_DDD`.
>    - Event studies are exported to files.*/
. 
. use "data/05-half-hourly.dta", clear
{txt}
{com}. /// DDD regression - adjusting for midday emissions
> reg co2_kg_per_capita c.dst_here_anytime##c.dst_now_anywhere##c.not_midday ///
>  weekend_local public_holiday temperature c.temperature#c.temperature ///
>  solar_exposure wind_3 [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.2140
                                                {txt}Root MSE          =    {res} .14328

{txt}{ralign 78:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}co2_kg_per~a{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_a~e {c |}{col 14}{res}{space 2}-.1336649{col 26}{space 2} .0305683{col 37}{space 1}   -4.37{col 46}{space 3}0.012{col 54}{space 4}-.2185361{col 67}{space 3}-.0487937
{txt}dst_now_an~e {c |}{col 14}{res}{space 2}  .060464{col 26}{space 2} .0173514{col 37}{space 1}    3.48{col 46}{space 3}0.025{col 54}{space 4} .0122888{col 67}{space 3} .1086392
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_here_a~e#{c |}
{space 10}c. {c |}
dst_now_an~e {c |}{col 14}{res}{space 2}-.0302584{col 26}{space 2} .0185874{col 37}{space 1}   -1.63{col 46}{space 3}0.179{col 54}{space 4}-.0818654{col 67}{space 3} .0213486
{txt}{space 12} {c |}
{space 2}not_midday {c |}{col 14}{res}{space 2} .0272147{col 26}{space 2} 8.78e-13{col 37}{space 1} 3.1e+10{col 46}{space 3}0.000{col 54}{space 4} .0272147{col 67}{space 3} .0272147
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_here_a~e#{c |}
c.not_midday {c |}{col 14}{res}{space 2}-.0115234{col 26}{space 2} .0087439{col 37}{space 1}   -1.32{col 46}{space 3}0.258{col 54}{space 4}-.0358004{col 67}{space 3} .0127536
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_now_an~e#{c |}
c.not_midday {c |}{col 14}{res}{space 2}-.0381789{col 26}{space 2} 2.00e-12{col 37}{space 1}-1.9e+10{col 46}{space 3}0.000{col 54}{space 4}-.0381789{col 67}{space 3}-.0381789
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_here_a~e#{c |}
{space 10}c. {c |}
dst_now_an~e#{c |}
c.not_midday {c |}{col 14}{res}{space 2} .0135575{col 26}{space 2} .0128878{col 37}{space 1}    1.05{col 46}{space 3}0.352{col 54}{space 4}-.0222249{col 67}{space 3} .0493399
{txt}{space 12} {c |}
weekend_lo~l {c |}{col 14}{res}{space 2}-.0338318{col 26}{space 2} .0013229{col 37}{space 1}  -25.57{col 46}{space 3}0.000{col 54}{space 4}-.0375047{col 67}{space 3}-.0301589
{txt}public_hol~y {c |}{col 14}{res}{space 2} -.037795{col 26}{space 2} .0055605{col 37}{space 1}   -6.80{col 46}{space 3}0.002{col 54}{space 4}-.0532334{col 67}{space 3}-.0223567
{txt}{space 1}temperature {c |}{col 14}{res}{space 2}-.0108864{col 26}{space 2} .0141706{col 37}{space 1}   -0.77{col 46}{space 3}0.485{col 54}{space 4}-.0502305{col 67}{space 3} .0284576
{txt}{space 12} {c |}
{space 10}c. {c |}
{space 1}temperature#{c |}
{space 10}c. {c |}
{space 1}temperature {c |}{col 14}{res}{space 2} .0002718{col 26}{space 2} .0002346{col 37}{space 1}    1.16{col 46}{space 3}0.311{col 54}{space 4}-.0003796{col 67}{space 3} .0009232
{txt}{space 12} {c |}
solar_expo~e {c |}{col 14}{res}{space 2}-.0042183{col 26}{space 2}   .00631{col 37}{space 1}   -0.67{col 46}{space 3}0.540{col 54}{space 4}-.0217376{col 67}{space 3} .0133011
{txt}{space 6}wind_3 {c |}{col 14}{res}{space 2}-.0593653{col 26}{space 2} .0249105{col 37}{space 1}   -2.38{col 46}{space 3}0.076{col 54}{space 4}-.1285279{col 67}{space 3} .0097974
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .7120429{col 26}{space 2} .2152255{col 37}{space 1}    3.31{col 46}{space 3}0.030{col 54}{space 4} .1144812{col 67}{space 3} 1.309605
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo CO2_DDD
{txt}
{com}. 
. reg energy_kwh_per_capita c.dst_here_anytime##c.dst_now_anywhere##c.not_midday ///
> weekend_local public_holiday c.temperature##c.temperature ///
> solar_exposure wind_3 [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.3797
                                                {txt}Root MSE          =    {res} .12152

{txt}{ralign 78:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}energy_kwh~a{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_a~e {c |}{col 14}{res}{space 2}-.2157261{col 26}{space 2} .0215915{col 37}{space 1}   -9.99{col 46}{space 3}0.001{col 54}{space 4}-.2756737{col 67}{space 3}-.1557784
{txt}dst_now_an~e {c |}{col 14}{res}{space 2} .0788247{col 26}{space 2} .0173534{col 37}{space 1}    4.54{col 46}{space 3}0.010{col 54}{space 4} .0306438{col 67}{space 3} .1270056
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_here_a~e#{c |}
{space 10}c. {c |}
dst_now_an~e {c |}{col 14}{res}{space 2}-.0400922{col 26}{space 2} .0196082{col 37}{space 1}   -2.04{col 46}{space 3}0.110{col 54}{space 4}-.0945333{col 67}{space 3} .0143488
{txt}{space 12} {c |}
{space 2}not_midday {c |}{col 14}{res}{space 2} .0143327{col 26}{space 2} 1.00e-12{col 37}{space 1} 1.4e+10{col 46}{space 3}0.000{col 54}{space 4} .0143327{col 67}{space 3} .0143327
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_here_a~e#{c |}
c.not_midday {c |}{col 14}{res}{space 2}  .000875{col 26}{space 2} .0060793{col 37}{space 1}    0.14{col 46}{space 3}0.893{col 54}{space 4} -.016004{col 67}{space 3} .0177539
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_now_an~e#{c |}
c.not_midday {c |}{col 14}{res}{space 2}-.0528644{col 26}{space 2} 2.33e-12{col 37}{space 1}-2.3e+10{col 46}{space 3}0.000{col 54}{space 4}-.0528644{col 67}{space 3}-.0528644
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_here_a~e#{c |}
{space 10}c. {c |}
dst_now_an~e#{c |}
c.not_midday {c |}{col 14}{res}{space 2} .0185139{col 26}{space 2} .0109655{col 37}{space 1}    1.69{col 46}{space 3}0.167{col 54}{space 4}-.0119311{col 67}{space 3}  .048959
{txt}{space 12} {c |}
weekend_lo~l {c |}{col 14}{res}{space 2}-.0461577{col 26}{space 2} .0018092{col 37}{space 1}  -25.51{col 46}{space 3}0.000{col 54}{space 4}-.0511808{col 67}{space 3}-.0411346
{txt}public_hol~y {c |}{col 14}{res}{space 2}-.0498078{col 26}{space 2} .0038723{col 37}{space 1}  -12.86{col 46}{space 3}0.000{col 54}{space 4}-.0605591{col 67}{space 3}-.0390564
{txt}{space 1}temperature {c |}{col 14}{res}{space 2}-.0250169{col 26}{space 2} .0167781{col 37}{space 1}   -1.49{col 46}{space 3}0.210{col 54}{space 4}-.0716002{col 67}{space 3} .0215665
{txt}{space 12} {c |}
{space 10}c. {c |}
{space 1}temperature#{c |}
{space 10}c. {c |}
{space 1}temperature {c |}{col 14}{res}{space 2} .0005213{col 26}{space 2} .0002887{col 37}{space 1}    1.81{col 46}{space 3}0.145{col 54}{space 4}-.0002803{col 67}{space 3} .0013228
{txt}{space 12} {c |}
solar_expo~e {c |}{col 14}{res}{space 2}-.0081455{col 26}{space 2} .0059963{col 37}{space 1}   -1.36{col 46}{space 3}0.246{col 54}{space 4}-.0247938{col 67}{space 3} .0085028
{txt}{space 6}wind_3 {c |}{col 14}{res}{space 2} .0041665{col 26}{space 2} .0118573{col 37}{space 1}    0.35{col 46}{space 3}0.743{col 54}{space 4}-.0287547{col 67}{space 3} .0370877
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .9948273{col 26}{space 2}  .264996{col 37}{space 1}    3.75{col 46}{space 3}0.020{col 54}{space 4} .2590805{col 67}{space 3} 1.730574
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo Elec_DDD
{txt}
{com}. 
. esttab CO2_DDD Elec_DDD using "results/DDD-results.tex", ///
>  label se stats(r2 r2_a) replace
{res}{txt}(output written to {browse  `"results/DDD-results.tex"'})

{com}. 
. //DDD Event study
. use "data/05-half-hourly.dta", clear
{txt}
{com}. gen timevar = .
{txt}(1,264,072 missing values generated)

{com}. replace timevar = days_into_dst if dst_here_anytime == 1
{txt}(1,011,256 real changes made)

{com}. 
. eventdd co2_g_per_capita_vs_midday public_holiday c.temperature##c.temperature ///
> solar_exposure wind_3  [aweight = population], timevar(timevar) ///
>  method(hdfe, absorb(regionid1 date) cluster(regionid1)) ///
>  graph_op(ytitle("Co2 g per capita") xtitle("Days until DST transition") ///
>  title("Event Study - CO2 - Midday Normalised"))
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}{txt}warning: missing F statistic; dropped variables due to collinearity or too few clusters
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,264,072
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F( 190,      4)}{col 67}=          {res}.
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.3164
{txt}{col 51}Adj R-squared{col 67}= {res}    0.3135
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0238
{txt}{col 1}Number of clusters ({res}regionid1{txt}) {col 30}= {res}         5{txt}{col 51}Root MSE{col 67}= {res}   58.8792

{txt}{ralign 78:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}co2_g_per_~y{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
public_hol~y {c |}{col 14}{res}{space 2} 13.63367{col 26}{space 2} 3.164202{col 37}{space 1}    4.31{col 46}{space 3}0.013{col 54}{space 4} 4.848438{col 67}{space 3}  22.4189
{txt}{space 1}temperature {c |}{col 14}{res}{space 2} 11.56978{col 26}{space 2} 1.610186{col 37}{space 1}    7.19{col 46}{space 3}0.002{col 54}{space 4} 7.099189{col 67}{space 3} 16.04038
{txt}{space 12} {c |}
{space 10}c. {c |}
{space 1}temperature#{c |}
{space 10}c. {c |}
{space 1}temperature {c |}{col 14}{res}{space 2}-.2402449{col 26}{space 2} .0262627{col 37}{space 1}   -9.15{col 46}{space 3}0.001{col 54}{space 4}-.3131618{col 67}{space 3} -.167328
{txt}{space 12} {c |}
solar_expo~e {c |}{col 14}{res}{space 2} 3.648969{col 26}{space 2} .8081776{col 37}{space 1}    4.52{col 46}{space 3}0.011{col 54}{space 4} 1.405108{col 67}{space 3}  5.89283
{txt}{space 6}wind_3 {c |}{col 14}{res}{space 2}-2.129461{col 26}{space 2}  .794457{col 37}{space 1}   -2.68{col 46}{space 3}0.055{col 54}{space 4}-4.335228{col 67}{space 3} .0763049
{txt}{space 6}lead94 {c |}{col 14}{res}{space 2} 11.34534{col 26}{space 2} 7.629656{col 37}{space 1}    1.49{col 46}{space 3}0.211{col 54}{space 4} -9.83798{col 67}{space 3} 32.52866
{txt}{space 6}lead93 {c |}{col 14}{res}{space 2}-1.835093{col 26}{space 2} 2.733413{col 37}{space 1}   -0.67{col 46}{space 3}0.539{col 54}{space 4}-9.424264{col 67}{space 3} 5.754078
{txt}{space 6}lead92 {c |}{col 14}{res}{space 2} 18.69001{col 26}{space 2} 7.956286{col 37}{space 1}    2.35{col 46}{space 3}0.079{col 54}{space 4}-3.400187{col 67}{space 3}  40.7802
{txt}{space 6}lead91 {c |}{col 14}{res}{space 2} 6.578119{col 26}{space 2} 11.68034{col 37}{space 1}    0.56{col 46}{space 3}0.603{col 54}{space 4} -25.8517{col 67}{space 3} 39.00793
{txt}{space 6}lead90 {c |}{col 14}{res}{space 2} 10.61986{col 26}{space 2} 7.338333{col 37}{space 1}    1.45{col 46}{space 3}0.221{col 54}{space 4} -9.75462{col 67}{space 3} 30.99434
{txt}{space 6}lead89 {c |}{col 14}{res}{space 2} 7.927955{col 26}{space 2} 6.104957{col 37}{space 1}    1.30{col 46}{space 3}0.264{col 54}{space 4}-9.022122{col 67}{space 3} 24.87803
{txt}{space 6}lead88 {c |}{col 14}{res}{space 2} 15.10134{col 26}{space 2} 6.830177{col 37}{space 1}    2.21{col 46}{space 3}0.092{col 54}{space 4}-3.862271{col 67}{space 3} 34.06495
{txt}{space 6}lead87 {c |}{col 14}{res}{space 2} 6.083001{col 26}{space 2}  3.09978{col 37}{space 1}    1.96{col 46}{space 3}0.121{col 54}{space 4}-2.523367{col 67}{space 3} 14.68937
{txt}{space 6}lead86 {c |}{col 14}{res}{space 2}-2.893019{col 26}{space 2} 6.145217{col 37}{space 1}   -0.47{col 46}{space 3}0.662{col 54}{space 4}-19.95488{col 67}{space 3} 14.16884
{txt}{space 6}lead85 {c |}{col 14}{res}{space 2}-5.721566{col 26}{space 2}  9.48121{col 37}{space 1}   -0.60{col 46}{space 3}0.579{col 54}{space 4}-32.04563{col 67}{space 3} 20.60249
{txt}{space 6}lead84 {c |}{col 14}{res}{space 2} 6.380597{col 26}{space 2}  12.2566{col 37}{space 1}    0.52{col 46}{space 3}0.630{col 54}{space 4}-27.64919{col 67}{space 3} 40.41038
{txt}{space 6}lead83 {c |}{col 14}{res}{space 2} .6268753{col 26}{space 2}  9.94363{col 37}{space 1}    0.06{col 46}{space 3}0.953{col 54}{space 4}-26.98107{col 67}{space 3} 28.23482
{txt}{space 6}lead82 {c |}{col 14}{res}{space 2}-1.978038{col 26}{space 2} 7.170984{col 37}{space 1}   -0.28{col 46}{space 3}0.796{col 54}{space 4}-21.88788{col 67}{space 3}  17.9318
{txt}{space 6}lead81 {c |}{col 14}{res}{space 2}-1.534648{col 26}{space 2} 4.271279{col 37}{space 1}   -0.36{col 46}{space 3}0.738{col 54}{space 4}-13.39362{col 67}{space 3} 10.32432
{txt}{space 6}lead80 {c |}{col 14}{res}{space 2}-12.12468{col 26}{space 2} 10.09083{col 37}{space 1}   -1.20{col 46}{space 3}0.296{col 54}{space 4}-40.14132{col 67}{space 3} 15.89195
{txt}{space 6}lead79 {c |}{col 14}{res}{space 2}  -5.7704{col 26}{space 2} 9.718965{col 37}{space 1}   -0.59{col 46}{space 3}0.585{col 54}{space 4}-32.75457{col 67}{space 3} 21.21377
{txt}{space 6}lead78 {c |}{col 14}{res}{space 2}-4.720316{col 26}{space 2} 10.21813{col 37}{space 1}   -0.46{col 46}{space 3}0.668{col 54}{space 4} -33.0904{col 67}{space 3} 23.64977
{txt}{space 6}lead77 {c |}{col 14}{res}{space 2} 5.018504{col 26}{space 2} 6.886807{col 37}{space 1}    0.73{col 46}{space 3}0.507{col 54}{space 4}-14.10234{col 67}{space 3} 24.13935
{txt}{space 6}lead76 {c |}{col 14}{res}{space 2}-3.976393{col 26}{space 2} 6.613889{col 37}{space 1}   -0.60{col 46}{space 3}0.580{col 54}{space 4}-22.33949{col 67}{space 3} 14.38671
{txt}{space 6}lead75 {c |}{col 14}{res}{space 2}-2.343351{col 26}{space 2} 10.72345{col 37}{space 1}   -0.22{col 46}{space 3}0.838{col 54}{space 4}-32.11642{col 67}{space 3} 27.42972
{txt}{space 6}lead74 {c |}{col 14}{res}{space 2} .9076812{col 26}{space 2} 8.339256{col 37}{space 1}    0.11{col 46}{space 3}0.919{col 54}{space 4}-22.24581{col 67}{space 3} 24.06117
{txt}{space 6}lead73 {c |}{col 14}{res}{space 2} 1.394115{col 26}{space 2} 6.047057{col 37}{space 1}    0.23{col 46}{space 3}0.829{col 54}{space 4}-15.39521{col 67}{space 3} 18.18344
{txt}{space 6}lead72 {c |}{col 14}{res}{space 2} 5.686269{col 26}{space 2} 8.858199{col 37}{space 1}    0.64{col 46}{space 3}0.556{col 54}{space 4}-18.90804{col 67}{space 3} 30.28057
{txt}{space 6}lead71 {c |}{col 14}{res}{space 2} 4.737372{col 26}{space 2} 8.105011{col 37}{space 1}    0.58{col 46}{space 3}0.590{col 54}{space 4}-17.76575{col 67}{space 3} 27.24049
{txt}{space 6}lead70 {c |}{col 14}{res}{space 2} 7.546149{col 26}{space 2}  7.61898{col 37}{space 1}    0.99{col 46}{space 3}0.378{col 54}{space 4}-13.60753{col 67}{space 3} 28.69983
{txt}{space 6}lead69 {c |}{col 14}{res}{space 2}  .494841{col 26}{space 2} 10.47157{col 37}{space 1}    0.05{col 46}{space 3}0.965{col 54}{space 4}-28.57891{col 67}{space 3} 29.56859
{txt}{space 6}lead68 {c |}{col 14}{res}{space 2}-3.996598{col 26}{space 2} 10.84867{col 37}{space 1}   -0.37{col 46}{space 3}0.731{col 54}{space 4}-34.11734{col 67}{space 3} 26.12415
{txt}{space 6}lead67 {c |}{col 14}{res}{space 2}-3.963886{col 26}{space 2} 12.04388{col 37}{space 1}   -0.33{col 46}{space 3}0.759{col 54}{space 4}-37.40306{col 67}{space 3} 29.47528
{txt}{space 6}lead66 {c |}{col 14}{res}{space 2} 1.344649{col 26}{space 2} 10.72815{col 37}{space 1}    0.13{col 46}{space 3}0.906{col 54}{space 4}-28.44148{col 67}{space 3} 31.13077
{txt}{space 6}lead65 {c |}{col 14}{res}{space 2}-2.757155{col 26}{space 2}  12.4679{col 37}{space 1}   -0.22{col 46}{space 3}0.836{col 54}{space 4} -37.3736{col 67}{space 3} 31.85929
{txt}{space 6}lead64 {c |}{col 14}{res}{space 2} 3.503762{col 26}{space 2} 8.717675{col 37}{space 1}    0.40{col 46}{space 3}0.708{col 54}{space 4}-20.70038{col 67}{space 3} 27.70791
{txt}{space 6}lead63 {c |}{col 14}{res}{space 2} 7.575512{col 26}{space 2} 6.830448{col 37}{space 1}    1.11{col 46}{space 3}0.330{col 54}{space 4}-11.38885{col 67}{space 3} 26.53988
{txt}{space 6}lead62 {c |}{col 14}{res}{space 2} 4.181932{col 26}{space 2} 4.113908{col 37}{space 1}    1.02{col 46}{space 3}0.367{col 54}{space 4}-7.240107{col 67}{space 3} 15.60397
{txt}{space 6}lead61 {c |}{col 14}{res}{space 2} 5.507869{col 26}{space 2} 8.380513{col 37}{space 1}    0.66{col 46}{space 3}0.547{col 54}{space 4}-17.76017{col 67}{space 3}  28.7759
{txt}{space 6}lead60 {c |}{col 14}{res}{space 2} 2.308341{col 26}{space 2} 8.337532{col 37}{space 1}    0.28{col 46}{space 3}0.796{col 54}{space 4}-20.84036{col 67}{space 3} 25.45704
{txt}{space 6}lead59 {c |}{col 14}{res}{space 2}-3.384281{col 26}{space 2} 9.236688{col 37}{space 1}   -0.37{col 46}{space 3}0.733{col 54}{space 4}-29.02944{col 67}{space 3} 22.26088
{txt}{space 6}lead58 {c |}{col 14}{res}{space 2} .7543219{col 26}{space 2} 9.112582{col 37}{space 1}    0.08{col 46}{space 3}0.938{col 54}{space 4}-24.54626{col 67}{space 3}  26.0549
{txt}{space 6}lead57 {c |}{col 14}{res}{space 2} .2686263{col 26}{space 2} 7.095474{col 37}{space 1}    0.04{col 46}{space 3}0.972{col 54}{space 4}-19.43157{col 67}{space 3} 19.96882
{txt}{space 6}lead56 {c |}{col 14}{res}{space 2} 4.242623{col 26}{space 2} 6.458381{col 37}{space 1}    0.66{col 46}{space 3}0.547{col 54}{space 4}-13.68872{col 67}{space 3} 22.17396
{txt}{space 6}lead55 {c |}{col 14}{res}{space 2} 1.820124{col 26}{space 2} 7.930766{col 37}{space 1}    0.23{col 46}{space 3}0.830{col 54}{space 4}-20.19921{col 67}{space 3} 23.83946
{txt}{space 6}lead54 {c |}{col 14}{res}{space 2} .1384267{col 26}{space 2} 9.447218{col 37}{space 1}    0.01{col 46}{space 3}0.989{col 54}{space 4}-26.09126{col 67}{space 3} 26.36811
{txt}{space 6}lead53 {c |}{col 14}{res}{space 2}-.4421796{col 26}{space 2} 8.067282{col 37}{space 1}   -0.05{col 46}{space 3}0.959{col 54}{space 4}-22.84055{col 67}{space 3} 21.95619
{txt}{space 6}lead52 {c |}{col 14}{res}{space 2}-4.464344{col 26}{space 2} 14.06505{col 37}{space 1}   -0.32{col 46}{space 3}0.767{col 54}{space 4}-43.51519{col 67}{space 3}  34.5865
{txt}{space 6}lead51 {c |}{col 14}{res}{space 2}-1.422499{col 26}{space 2} 8.223767{col 37}{space 1}   -0.17{col 46}{space 3}0.871{col 54}{space 4}-24.25534{col 67}{space 3} 21.41034
{txt}{space 6}lead50 {c |}{col 14}{res}{space 2} 1.285053{col 26}{space 2} 7.772243{col 37}{space 1}    0.17{col 46}{space 3}0.877{col 54}{space 4}-20.29415{col 67}{space 3} 22.86426
{txt}{space 6}lead49 {c |}{col 14}{res}{space 2}-4.597402{col 26}{space 2} 3.691727{col 37}{space 1}   -1.25{col 46}{space 3}0.281{col 54}{space 4}-14.84728{col 67}{space 3} 5.652474
{txt}{space 6}lead48 {c |}{col 14}{res}{space 2}-7.723724{col 26}{space 2} 5.251694{col 37}{space 1}   -1.47{col 46}{space 3}0.215{col 54}{space 4}-22.30476{col 67}{space 3} 6.857316
{txt}{space 6}lead47 {c |}{col 14}{res}{space 2}-7.450249{col 26}{space 2} 6.429811{col 37}{space 1}   -1.16{col 46}{space 3}0.311{col 54}{space 4}-25.30227{col 67}{space 3} 10.40177
{txt}{space 6}lead46 {c |}{col 14}{res}{space 2} .9593016{col 26}{space 2}  9.27548{col 37}{space 1}    0.10{col 46}{space 3}0.923{col 54}{space 4}-24.79356{col 67}{space 3} 26.71216
{txt}{space 6}lead45 {c |}{col 14}{res}{space 2} 3.070045{col 26}{space 2} 6.601106{col 37}{space 1}    0.47{col 46}{space 3}0.666{col 54}{space 4}-15.25756{col 67}{space 3} 21.39765
{txt}{space 6}lead44 {c |}{col 14}{res}{space 2}-.3110055{col 26}{space 2} 10.55484{col 37}{space 1}   -0.03{col 46}{space 3}0.978{col 54}{space 4}-29.61593{col 67}{space 3} 28.99392
{txt}{space 6}lead43 {c |}{col 14}{res}{space 2}-2.221081{col 26}{space 2} 4.302134{col 37}{space 1}   -0.52{col 46}{space 3}0.633{col 54}{space 4}-14.16572{col 67}{space 3} 9.723557
{txt}{space 6}lead42 {c |}{col 14}{res}{space 2} 4.706503{col 26}{space 2} 2.277331{col 37}{space 1}    2.07{col 46}{space 3}0.108{col 54}{space 4}-1.616381{col 67}{space 3} 11.02939
{txt}{space 6}lead41 {c |}{col 14}{res}{space 2}-1.097404{col 26}{space 2} 5.294075{col 37}{space 1}   -0.21{col 46}{space 3}0.846{col 54}{space 4}-15.79611{col 67}{space 3}  13.6013
{txt}{space 6}lead40 {c |}{col 14}{res}{space 2}-3.481723{col 26}{space 2} 7.962869{col 37}{space 1}   -0.44{col 46}{space 3}0.685{col 54}{space 4}-25.59019{col 67}{space 3} 18.62675
{txt}{space 6}lead39 {c |}{col 14}{res}{space 2}-2.159675{col 26}{space 2}   8.9696{col 37}{space 1}   -0.24{col 46}{space 3}0.822{col 54}{space 4}-27.06328{col 67}{space 3} 22.74393
{txt}{space 6}lead38 {c |}{col 14}{res}{space 2} 2.163384{col 26}{space 2} 5.649299{col 37}{space 1}    0.38{col 46}{space 3}0.721{col 54}{space 4}-13.52158{col 67}{space 3} 17.84835
{txt}{space 6}lead37 {c |}{col 14}{res}{space 2} .2552953{col 26}{space 2} 5.994004{col 37}{space 1}    0.04{col 46}{space 3}0.968{col 54}{space 4}-16.38673{col 67}{space 3} 16.89732
{txt}{space 6}lead36 {c |}{col 14}{res}{space 2} 1.663326{col 26}{space 2} 6.787992{col 37}{space 1}    0.25{col 46}{space 3}0.818{col 54}{space 4}-17.18316{col 67}{space 3} 20.50981
{txt}{space 6}lead35 {c |}{col 14}{res}{space 2} 9.002257{col 26}{space 2} 5.583102{col 37}{space 1}    1.61{col 46}{space 3}0.182{col 54}{space 4}-6.498919{col 67}{space 3} 24.50343
{txt}{space 6}lead34 {c |}{col 14}{res}{space 2}-.5266205{col 26}{space 2} 7.206894{col 37}{space 1}   -0.07{col 46}{space 3}0.945{col 54}{space 4}-20.53617{col 67}{space 3} 19.48293
{txt}{space 6}lead33 {c |}{col 14}{res}{space 2} 1.324104{col 26}{space 2}  6.23335{col 37}{space 1}    0.21{col 46}{space 3}0.842{col 54}{space 4}-15.98245{col 67}{space 3} 18.63066
{txt}{space 6}lead32 {c |}{col 14}{res}{space 2} .4018277{col 26}{space 2} 6.396109{col 37}{space 1}    0.06{col 46}{space 3}0.953{col 54}{space 4}-17.35662{col 67}{space 3} 18.16027
{txt}{space 6}lead31 {c |}{col 14}{res}{space 2}-.8755498{col 26}{space 2}  4.68658{col 37}{space 1}   -0.19{col 46}{space 3}0.861{col 54}{space 4}-13.88758{col 67}{space 3} 12.13648
{txt}{space 6}lead30 {c |}{col 14}{res}{space 2} 3.546252{col 26}{space 2} 4.400377{col 37}{space 1}    0.81{col 46}{space 3}0.465{col 54}{space 4}-8.671152{col 67}{space 3} 15.76366
{txt}{space 6}lead29 {c |}{col 14}{res}{space 2}  4.26221{col 26}{space 2} 4.397828{col 37}{space 1}    0.97{col 46}{space 3}0.387{col 54}{space 4}-7.948118{col 67}{space 3} 16.47254
{txt}{space 6}lead28 {c |}{col 14}{res}{space 2} 3.581854{col 26}{space 2}  4.42861{col 37}{space 1}    0.81{col 46}{space 3}0.464{col 54}{space 4}-8.713937{col 67}{space 3} 15.87765
{txt}{space 6}lead27 {c |}{col 14}{res}{space 2} 4.211128{col 26}{space 2} 3.344425{col 37}{space 1}    1.26{col 46}{space 3}0.276{col 54}{space 4}-5.074483{col 67}{space 3} 13.49674
{txt}{space 6}lead26 {c |}{col 14}{res}{space 2} 3.720077{col 26}{space 2} 6.127092{col 37}{space 1}    0.61{col 46}{space 3}0.577{col 54}{space 4}-13.29146{col 67}{space 3} 20.73161
{txt}{space 6}lead25 {c |}{col 14}{res}{space 2}-5.867101{col 26}{space 2} 5.049299{col 37}{space 1}   -1.16{col 46}{space 3}0.310{col 54}{space 4} -19.8862{col 67}{space 3} 8.152001
{txt}{space 6}lead24 {c |}{col 14}{res}{space 2}-2.243483{col 26}{space 2} 4.402193{col 37}{space 1}   -0.51{col 46}{space 3}0.637{col 54}{space 4}-14.46593{col 67}{space 3} 9.978965
{txt}{space 6}lead23 {c |}{col 14}{res}{space 2} 1.204507{col 26}{space 2}  4.36722{col 37}{space 1}    0.28{col 46}{space 3}0.796{col 54}{space 4}-10.92084{col 67}{space 3} 13.32985
{txt}{space 6}lead22 {c |}{col 14}{res}{space 2}-3.649589{col 26}{space 2} 3.473634{col 37}{space 1}   -1.05{col 46}{space 3}0.353{col 54}{space 4}-13.29394{col 67}{space 3} 5.994765
{txt}{space 6}lead21 {c |}{col 14}{res}{space 2}-.5412787{col 26}{space 2} 3.250862{col 37}{space 1}   -0.17{col 46}{space 3}0.876{col 54}{space 4}-9.567117{col 67}{space 3}  8.48456
{txt}{space 6}lead20 {c |}{col 14}{res}{space 2} 2.623796{col 26}{space 2} 3.668364{col 37}{space 1}    0.72{col 46}{space 3}0.514{col 54}{space 4}-7.561216{col 67}{space 3} 12.80881
{txt}{space 6}lead19 {c |}{col 14}{res}{space 2}-3.766199{col 26}{space 2} 2.640968{col 37}{space 1}   -1.43{col 46}{space 3}0.227{col 54}{space 4} -11.0987{col 67}{space 3} 3.566305
{txt}{space 6}lead18 {c |}{col 14}{res}{space 2} 3.687527{col 26}{space 2}  2.30221{col 37}{space 1}    1.60{col 46}{space 3}0.184{col 54}{space 4}-2.704433{col 67}{space 3} 10.07949
{txt}{space 6}lead17 {c |}{col 14}{res}{space 2}-.6949409{col 26}{space 2} 2.336162{col 37}{space 1}   -0.30{col 46}{space 3}0.781{col 54}{space 4}-7.181167{col 67}{space 3} 5.791285
{txt}{space 6}lead16 {c |}{col 14}{res}{space 2}-.7214018{col 26}{space 2} 2.492743{col 37}{space 1}   -0.29{col 46}{space 3}0.787{col 54}{space 4}-7.642366{col 67}{space 3} 6.199563
{txt}{space 6}lead15 {c |}{col 14}{res}{space 2}-7.844323{col 26}{space 2} 1.470313{col 37}{space 1}   -5.34{col 46}{space 3}0.006{col 54}{space 4}-11.92657{col 67}{space 3}-3.762079
{txt}{space 6}lead14 {c |}{col 14}{res}{space 2}-4.838545{col 26}{space 2} 2.112306{col 37}{space 1}   -2.29{col 46}{space 3}0.084{col 54}{space 4}-10.70325{col 67}{space 3} 1.026157
{txt}{space 6}lead13 {c |}{col 14}{res}{space 2} 2.808748{col 26}{space 2} 1.236864{col 37}{space 1}    2.27{col 46}{space 3}0.086{col 54}{space 4}-.6253362{col 67}{space 3} 6.242832
{txt}{space 6}lead12 {c |}{col 14}{res}{space 2}-4.048919{col 26}{space 2} 2.465454{col 37}{space 1}   -1.64{col 46}{space 3}0.176{col 54}{space 4}-10.89412{col 67}{space 3} 2.796278
{txt}{space 6}lead11 {c |}{col 14}{res}{space 2} -3.70174{col 26}{space 2} 2.558238{col 37}{space 1}   -1.45{col 46}{space 3}0.221{col 54}{space 4}-10.80455{col 67}{space 3} 3.401067
{txt}{space 6}lead10 {c |}{col 14}{res}{space 2}-6.285807{col 26}{space 2} 3.299817{col 37}{space 1}   -1.90{col 46}{space 3}0.130{col 54}{space 4}-15.44757{col 67}{space 3} 2.875955
{txt}{space 7}lead9 {c |}{col 14}{res}{space 2}-4.039444{col 26}{space 2} 2.656746{col 37}{space 1}   -1.52{col 46}{space 3}0.203{col 54}{space 4}-11.41575{col 67}{space 3} 3.336865
{txt}{space 7}lead8 {c |}{col 14}{res}{space 2} .7585371{col 26}{space 2} 2.962276{col 37}{space 1}    0.26{col 46}{space 3}0.811{col 54}{space 4}-7.466059{col 67}{space 3} 8.983133
{txt}{space 7}lead7 {c |}{col 14}{res}{space 2} 3.455915{col 26}{space 2} 2.927705{col 37}{space 1}    1.18{col 46}{space 3}0.303{col 54}{space 4}-4.672698{col 67}{space 3} 11.58453
{txt}{space 7}lead6 {c |}{col 14}{res}{space 2}-4.559011{col 26}{space 2} 1.219965{col 37}{space 1}   -3.74{col 46}{space 3}0.020{col 54}{space 4}-7.946178{col 67}{space 3}-1.171844
{txt}{space 7}lead5 {c |}{col 14}{res}{space 2} -9.05078{col 26}{space 2} 3.134564{col 37}{space 1}   -2.89{col 46}{space 3}0.045{col 54}{space 4}-17.75373{col 67}{space 3}-.3478358
{txt}{space 7}lead4 {c |}{col 14}{res}{space 2}-6.002132{col 26}{space 2}  2.24833{col 37}{space 1}   -2.67{col 46}{space 3}0.056{col 54}{space 4} -12.2445{col 67}{space 3}  .240234
{txt}{space 7}lead3 {c |}{col 14}{res}{space 2}-7.521754{col 26}{space 2} .9029627{col 37}{space 1}   -8.33{col 46}{space 3}0.001{col 54}{space 4}-10.02878{col 67}{space 3}-5.014728
{txt}{space 7}lead2 {c |}{col 14}{res}{space 2}-2.032399{col 26}{space 2} 3.330559{col 37}{space 1}   -0.61{col 46}{space 3}0.575{col 54}{space 4}-11.27951{col 67}{space 3} 7.214714
{txt}{space 8}lag0 {c |}{col 14}{res}{space 2}-2.747384{col 26}{space 2} 1.827038{col 37}{space 1}   -1.50{col 46}{space 3}0.207{col 54}{space 4}-7.820054{col 67}{space 3} 2.325286
{txt}{space 8}lag1 {c |}{col 14}{res}{space 2}-3.902914{col 26}{space 2} 4.786842{col 37}{space 1}   -0.82{col 46}{space 3}0.461{col 54}{space 4}-17.19332{col 67}{space 3} 9.387492
{txt}{space 8}lag2 {c |}{col 14}{res}{space 2} -3.10939{col 26}{space 2} 2.571075{col 37}{space 1}   -1.21{col 46}{space 3}0.293{col 54}{space 4}-10.24784{col 67}{space 3} 4.029058
{txt}{space 8}lag3 {c |}{col 14}{res}{space 2}-5.457025{col 26}{space 2}  1.12469{col 37}{space 1}   -4.85{col 46}{space 3}0.008{col 54}{space 4}-8.579665{col 67}{space 3}-2.334384
{txt}{space 8}lag4 {c |}{col 14}{res}{space 2} 3.260879{col 26}{space 2} 2.600473{col 37}{space 1}    1.25{col 46}{space 3}0.278{col 54}{space 4}-3.959193{col 67}{space 3} 10.48095
{txt}{space 8}lag5 {c |}{col 14}{res}{space 2}  .564384{col 26}{space 2} 2.196454{col 37}{space 1}    0.26{col 46}{space 3}0.810{col 54}{space 4} -5.53395{col 67}{space 3} 6.662719
{txt}{space 8}lag6 {c |}{col 14}{res}{space 2}-.9888742{col 26}{space 2} 3.384011{col 37}{space 1}   -0.29{col 46}{space 3}0.785{col 54}{space 4}-10.38439{col 67}{space 3} 8.406646
{txt}{space 8}lag7 {c |}{col 14}{res}{space 2}-.2521588{col 26}{space 2} .6978855{col 37}{space 1}   -0.36{col 46}{space 3}0.736{col 54}{space 4}  -2.1898{col 67}{space 3} 1.685482
{txt}{space 8}lag8 {c |}{col 14}{res}{space 2} 8.317276{col 26}{space 2} 1.888535{col 37}{space 1}    4.40{col 46}{space 3}0.012{col 54}{space 4} 3.073861{col 67}{space 3} 13.56069
{txt}{space 8}lag9 {c |}{col 14}{res}{space 2} 6.676585{col 26}{space 2}  2.09699{col 37}{space 1}    3.18{col 46}{space 3}0.033{col 54}{space 4} .8544064{col 67}{space 3} 12.49876
{txt}{space 7}lag10 {c |}{col 14}{res}{space 2} .5917358{col 26}{space 2} 2.001645{col 37}{space 1}    0.30{col 46}{space 3}0.782{col 54}{space 4}-4.965721{col 67}{space 3} 6.149192
{txt}{space 7}lag11 {c |}{col 14}{res}{space 2}-.1169175{col 26}{space 2} .7606679{col 37}{space 1}   -0.15{col 46}{space 3}0.885{col 54}{space 4} -2.22887{col 67}{space 3} 1.995035
{txt}{space 7}lag12 {c |}{col 14}{res}{space 2} 1.558782{col 26}{space 2}  1.99985{col 37}{space 1}    0.78{col 46}{space 3}0.479{col 54}{space 4}-3.993692{col 67}{space 3} 7.111255
{txt}{space 7}lag13 {c |}{col 14}{res}{space 2} 3.502877{col 26}{space 2} 1.043573{col 37}{space 1}    3.36{col 46}{space 3}0.028{col 54}{space 4} .6054548{col 67}{space 3} 6.400299
{txt}{space 7}lag14 {c |}{col 14}{res}{space 2} 1.000394{col 26}{space 2} 1.618477{col 37}{space 1}    0.62{col 46}{space 3}0.570{col 54}{space 4}-3.493218{col 67}{space 3} 5.494006
{txt}{space 7}lag15 {c |}{col 14}{res}{space 2} 1.358264{col 26}{space 2} 3.460454{col 37}{space 1}    0.39{col 46}{space 3}0.715{col 54}{space 4}-8.249496{col 67}{space 3} 10.96602
{txt}{space 7}lag16 {c |}{col 14}{res}{space 2} 3.707421{col 26}{space 2} 3.485024{col 37}{space 1}    1.06{col 46}{space 3}0.347{col 54}{space 4}-5.968556{col 67}{space 3}  13.3834
{txt}{space 7}lag17 {c |}{col 14}{res}{space 2} 8.250353{col 26}{space 2} 3.133263{col 37}{space 1}    2.63{col 46}{space 3}0.058{col 54}{space 4} -.448979{col 67}{space 3} 16.94968
{txt}{space 7}lag18 {c |}{col 14}{res}{space 2}-.4801075{col 26}{space 2} 1.159734{col 37}{space 1}   -0.41{col 46}{space 3}0.700{col 54}{space 4}-3.700047{col 67}{space 3} 2.739832
{txt}{space 7}lag19 {c |}{col 14}{res}{space 2}-3.283391{col 26}{space 2}  1.78146{col 37}{space 1}   -1.84{col 46}{space 3}0.139{col 54}{space 4}-8.229516{col 67}{space 3} 1.662734
{txt}{space 7}lag20 {c |}{col 14}{res}{space 2}  2.04812{col 26}{space 2} 1.350628{col 37}{space 1}    1.52{col 46}{space 3}0.204{col 54}{space 4}-1.701824{col 67}{space 3} 5.798064
{txt}{space 7}lag21 {c |}{col 14}{res}{space 2}-.7920619{col 26}{space 2} 4.903341{col 37}{space 1}   -0.16{col 46}{space 3}0.880{col 54}{space 4}-14.40592{col 67}{space 3} 12.82179
{txt}{space 7}lag22 {c |}{col 14}{res}{space 2}-.2285081{col 26}{space 2} 2.814521{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4}-8.042871{col 67}{space 3} 7.585855
{txt}{space 7}lag23 {c |}{col 14}{res}{space 2} .0132933{col 26}{space 2} 2.947885{col 37}{space 1}    0.00{col 46}{space 3}0.997{col 54}{space 4}-8.171347{col 67}{space 3} 8.197933
{txt}{space 7}lag24 {c |}{col 14}{res}{space 2}-.1849429{col 26}{space 2} 2.631239{col 37}{space 1}   -0.07{col 46}{space 3}0.947{col 54}{space 4}-7.490433{col 67}{space 3} 7.120547
{txt}{space 7}lag25 {c |}{col 14}{res}{space 2}-2.031809{col 26}{space 2} 3.245353{col 37}{space 1}   -0.63{col 46}{space 3}0.565{col 54}{space 4}-11.04235{col 67}{space 3} 6.978735
{txt}{space 7}lag26 {c |}{col 14}{res}{space 2}-1.238561{col 26}{space 2} 4.494459{col 37}{space 1}   -0.28{col 46}{space 3}0.797{col 54}{space 4}-13.71718{col 67}{space 3} 11.24006
{txt}{space 7}lag27 {c |}{col 14}{res}{space 2}-4.597352{col 26}{space 2} 1.987818{col 37}{space 1}   -2.31{col 46}{space 3}0.082{col 54}{space 4}-10.11642{col 67}{space 3} .9217157
{txt}{space 7}lag28 {c |}{col 14}{res}{space 2} .6639903{col 26}{space 2} 3.280042{col 37}{space 1}    0.20{col 46}{space 3}0.849{col 54}{space 4}-8.442865{col 67}{space 3} 9.770846
{txt}{space 7}lag29 {c |}{col 14}{res}{space 2} 3.219147{col 26}{space 2} 2.686512{col 37}{space 1}    1.20{col 46}{space 3}0.297{col 54}{space 4}-4.239807{col 67}{space 3}  10.6781
{txt}{space 7}lag30 {c |}{col 14}{res}{space 2}-2.706423{col 26}{space 2} 3.838029{col 37}{space 1}   -0.71{col 46}{space 3}0.520{col 54}{space 4} -13.3625{col 67}{space 3} 7.949654
{txt}{space 7}lag31 {c |}{col 14}{res}{space 2}-4.299361{col 26}{space 2} 2.555974{col 37}{space 1}   -1.68{col 46}{space 3}0.168{col 54}{space 4}-11.39588{col 67}{space 3}  2.79716
{txt}{space 7}lag32 {c |}{col 14}{res}{space 2}-1.391138{col 26}{space 2} 1.666263{col 37}{space 1}   -0.83{col 46}{space 3}0.451{col 54}{space 4}-6.017426{col 67}{space 3}  3.23515
{txt}{space 7}lag33 {c |}{col 14}{res}{space 2}-4.978071{col 26}{space 2} 1.876616{col 37}{space 1}   -2.65{col 46}{space 3}0.057{col 54}{space 4}-10.18839{col 67}{space 3} .2322492
{txt}{space 7}lag34 {c |}{col 14}{res}{space 2}-8.640947{col 26}{space 2} 4.457095{col 37}{space 1}   -1.94{col 46}{space 3}0.125{col 54}{space 4}-21.01582{col 67}{space 3} 3.733932
{txt}{space 7}lag35 {c |}{col 14}{res}{space 2}-5.054448{col 26}{space 2} 2.271406{col 37}{space 1}   -2.23{col 46}{space 3}0.090{col 54}{space 4}-11.36088{col 67}{space 3} 1.251985
{txt}{space 7}lag36 {c |}{col 14}{res}{space 2} 1.385366{col 26}{space 2} 1.841859{col 37}{space 1}    0.75{col 46}{space 3}0.494{col 54}{space 4}-3.728455{col 67}{space 3} 6.499187
{txt}{space 7}lag37 {c |}{col 14}{res}{space 2} 6.949788{col 26}{space 2} 3.627038{col 37}{space 1}    1.92{col 46}{space 3}0.128{col 54}{space 4}-3.120483{col 67}{space 3} 17.02006
{txt}{space 7}lag38 {c |}{col 14}{res}{space 2}-4.453091{col 26}{space 2} 3.549025{col 37}{space 1}   -1.25{col 46}{space 3}0.278{col 54}{space 4}-14.30676{col 67}{space 3} 5.400581
{txt}{space 7}lag39 {c |}{col 14}{res}{space 2}-6.305879{col 26}{space 2} 2.955408{col 37}{space 1}   -2.13{col 46}{space 3}0.100{col 54}{space 4}-14.51141{col 67}{space 3} 1.899648
{txt}{space 7}lag40 {c |}{col 14}{res}{space 2}-5.431857{col 26}{space 2} 5.051102{col 37}{space 1}   -1.08{col 46}{space 3}0.343{col 54}{space 4}-19.45596{col 67}{space 3}  8.59225
{txt}{space 7}lag41 {c |}{col 14}{res}{space 2}-4.781559{col 26}{space 2} 6.015397{col 37}{space 1}   -0.79{col 46}{space 3}0.471{col 54}{space 4}-21.48298{col 67}{space 3} 11.91986
{txt}{space 7}lag42 {c |}{col 14}{res}{space 2}-3.188932{col 26}{space 2} 6.426173{col 37}{space 1}   -0.50{col 46}{space 3}0.646{col 54}{space 4}-21.03085{col 67}{space 3} 14.65298
{txt}{space 7}lag43 {c |}{col 14}{res}{space 2}-8.903813{col 26}{space 2} 2.424458{col 37}{space 1}   -3.67{col 46}{space 3}0.021{col 54}{space 4}-15.63519{col 67}{space 3}-2.172438
{txt}{space 7}lag44 {c |}{col 14}{res}{space 2}-5.545583{col 26}{space 2} 2.753926{col 37}{space 1}   -2.01{col 46}{space 3}0.114{col 54}{space 4}-13.19171{col 67}{space 3} 2.100542
{txt}{space 7}lag45 {c |}{col 14}{res}{space 2}-.8221123{col 26}{space 2} 2.526433{col 37}{space 1}   -0.33{col 46}{space 3}0.761{col 54}{space 4}-7.836614{col 67}{space 3}  6.19239
{txt}{space 7}lag46 {c |}{col 14}{res}{space 2}-.9057026{col 26}{space 2} 2.132074{col 37}{space 1}   -0.42{col 46}{space 3}0.693{col 54}{space 4} -6.82529{col 67}{space 3} 5.013884
{txt}{space 7}lag47 {c |}{col 14}{res}{space 2} 2.941019{col 26}{space 2} 4.029276{col 37}{space 1}    0.73{col 46}{space 3}0.506{col 54}{space 4}-8.246045{col 67}{space 3} 14.12808
{txt}{space 7}lag48 {c |}{col 14}{res}{space 2}-6.817499{col 26}{space 2} 6.233374{col 37}{space 1}   -1.09{col 46}{space 3}0.336{col 54}{space 4}-24.12412{col 67}{space 3} 10.48912
{txt}{space 7}lag49 {c |}{col 14}{res}{space 2}-10.77266{col 26}{space 2} 2.567585{col 37}{space 1}   -4.20{col 46}{space 3}0.014{col 54}{space 4}-17.90142{col 67}{space 3}-3.643897
{txt}{space 7}lag50 {c |}{col 14}{res}{space 2}-11.55317{col 26}{space 2} 2.185873{col 37}{space 1}   -5.29{col 46}{space 3}0.006{col 54}{space 4}-17.62213{col 67}{space 3}-5.484215
{txt}{space 7}lag51 {c |}{col 14}{res}{space 2}-3.931537{col 26}{space 2} 1.767122{col 37}{space 1}   -2.22{col 46}{space 3}0.090{col 54}{space 4}-8.837855{col 67}{space 3} .9747805
{txt}{space 7}lag52 {c |}{col 14}{res}{space 2}-1.852988{col 26}{space 2} 2.749586{col 37}{space 1}   -0.67{col 46}{space 3}0.537{col 54}{space 4}-9.487061{col 67}{space 3} 5.781085
{txt}{space 7}lag53 {c |}{col 14}{res}{space 2}-8.579757{col 26}{space 2}  5.21865{col 37}{space 1}   -1.64{col 46}{space 3}0.176{col 54}{space 4}-23.06905{col 67}{space 3} 5.909538
{txt}{space 7}lag54 {c |}{col 14}{res}{space 2}  -1.5521{col 26}{space 2} 3.569081{col 37}{space 1}   -0.43{col 46}{space 3}0.686{col 54}{space 4}-11.46146{col 67}{space 3} 8.357259
{txt}{space 7}lag55 {c |}{col 14}{res}{space 2}-8.703137{col 26}{space 2} 4.512206{col 37}{space 1}   -1.93{col 46}{space 3}0.126{col 54}{space 4}-21.23103{col 67}{space 3} 3.824755
{txt}{space 7}lag56 {c |}{col 14}{res}{space 2}-.5085001{col 26}{space 2}  2.48673{col 37}{space 1}   -0.20{col 46}{space 3}0.848{col 54}{space 4}-7.412769{col 67}{space 3} 6.395769
{txt}{space 7}lag57 {c |}{col 14}{res}{space 2}-2.609248{col 26}{space 2} 3.040403{col 37}{space 1}   -0.86{col 46}{space 3}0.439{col 54}{space 4}-11.05076{col 67}{space 3} 5.832262
{txt}{space 7}lag58 {c |}{col 14}{res}{space 2}-3.760219{col 26}{space 2} 2.337943{col 37}{space 1}   -1.61{col 46}{space 3}0.183{col 54}{space 4}-10.25139{col 67}{space 3} 2.730953
{txt}{space 7}lag59 {c |}{col 14}{res}{space 2} -1.17234{col 26}{space 2} 2.865242{col 37}{space 1}   -0.41{col 46}{space 3}0.703{col 54}{space 4}-9.127527{col 67}{space 3} 6.782847
{txt}{space 7}lag60 {c |}{col 14}{res}{space 2}-2.187249{col 26}{space 2} 4.517842{col 37}{space 1}   -0.48{col 46}{space 3}0.654{col 54}{space 4}-14.73079{col 67}{space 3} 10.35629
{txt}{space 7}lag61 {c |}{col 14}{res}{space 2}-4.299982{col 26}{space 2} 6.022719{col 37}{space 1}   -0.71{col 46}{space 3}0.515{col 54}{space 4}-21.02173{col 67}{space 3} 12.42177
{txt}{space 7}lag62 {c |}{col 14}{res}{space 2}-5.985853{col 26}{space 2} 4.738293{col 37}{space 1}   -1.26{col 46}{space 3}0.275{col 54}{space 4}-19.14146{col 67}{space 3} 7.169757
{txt}{space 7}lag63 {c |}{col 14}{res}{space 2}-10.70544{col 26}{space 2} 7.909523{col 37}{space 1}   -1.35{col 46}{space 3}0.247{col 54}{space 4}-32.66579{col 67}{space 3} 11.25492
{txt}{space 7}lag64 {c |}{col 14}{res}{space 2}-9.042538{col 26}{space 2} 3.725605{col 37}{space 1}   -2.43{col 46}{space 3}0.072{col 54}{space 4}-19.38648{col 67}{space 3}   1.3014
{txt}{space 7}lag65 {c |}{col 14}{res}{space 2}-17.71174{col 26}{space 2} 4.609866{col 37}{space 1}   -3.84{col 46}{space 3}0.018{col 54}{space 4}-30.51078{col 67}{space 3}  -4.9127
{txt}{space 7}lag66 {c |}{col 14}{res}{space 2}-2.209988{col 26}{space 2} 4.627815{col 37}{space 1}   -0.48{col 46}{space 3}0.658{col 54}{space 4}-15.05886{col 67}{space 3} 10.63889
{txt}{space 7}lag67 {c |}{col 14}{res}{space 2} 1.979644{col 26}{space 2} 7.543959{col 37}{space 1}    0.26{col 46}{space 3}0.806{col 54}{space 4}-18.96575{col 67}{space 3} 22.92503
{txt}{space 7}lag68 {c |}{col 14}{res}{space 2} .6175572{col 26}{space 2} 6.457806{col 37}{space 1}    0.10{col 46}{space 3}0.928{col 54}{space 4}-17.31219{col 67}{space 3}  18.5473
{txt}{space 7}lag69 {c |}{col 14}{res}{space 2}-8.916852{col 26}{space 2}  2.49071{col 37}{space 1}   -3.58{col 46}{space 3}0.023{col 54}{space 4}-15.83217{col 67}{space 3}-2.001532
{txt}{space 7}lag70 {c |}{col 14}{res}{space 2}-8.078169{col 26}{space 2} 4.387541{col 37}{space 1}   -1.84{col 46}{space 3}0.139{col 54}{space 4}-20.25994{col 67}{space 3} 4.103598
{txt}{space 7}lag71 {c |}{col 14}{res}{space 2}-11.79846{col 26}{space 2} 3.256434{col 37}{space 1}   -3.62{col 46}{space 3}0.022{col 54}{space 4}-20.83977{col 67}{space 3}-2.757151
{txt}{space 7}lag72 {c |}{col 14}{res}{space 2}-5.118712{col 26}{space 2} 2.920539{col 37}{space 1}   -1.75{col 46}{space 3}0.155{col 54}{space 4}-13.22743{col 67}{space 3} 2.990004
{txt}{space 7}lag73 {c |}{col 14}{res}{space 2}-1.650373{col 26}{space 2} 6.074643{col 37}{space 1}   -0.27{col 46}{space 3}0.799{col 54}{space 4}-18.51629{col 67}{space 3} 15.21554
{txt}{space 7}lag74 {c |}{col 14}{res}{space 2}-5.336097{col 26}{space 2}  6.18886{col 37}{space 1}   -0.86{col 46}{space 3}0.437{col 54}{space 4}-22.51913{col 67}{space 3} 11.84693
{txt}{space 7}lag75 {c |}{col 14}{res}{space 2}-2.426485{col 26}{space 2} 6.901994{col 37}{space 1}   -0.35{col 46}{space 3}0.743{col 54}{space 4}-21.58949{col 67}{space 3} 16.73652
{txt}{space 7}lag76 {c |}{col 14}{res}{space 2}-7.308386{col 26}{space 2} 4.528319{col 37}{space 1}   -1.61{col 46}{space 3}0.182{col 54}{space 4}-19.88101{col 67}{space 3} 5.264243
{txt}{space 7}lag77 {c |}{col 14}{res}{space 2}-14.27045{col 26}{space 2}  2.58559{col 37}{space 1}   -5.52{col 46}{space 3}0.005{col 54}{space 4} -21.4492{col 67}{space 3}-7.091701
{txt}{space 7}lag78 {c |}{col 14}{res}{space 2}-6.046191{col 26}{space 2} 5.718304{col 37}{space 1}   -1.06{col 46}{space 3}0.350{col 54}{space 4}-21.92275{col 67}{space 3} 9.830366
{txt}{space 7}lag79 {c |}{col 14}{res}{space 2}-4.958499{col 26}{space 2} 5.310573{col 37}{space 1}   -0.93{col 46}{space 3}0.403{col 54}{space 4}-19.70301{col 67}{space 3} 9.786016
{txt}{space 7}lag80 {c |}{col 14}{res}{space 2}-.9902123{col 26}{space 2} 6.693363{col 37}{space 1}   -0.15{col 46}{space 3}0.890{col 54}{space 4}-19.57397{col 67}{space 3} 17.59354
{txt}{space 7}lag81 {c |}{col 14}{res}{space 2}-2.959266{col 26}{space 2} 5.825669{col 37}{space 1}   -0.51{col 46}{space 3}0.638{col 54}{space 4}-19.13392{col 67}{space 3} 13.21538
{txt}{space 7}lag82 {c |}{col 14}{res}{space 2}-8.441419{col 26}{space 2} 3.970568{col 37}{space 1}   -2.13{col 46}{space 3}0.101{col 54}{space 4}-19.46548{col 67}{space 3} 2.582647
{txt}{space 7}lag83 {c |}{col 14}{res}{space 2}  4.42571{col 26}{space 2} 3.654749{col 37}{space 1}    1.21{col 46}{space 3}0.293{col 54}{space 4}-5.721501{col 67}{space 3} 14.57292
{txt}{space 7}lag84 {c |}{col 14}{res}{space 2} -2.06778{col 26}{space 2} 2.735534{col 37}{space 1}   -0.76{col 46}{space 3}0.492{col 54}{space 4} -9.66284{col 67}{space 3} 5.527279
{txt}{space 7}lag85 {c |}{col 14}{res}{space 2}-8.487201{col 26}{space 2} 4.298876{col 37}{space 1}   -1.97{col 46}{space 3}0.120{col 54}{space 4}-20.42279{col 67}{space 3} 3.448394
{txt}{space 7}lag86 {c |}{col 14}{res}{space 2}-9.172266{col 26}{space 2} 4.253357{col 37}{space 1}   -2.16{col 46}{space 3}0.097{col 54}{space 4}-20.98148{col 67}{space 3} 2.636944
{txt}{space 7}lag87 {c |}{col 14}{res}{space 2}-5.744465{col 26}{space 2} 6.847231{col 37}{space 1}   -0.84{col 46}{space 3}0.449{col 54}{space 4}-24.75543{col 67}{space 3}  13.2665
{txt}{space 7}lag88 {c |}{col 14}{res}{space 2}-8.605675{col 26}{space 2} 5.899397{col 37}{space 1}   -1.46{col 46}{space 3}0.218{col 54}{space 4}-24.98503{col 67}{space 3} 7.773678
{txt}{space 7}lag89 {c |}{col 14}{res}{space 2} 1.927431{col 26}{space 2} 4.618277{col 37}{space 1}    0.42{col 46}{space 3}0.698{col 54}{space 4}-10.89496{col 67}{space 3} 14.74982
{txt}{space 7}lag90 {c |}{col 14}{res}{space 2}-6.292231{col 26}{space 2} 3.140674{col 37}{space 1}   -2.00{col 46}{space 3}0.116{col 54}{space 4}-15.01214{col 67}{space 3} 2.427678
{txt}{space 7}lag91 {c |}{col 14}{res}{space 2}-12.95626{col 26}{space 2} 4.797469{col 37}{space 1}   -2.70{col 46}{space 3}0.054{col 54}{space 4}-26.27617{col 67}{space 3} .3636486
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-143.9347{col 26}{space 2} 26.98472{col 37}{space 1}   -5.33{col 46}{space 3}0.006{col 54}{space 4}-218.8563{col 67}{space 3}-69.01308
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}   regionid1{col 14}{c |}{space 1}        5{col 27}{space 1}        5{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}        date{col 14}{c |}{space 1}     5267{col 27}{space 1}        1{col 39}{result}{space 1}     5266{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. graph export "results/EventStudy-MiddayCo2.png", replace
{txt}{p 0 4 2}
file {bf}
results/EventStudy-MiddayCo2.png{rm}
saved as
PNG
format
{p_end}

{com}. estat leads
{col 40}
{col 5}Joint significance test for leads
{hline 40}
F-stat:{col 25}  11.9827
P-value:{col 25}   0.0169
{hline 40}
Degrees of freedom{col 27}(4,4)
{hline 40}
{txt}
{com}. estat lags
{col 40}
{col 5}Joint significance test for lags
{hline 40}
F-stat:{col 25}   4.8427
P-value:{col 25}   0.0779
{hline 40}
Degrees of freedom{col 27}(4,4)
{hline 40}
{txt}
{com}. 
. eventdd energy_wh_per_capita_vs_midday public_holiday ///
> c.temperature##c.temperature solar_exposure wind_3 ///
>  [aweight = population], timevar(timevar) method(hdfe, absorb(regionid1 date) ///
>  cluster(regionid1)) graph_op(ytitle("Wh energy p.c.") ///
>  xtitle("Days until DST transition") ///
>  title("Event Study - Energy - Midday Normalised"))
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}{txt}warning: missing F statistic; dropped variables due to collinearity or too few clusters
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,264,072
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F( 190,      4)}{col 67}=          {res}.
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.2809
{txt}{col 51}Adj R-squared{col 67}= {res}    0.2778
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0196
{txt}{col 1}Number of clusters ({res}regionid1{txt}) {col 30}= {res}         5{txt}{col 51}Root MSE{col 67}= {res}   71.6559

{txt}{ralign 78:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}energy_wh_~y{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
public_hol~y {c |}{col 14}{res}{space 2} 12.69637{col 26}{space 2} 3.474662{col 37}{space 1}    3.65{col 46}{space 3}0.022{col 54}{space 4} 3.049162{col 67}{space 3} 22.34358
{txt}{space 1}temperature {c |}{col 14}{res}{space 2} 12.89451{col 26}{space 2} 1.819524{col 37}{space 1}    7.09{col 46}{space 3}0.002{col 54}{space 4} 7.842703{col 67}{space 3} 17.94632
{txt}{space 12} {c |}
{space 10}c. {c |}
{space 1}temperature#{c |}
{space 10}c. {c |}
{space 1}temperature {c |}{col 14}{res}{space 2}-.2680316{col 26}{space 2} .0321835{col 37}{space 1}   -8.33{col 46}{space 3}0.001{col 54}{space 4}-.3573873{col 67}{space 3}-.1786759
{txt}{space 12} {c |}
solar_expo~e {c |}{col 14}{res}{space 2} 3.227702{col 26}{space 2} .7069071{col 37}{space 1}    4.57{col 46}{space 3}0.010{col 54}{space 4} 1.265013{col 67}{space 3} 5.190391
{txt}{space 6}wind_3 {c |}{col 14}{res}{space 2}-2.080303{col 26}{space 2} 1.464133{col 37}{space 1}   -1.42{col 46}{space 3}0.228{col 54}{space 4}-6.145389{col 67}{space 3} 1.984783
{txt}{space 6}lead94 {c |}{col 14}{res}{space 2} 2.953748{col 26}{space 2} 18.21377{col 37}{space 1}    0.16{col 46}{space 3}0.879{col 54}{space 4}-47.61578{col 67}{space 3} 53.52327
{txt}{space 6}lead93 {c |}{col 14}{res}{space 2}-6.720313{col 26}{space 2} 6.451935{col 37}{space 1}   -1.04{col 46}{space 3}0.356{col 54}{space 4}-24.63376{col 67}{space 3} 11.19313
{txt}{space 6}lead92 {c |}{col 14}{res}{space 2}  9.15054{col 26}{space 2} 6.123801{col 37}{space 1}    1.49{col 46}{space 3}0.209{col 54}{space 4}-7.851857{col 67}{space 3} 26.15294
{txt}{space 6}lead91 {c |}{col 14}{res}{space 2} 9.309302{col 26}{space 2}  11.0163{col 37}{space 1}    0.85{col 46}{space 3}0.446{col 54}{space 4}-21.27685{col 67}{space 3} 39.89545
{txt}{space 6}lead90 {c |}{col 14}{res}{space 2} 5.366956{col 26}{space 2} 8.694838{col 37}{space 1}    0.62{col 46}{space 3}0.570{col 54}{space 4}-18.77379{col 67}{space 3}  29.5077
{txt}{space 6}lead89 {c |}{col 14}{res}{space 2} 1.491432{col 26}{space 2} 9.439556{col 37}{space 1}    0.16{col 46}{space 3}0.882{col 54}{space 4}-24.71698{col 67}{space 3} 27.69984
{txt}{space 6}lead88 {c |}{col 14}{res}{space 2}  9.02565{col 26}{space 2} 7.447635{col 37}{space 1}    1.21{col 46}{space 3}0.292{col 54}{space 4} -11.6523{col 67}{space 3}  29.7036
{txt}{space 6}lead87 {c |}{col 14}{res}{space 2} 3.794776{col 26}{space 2} 9.435048{col 37}{space 1}    0.40{col 46}{space 3}0.708{col 54}{space 4}-22.40112{col 67}{space 3} 29.99067
{txt}{space 6}lead86 {c |}{col 14}{res}{space 2}-1.082033{col 26}{space 2} 8.679434{col 37}{space 1}   -0.12{col 46}{space 3}0.907{col 54}{space 4}   -25.18{col 67}{space 3} 23.01594
{txt}{space 6}lead85 {c |}{col 14}{res}{space 2}-3.454293{col 26}{space 2} 10.31652{col 37}{space 1}   -0.33{col 46}{space 3}0.755{col 54}{space 4}-32.09756{col 67}{space 3} 25.18897
{txt}{space 6}lead84 {c |}{col 14}{res}{space 2} 10.02962{col 26}{space 2} 10.60636{col 37}{space 1}    0.95{col 46}{space 3}0.398{col 54}{space 4}-19.41836{col 67}{space 3}  39.4776
{txt}{space 6}lead83 {c |}{col 14}{res}{space 2}-.4582852{col 26}{space 2} 9.048614{col 37}{space 1}   -0.05{col 46}{space 3}0.962{col 54}{space 4}-25.58127{col 67}{space 3}  24.6647
{txt}{space 6}lead82 {c |}{col 14}{res}{space 2}-2.798666{col 26}{space 2} 8.227183{col 37}{space 1}   -0.34{col 46}{space 3}0.751{col 54}{space 4}-25.64099{col 67}{space 3} 20.04366
{txt}{space 6}lead81 {c |}{col 14}{res}{space 2} -8.31586{col 26}{space 2} 6.775057{col 37}{space 1}   -1.23{col 46}{space 3}0.287{col 54}{space 4}-27.12643{col 67}{space 3} 10.49471
{txt}{space 6}lead80 {c |}{col 14}{res}{space 2}-13.55752{col 26}{space 2} 8.752715{col 37}{space 1}   -1.55{col 46}{space 3}0.196{col 54}{space 4}-37.85896{col 67}{space 3} 10.74391
{txt}{space 6}lead79 {c |}{col 14}{res}{space 2}-4.868499{col 26}{space 2} 9.083674{col 37}{space 1}   -0.54{col 46}{space 3}0.620{col 54}{space 4}-30.08882{col 67}{space 3} 20.35182
{txt}{space 6}lead78 {c |}{col 14}{res}{space 2} -2.57563{col 26}{space 2} 8.813907{col 37}{space 1}   -0.29{col 46}{space 3}0.785{col 54}{space 4}-27.04696{col 67}{space 3}  21.8957
{txt}{space 6}lead77 {c |}{col 14}{res}{space 2} 9.584227{col 26}{space 2} 5.404328{col 37}{space 1}    1.77{col 46}{space 3}0.151{col 54}{space 4}-5.420592{col 67}{space 3} 24.58905
{txt}{space 6}lead76 {c |}{col 14}{res}{space 2}-.7170672{col 26}{space 2} 7.446459{col 37}{space 1}   -0.10{col 46}{space 3}0.928{col 54}{space 4}-21.39175{col 67}{space 3} 19.95762
{txt}{space 6}lead75 {c |}{col 14}{res}{space 2}-1.027505{col 26}{space 2} 12.15156{col 37}{space 1}   -0.08{col 46}{space 3}0.937{col 54}{space 4}-34.76564{col 67}{space 3} 32.71063
{txt}{space 6}lead74 {c |}{col 14}{res}{space 2}-1.944116{col 26}{space 2} 11.80317{col 37}{space 1}   -0.16{col 46}{space 3}0.877{col 54}{space 4}-34.71496{col 67}{space 3} 30.82673
{txt}{space 6}lead73 {c |}{col 14}{res}{space 2} .3189721{col 26}{space 2}  9.96092{col 37}{space 1}    0.03{col 46}{space 3}0.976{col 54}{space 4}-27.33697{col 67}{space 3} 27.97492
{txt}{space 6}lead72 {c |}{col 14}{res}{space 2} 6.102129{col 26}{space 2} 10.04068{col 37}{space 1}    0.61{col 46}{space 3}0.576{col 54}{space 4}-21.77527{col 67}{space 3} 33.97953
{txt}{space 6}lead71 {c |}{col 14}{res}{space 2} 8.380971{col 26}{space 2} 7.667043{col 37}{space 1}    1.09{col 46}{space 3}0.336{col 54}{space 4}-12.90615{col 67}{space 3} 29.66809
{txt}{space 6}lead70 {c |}{col 14}{res}{space 2} 10.64306{col 26}{space 2} 7.015801{col 37}{space 1}    1.52{col 46}{space 3}0.204{col 54}{space 4}-8.835931{col 67}{space 3} 30.12204
{txt}{space 6}lead69 {c |}{col 14}{res}{space 2} 2.347023{col 26}{space 2} 10.78969{col 37}{space 1}    0.22{col 46}{space 3}0.838{col 54}{space 4}-27.60996{col 67}{space 3}   32.304
{txt}{space 6}lead68 {c |}{col 14}{res}{space 2}-3.960626{col 26}{space 2} 11.29714{col 37}{space 1}   -0.35{col 46}{space 3}0.744{col 54}{space 4}-35.32651{col 67}{space 3} 27.40525
{txt}{space 6}lead67 {c |}{col 14}{res}{space 2}-3.580563{col 26}{space 2} 12.65188{col 37}{space 1}   -0.28{col 46}{space 3}0.791{col 54}{space 4}-38.70781{col 67}{space 3} 31.54668
{txt}{space 6}lead66 {c |}{col 14}{res}{space 2} -3.17854{col 26}{space 2} 12.06671{col 37}{space 1}   -0.26{col 46}{space 3}0.805{col 54}{space 4}-36.68111{col 67}{space 3} 30.32403
{txt}{space 6}lead65 {c |}{col 14}{res}{space 2} -2.36054{col 26}{space 2} 11.89405{col 37}{space 1}   -0.20{col 46}{space 3}0.852{col 54}{space 4}-35.38373{col 67}{space 3} 30.66265
{txt}{space 6}lead64 {c |}{col 14}{res}{space 2} 2.395447{col 26}{space 2} 7.767298{col 37}{space 1}    0.31{col 46}{space 3}0.773{col 54}{space 4}-19.17003{col 67}{space 3} 23.96092
{txt}{space 6}lead63 {c |}{col 14}{res}{space 2} 10.27386{col 26}{space 2} 6.670826{col 37}{space 1}    1.54{col 46}{space 3}0.198{col 54}{space 4}-8.247326{col 67}{space 3} 28.79504
{txt}{space 6}lead62 {c |}{col 14}{res}{space 2} 4.210272{col 26}{space 2} 4.210117{col 37}{space 1}    1.00{col 46}{space 3}0.374{col 54}{space 4}-7.478886{col 67}{space 3} 15.89943
{txt}{space 6}lead61 {c |}{col 14}{res}{space 2}  5.05807{col 26}{space 2} 7.975586{col 37}{space 1}    0.63{col 46}{space 3}0.560{col 54}{space 4}-17.08571{col 67}{space 3} 27.20185
{txt}{space 6}lead60 {c |}{col 14}{res}{space 2} 5.456643{col 26}{space 2} 9.279751{col 37}{space 1}    0.59{col 46}{space 3}0.588{col 54}{space 4}-20.30808{col 67}{space 3} 31.22136
{txt}{space 6}lead59 {c |}{col 14}{res}{space 2} .6536397{col 26}{space 2} 10.91367{col 37}{space 1}    0.06{col 46}{space 3}0.955{col 54}{space 4}-29.64756{col 67}{space 3} 30.95484
{txt}{space 6}lead58 {c |}{col 14}{res}{space 2}-.3639803{col 26}{space 2} 13.22253{col 37}{space 1}   -0.03{col 46}{space 3}0.979{col 54}{space 4} -37.0756{col 67}{space 3} 36.34764
{txt}{space 6}lead57 {c |}{col 14}{res}{space 2}-1.368091{col 26}{space 2} 9.460346{col 37}{space 1}   -0.14{col 46}{space 3}0.892{col 54}{space 4}-27.63422{col 67}{space 3} 24.89804
{txt}{space 6}lead56 {c |}{col 14}{res}{space 2} 9.907642{col 26}{space 2} 6.211203{col 37}{space 1}    1.60{col 46}{space 3}0.186{col 54}{space 4}-7.337423{col 67}{space 3} 27.15271
{txt}{space 6}lead55 {c |}{col 14}{res}{space 2} 6.383273{col 26}{space 2} 6.816921{col 37}{space 1}    0.94{col 46}{space 3}0.402{col 54}{space 4}-12.54354{col 67}{space 3} 25.31008
{txt}{space 6}lead54 {c |}{col 14}{res}{space 2} 3.558517{col 26}{space 2} 9.043412{col 37}{space 1}    0.39{col 46}{space 3}0.714{col 54}{space 4}-21.55002{col 67}{space 3} 28.66706
{txt}{space 6}lead53 {c |}{col 14}{res}{space 2} -2.55132{col 26}{space 2} 9.183743{col 37}{space 1}   -0.28{col 46}{space 3}0.795{col 54}{space 4}-28.04948{col 67}{space 3} 22.94684
{txt}{space 6}lead52 {c |}{col 14}{res}{space 2}-3.828421{col 26}{space 2} 11.23855{col 37}{space 1}   -0.34{col 46}{space 3}0.751{col 54}{space 4}-35.03164{col 67}{space 3} 27.37479
{txt}{space 6}lead51 {c |}{col 14}{res}{space 2}-8.603994{col 26}{space 2} 10.13279{col 37}{space 1}   -0.85{col 46}{space 3}0.444{col 54}{space 4}-36.73714{col 67}{space 3} 19.52915
{txt}{space 6}lead50 {c |}{col 14}{res}{space 2}   2.2507{col 26}{space 2} 5.632663{col 37}{space 1}    0.40{col 46}{space 3}0.710{col 54}{space 4}-13.38808{col 67}{space 3} 17.88948
{txt}{space 6}lead49 {c |}{col 14}{res}{space 2}-4.438112{col 26}{space 2} 4.115098{col 37}{space 1}   -1.08{col 46}{space 3}0.342{col 54}{space 4}-15.86345{col 67}{space 3} 6.987231
{txt}{space 6}lead48 {c |}{col 14}{res}{space 2}-7.850221{col 26}{space 2} 4.718993{col 37}{space 1}   -1.66{col 46}{space 3}0.172{col 54}{space 4}-20.95225{col 67}{space 3} 5.251804
{txt}{space 6}lead47 {c |}{col 14}{res}{space 2}-10.22199{col 26}{space 2} 6.987493{col 37}{space 1}   -1.46{col 46}{space 3}0.217{col 54}{space 4}-29.62238{col 67}{space 3} 9.178402
{txt}{space 6}lead46 {c |}{col 14}{res}{space 2} .8334763{col 26}{space 2} 9.336456{col 37}{space 1}    0.09{col 46}{space 3}0.933{col 54}{space 4}-25.08868{col 67}{space 3} 26.75563
{txt}{space 6}lead45 {c |}{col 14}{res}{space 2}-.3756211{col 26}{space 2} 6.199331{col 37}{space 1}   -0.06{col 46}{space 3}0.955{col 54}{space 4}-17.58772{col 67}{space 3} 16.83648
{txt}{space 6}lead44 {c |}{col 14}{res}{space 2}-4.595863{col 26}{space 2} 8.454493{col 37}{space 1}   -0.54{col 46}{space 3}0.616{col 54}{space 4} -28.0693{col 67}{space 3} 18.87757
{txt}{space 6}lead43 {c |}{col 14}{res}{space 2}-4.638192{col 26}{space 2} 5.691274{col 37}{space 1}   -0.81{col 46}{space 3}0.461{col 54}{space 4} -20.4397{col 67}{space 3} 11.16332
{txt}{space 6}lead42 {c |}{col 14}{res}{space 2} 4.352828{col 26}{space 2} 2.413048{col 37}{space 1}    1.80{col 46}{space 3}0.146{col 54}{space 4}-2.346869{col 67}{space 3} 11.05252
{txt}{space 6}lead41 {c |}{col 14}{res}{space 2} 1.474928{col 26}{space 2} 3.268519{col 37}{space 1}    0.45{col 46}{space 3}0.675{col 54}{space 4}-7.599937{col 67}{space 3} 10.54979
{txt}{space 6}lead40 {c |}{col 14}{res}{space 2} .5608099{col 26}{space 2} 6.321492{col 37}{space 1}    0.09{col 46}{space 3}0.934{col 54}{space 4}-16.99047{col 67}{space 3} 18.11209
{txt}{space 6}lead39 {c |}{col 14}{res}{space 2}-6.707273{col 26}{space 2} 8.990712{col 37}{space 1}   -0.75{col 46}{space 3}0.497{col 54}{space 4}-31.66949{col 67}{space 3} 18.25494
{txt}{space 6}lead38 {c |}{col 14}{res}{space 2} 2.032482{col 26}{space 2} 7.610863{col 37}{space 1}    0.27{col 46}{space 3}0.803{col 54}{space 4}-19.09866{col 67}{space 3} 23.16363
{txt}{space 6}lead37 {c |}{col 14}{res}{space 2}  .735543{col 26}{space 2} 6.490382{col 37}{space 1}    0.11{col 46}{space 3}0.915{col 54}{space 4}-17.28465{col 67}{space 3} 18.75573
{txt}{space 6}lead36 {c |}{col 14}{res}{space 2}-.1906158{col 26}{space 2} 4.811556{col 37}{space 1}   -0.04{col 46}{space 3}0.970{col 54}{space 4}-13.54964{col 67}{space 3}  13.1684
{txt}{space 6}lead35 {c |}{col 14}{res}{space 2} 10.44468{col 26}{space 2} 5.974633{col 37}{space 1}    1.75{col 46}{space 3}0.155{col 54}{space 4}-6.143564{col 67}{space 3} 27.03292
{txt}{space 6}lead34 {c |}{col 14}{res}{space 2} .1910159{col 26}{space 2} 7.242858{col 37}{space 1}    0.03{col 46}{space 3}0.980{col 54}{space 4}-19.91838{col 67}{space 3} 20.30041
{txt}{space 6}lead33 {c |}{col 14}{res}{space 2}-3.491862{col 26}{space 2} 8.217645{col 37}{space 1}   -0.42{col 46}{space 3}0.693{col 54}{space 4} -26.3077{col 67}{space 3} 19.32398
{txt}{space 6}lead32 {c |}{col 14}{res}{space 2} .9082998{col 26}{space 2} 6.121819{col 37}{space 1}    0.15{col 46}{space 3}0.889{col 54}{space 4}-16.08859{col 67}{space 3} 17.90519
{txt}{space 6}lead31 {c |}{col 14}{res}{space 2} -.493063{col 26}{space 2} 4.293632{col 37}{space 1}   -0.11{col 46}{space 3}0.914{col 54}{space 4} -12.4141{col 67}{space 3} 11.42797
{txt}{space 6}lead30 {c |}{col 14}{res}{space 2} 2.298206{col 26}{space 2} 4.609997{col 37}{space 1}    0.50{col 46}{space 3}0.644{col 54}{space 4} -10.5012{col 67}{space 3} 15.09761
{txt}{space 6}lead29 {c |}{col 14}{res}{space 2} 5.324357{col 26}{space 2}  3.90231{col 37}{space 1}    1.36{col 46}{space 3}0.244{col 54}{space 4}-5.510192{col 67}{space 3} 16.15891
{txt}{space 6}lead28 {c |}{col 14}{res}{space 2} 8.446223{col 26}{space 2} 2.527404{col 37}{space 1}    3.34{col 46}{space 3}0.029{col 54}{space 4} 1.429026{col 67}{space 3} 15.46342
{txt}{space 6}lead27 {c |}{col 14}{res}{space 2} 4.865584{col 26}{space 2} 3.274784{col 37}{space 1}    1.49{col 46}{space 3}0.212{col 54}{space 4}-4.226675{col 67}{space 3} 13.95784
{txt}{space 6}lead26 {c |}{col 14}{res}{space 2}-1.598166{col 26}{space 2}  6.17516{col 37}{space 1}   -0.26{col 46}{space 3}0.809{col 54}{space 4}-18.74316{col 67}{space 3} 15.54683
{txt}{space 6}lead25 {c |}{col 14}{res}{space 2}-3.890825{col 26}{space 2} 3.746479{col 37}{space 1}   -1.04{col 46}{space 3}0.358{col 54}{space 4}-14.29272{col 67}{space 3} 6.511069
{txt}{space 6}lead24 {c |}{col 14}{res}{space 2}-2.148639{col 26}{space 2} 4.677433{col 37}{space 1}   -0.46{col 46}{space 3}0.670{col 54}{space 4}-15.13528{col 67}{space 3}   10.838
{txt}{space 6}lead23 {c |}{col 14}{res}{space 2} 1.084034{col 26}{space 2} 5.138668{col 37}{space 1}    0.21{col 46}{space 3}0.843{col 54}{space 4} -13.1832{col 67}{space 3} 15.35126
{txt}{space 6}lead22 {c |}{col 14}{res}{space 2} -3.17757{col 26}{space 2} 3.406829{col 37}{space 1}   -0.93{col 46}{space 3}0.404{col 54}{space 4}-12.63644{col 67}{space 3} 6.281305
{txt}{space 6}lead21 {c |}{col 14}{res}{space 2} 2.846647{col 26}{space 2} 3.008901{col 37}{space 1}    0.95{col 46}{space 3}0.398{col 54}{space 4}-5.507402{col 67}{space 3} 11.20069
{txt}{space 6}lead20 {c |}{col 14}{res}{space 2} 4.712469{col 26}{space 2} 3.268067{col 37}{space 1}    1.44{col 46}{space 3}0.223{col 54}{space 4}-4.361139{col 67}{space 3} 13.78608
{txt}{space 6}lead19 {c |}{col 14}{res}{space 2}-3.974934{col 26}{space 2} 1.623251{col 37}{space 1}   -2.45{col 46}{space 3}0.071{col 54}{space 4}-8.481801{col 67}{space 3} .5319338
{txt}{space 6}lead18 {c |}{col 14}{res}{space 2} .4572961{col 26}{space 2} 2.424787{col 37}{space 1}    0.19{col 46}{space 3}0.860{col 54}{space 4}-6.274991{col 67}{space 3} 7.189583
{txt}{space 6}lead17 {c |}{col 14}{res}{space 2}-3.116913{col 26}{space 2} 2.662684{col 37}{space 1}   -1.17{col 46}{space 3}0.307{col 54}{space 4}-10.50971{col 67}{space 3} 4.275882
{txt}{space 6}lead16 {c |}{col 14}{res}{space 2}-4.292187{col 26}{space 2} 5.065783{col 37}{space 1}   -0.85{col 46}{space 3}0.445{col 54}{space 4}-18.35706{col 67}{space 3} 9.772681
{txt}{space 6}lead15 {c |}{col 14}{res}{space 2}-5.473615{col 26}{space 2} 3.277805{col 37}{space 1}   -1.67{col 46}{space 3}0.170{col 54}{space 4}-14.57426{col 67}{space 3} 3.627031
{txt}{space 6}lead14 {c |}{col 14}{res}{space 2}-5.120943{col 26}{space 2} 2.419162{col 37}{space 1}   -2.12{col 46}{space 3}0.102{col 54}{space 4}-11.83761{col 67}{space 3} 1.595728
{txt}{space 6}lead13 {c |}{col 14}{res}{space 2}-.7197595{col 26}{space 2} 2.651954{col 37}{space 1}   -0.27{col 46}{space 3}0.800{col 54}{space 4}-8.082764{col 67}{space 3} 6.643245
{txt}{space 6}lead12 {c |}{col 14}{res}{space 2}-2.850319{col 26}{space 2} 2.898146{col 37}{space 1}   -0.98{col 46}{space 3}0.381{col 54}{space 4}-10.89686{col 67}{space 3} 5.196223
{txt}{space 6}lead11 {c |}{col 14}{res}{space 2}-4.906357{col 26}{space 2} 4.435343{col 37}{space 1}   -1.11{col 46}{space 3}0.331{col 54}{space 4}-17.22084{col 67}{space 3}  7.40813
{txt}{space 6}lead10 {c |}{col 14}{res}{space 2}-4.929667{col 26}{space 2} 2.337908{col 37}{space 1}   -2.11{col 46}{space 3}0.103{col 54}{space 4}-11.42074{col 67}{space 3} 1.561405
{txt}{space 7}lead9 {c |}{col 14}{res}{space 2}-.8021804{col 26}{space 2} 3.484728{col 37}{space 1}   -0.23{col 46}{space 3}0.829{col 54}{space 4}-10.47734{col 67}{space 3} 8.872976
{txt}{space 7}lead8 {c |}{col 14}{res}{space 2} 3.165961{col 26}{space 2} 3.148449{col 37}{space 1}    1.01{col 46}{space 3}0.372{col 54}{space 4}-5.575535{col 67}{space 3} 11.90746
{txt}{space 7}lead7 {c |}{col 14}{res}{space 2} 4.785439{col 26}{space 2} 1.645953{col 37}{space 1}    2.91{col 46}{space 3}0.044{col 54}{space 4} .2155402{col 67}{space 3} 9.355338
{txt}{space 7}lead6 {c |}{col 14}{res}{space 2}-4.809458{col 26}{space 2} 1.531127{col 37}{space 1}   -3.14{col 46}{space 3}0.035{col 54}{space 4}-9.060548{col 67}{space 3}-.5583678
{txt}{space 7}lead5 {c |}{col 14}{res}{space 2}-8.592533{col 26}{space 2}  3.41618{col 37}{space 1}   -2.52{col 46}{space 3}0.066{col 54}{space 4}-18.07737{col 67}{space 3}  .892303
{txt}{space 7}lead4 {c |}{col 14}{res}{space 2}-8.138114{col 26}{space 2} 2.876079{col 37}{space 1}   -2.83{col 46}{space 3}0.047{col 54}{space 4}-16.12339{col 67}{space 3}-.1528398
{txt}{space 7}lead3 {c |}{col 14}{res}{space 2}-5.867201{col 26}{space 2} 2.542419{col 37}{space 1}   -2.31{col 46}{space 3}0.082{col 54}{space 4}-12.92609{col 67}{space 3} 1.191687
{txt}{space 7}lead2 {c |}{col 14}{res}{space 2} .5481054{col 26}{space 2} 1.200765{col 37}{space 1}    0.46{col 46}{space 3}0.672{col 54}{space 4}-2.785752{col 67}{space 3} 3.881962
{txt}{space 8}lag0 {c |}{col 14}{res}{space 2} 1.802555{col 26}{space 2} 1.882421{col 37}{space 1}    0.96{col 46}{space 3}0.393{col 54}{space 4}-3.423884{col 67}{space 3} 7.028993
{txt}{space 8}lag1 {c |}{col 14}{res}{space 2}-2.132314{col 26}{space 2} 4.084276{col 37}{space 1}   -0.52{col 46}{space 3}0.629{col 54}{space 4}-13.47208{col 67}{space 3} 9.207455
{txt}{space 8}lag2 {c |}{col 14}{res}{space 2}-2.328415{col 26}{space 2} 4.167466{col 37}{space 1}   -0.56{col 46}{space 3}0.606{col 54}{space 4}-13.89915{col 67}{space 3} 9.242326
{txt}{space 8}lag3 {c |}{col 14}{res}{space 2}-2.161711{col 26}{space 2} 1.378616{col 37}{space 1}   -1.57{col 46}{space 3}0.192{col 54}{space 4}-5.989361{col 67}{space 3}  1.66594
{txt}{space 8}lag4 {c |}{col 14}{res}{space 2}-.7314661{col 26}{space 2} 2.591918{col 37}{space 1}   -0.28{col 46}{space 3}0.792{col 54}{space 4}-7.927783{col 67}{space 3} 6.464851
{txt}{space 8}lag5 {c |}{col 14}{res}{space 2} 3.202091{col 26}{space 2} 2.038544{col 37}{space 1}    1.57{col 46}{space 3}0.191{col 54}{space 4}-2.457814{col 67}{space 3} 8.861995
{txt}{space 8}lag6 {c |}{col 14}{res}{space 2} 1.206225{col 26}{space 2} 1.152734{col 37}{space 1}    1.05{col 46}{space 3}0.354{col 54}{space 4}-1.994277{col 67}{space 3} 4.406726
{txt}{space 8}lag7 {c |}{col 14}{res}{space 2} 5.481841{col 26}{space 2} .8990317{col 37}{space 1}    6.10{col 46}{space 3}0.004{col 54}{space 4} 2.985729{col 67}{space 3} 7.977953
{txt}{space 8}lag8 {c |}{col 14}{res}{space 2} 7.349964{col 26}{space 2} 1.906624{col 37}{space 1}    3.85{col 46}{space 3}0.018{col 54}{space 4} 2.056327{col 67}{space 3}  12.6436
{txt}{space 8}lag9 {c |}{col 14}{res}{space 2} 6.819718{col 26}{space 2} 1.434412{col 37}{space 1}    4.75{col 46}{space 3}0.009{col 54}{space 4} 2.837152{col 67}{space 3} 10.80228
{txt}{space 7}lag10 {c |}{col 14}{res}{space 2} 3.854848{col 26}{space 2} 1.073645{col 37}{space 1}    3.59{col 46}{space 3}0.023{col 54}{space 4}  .873932{col 67}{space 3} 6.835765
{txt}{space 7}lag11 {c |}{col 14}{res}{space 2}-2.187237{col 26}{space 2} 2.447863{col 37}{space 1}   -0.89{col 46}{space 3}0.422{col 54}{space 4}-8.983594{col 67}{space 3}  4.60912
{txt}{space 7}lag12 {c |}{col 14}{res}{space 2}-.4722882{col 26}{space 2} 1.437793{col 37}{space 1}   -0.33{col 46}{space 3}0.759{col 54}{space 4}-4.464242{col 67}{space 3} 3.519665
{txt}{space 7}lag13 {c |}{col 14}{res}{space 2} .4478922{col 26}{space 2} 2.039591{col 37}{space 1}    0.22{col 46}{space 3}0.837{col 54}{space 4}-5.214919{col 67}{space 3} 6.110703
{txt}{space 7}lag14 {c |}{col 14}{res}{space 2} 5.598433{col 26}{space 2} 1.962622{col 37}{space 1}    2.85{col 46}{space 3}0.046{col 54}{space 4} .1493215{col 67}{space 3} 11.04755
{txt}{space 7}lag15 {c |}{col 14}{res}{space 2} 7.434807{col 26}{space 2} 2.745914{col 37}{space 1}    2.71{col 46}{space 3}0.054{col 54}{space 4}-.1890725{col 67}{space 3} 15.05869
{txt}{space 7}lag16 {c |}{col 14}{res}{space 2} 8.673929{col 26}{space 2} 2.570677{col 37}{space 1}    3.37{col 46}{space 3}0.028{col 54}{space 4} 1.536585{col 67}{space 3} 15.81127
{txt}{space 7}lag17 {c |}{col 14}{res}{space 2} 9.683892{col 26}{space 2} 3.075125{col 37}{space 1}    3.15{col 46}{space 3}0.035{col 54}{space 4} 1.145976{col 67}{space 3} 18.22181
{txt}{space 7}lag18 {c |}{col 14}{res}{space 2} 1.805019{col 26}{space 2} 2.277854{col 37}{space 1}    0.79{col 46}{space 3}0.472{col 54}{space 4}-4.519317{col 67}{space 3} 8.129355
{txt}{space 7}lag19 {c |}{col 14}{res}{space 2}-1.629922{col 26}{space 2} 2.956226{col 37}{space 1}   -0.55{col 46}{space 3}0.611{col 54}{space 4}-9.837722{col 67}{space 3} 6.577879
{txt}{space 7}lag20 {c |}{col 14}{res}{space 2} 11.28054{col 26}{space 2} 3.775361{col 37}{space 1}    2.99{col 46}{space 3}0.040{col 54}{space 4} .7984586{col 67}{space 3} 21.76262
{txt}{space 7}lag21 {c |}{col 14}{res}{space 2} 5.514729{col 26}{space 2}  1.11854{col 37}{space 1}    4.93{col 46}{space 3}0.008{col 54}{space 4} 2.409164{col 67}{space 3} 8.620294
{txt}{space 7}lag22 {c |}{col 14}{res}{space 2} 2.913826{col 26}{space 2} 1.185227{col 37}{space 1}    2.46{col 46}{space 3}0.070{col 54}{space 4} -.376891{col 67}{space 3} 6.204544
{txt}{space 7}lag23 {c |}{col 14}{res}{space 2} 3.417686{col 26}{space 2} 4.010366{col 37}{space 1}    0.85{col 46}{space 3}0.442{col 54}{space 4}-7.716876{col 67}{space 3} 14.55225
{txt}{space 7}lag24 {c |}{col 14}{res}{space 2} 2.796831{col 26}{space 2} 2.232644{col 37}{space 1}    1.25{col 46}{space 3}0.279{col 54}{space 4}-3.401983{col 67}{space 3} 8.995645
{txt}{space 7}lag25 {c |}{col 14}{res}{space 2} 4.085251{col 26}{space 2} 1.976313{col 37}{space 1}    2.07{col 46}{space 3}0.108{col 54}{space 4}-1.401873{col 67}{space 3} 9.572375
{txt}{space 7}lag26 {c |}{col 14}{res}{space 2} 2.532353{col 26}{space 2} 1.680258{col 37}{space 1}    1.51{col 46}{space 3}0.206{col 54}{space 4}-2.132791{col 67}{space 3} 7.197497
{txt}{space 7}lag27 {c |}{col 14}{res}{space 2}  2.69469{col 26}{space 2} 2.013822{col 37}{space 1}    1.34{col 46}{space 3}0.252{col 54}{space 4}-2.896576{col 67}{space 3} 8.285955
{txt}{space 7}lag28 {c |}{col 14}{res}{space 2} 1.616836{col 26}{space 2} 1.498348{col 37}{space 1}    1.08{col 46}{space 3}0.341{col 54}{space 4}-2.543244{col 67}{space 3} 5.776916
{txt}{space 7}lag29 {c |}{col 14}{res}{space 2} 4.530267{col 26}{space 2} 2.584658{col 37}{space 1}    1.75{col 46}{space 3}0.155{col 54}{space 4}-2.645895{col 67}{space 3} 11.70643
{txt}{space 7}lag30 {c |}{col 14}{res}{space 2}  4.49771{col 26}{space 2}  1.23862{col 37}{space 1}    3.63{col 46}{space 3}0.022{col 54}{space 4}  1.05875{col 67}{space 3} 7.936671
{txt}{space 7}lag31 {c |}{col 14}{res}{space 2} 4.578644{col 26}{space 2} 4.844647{col 37}{space 1}    0.95{col 46}{space 3}0.398{col 54}{space 4}-8.872251{col 67}{space 3} 18.02954
{txt}{space 7}lag32 {c |}{col 14}{res}{space 2}  3.51051{col 26}{space 2}  3.17296{col 37}{space 1}    1.11{col 46}{space 3}0.331{col 54}{space 4} -5.29904{col 67}{space 3} 12.32006
{txt}{space 7}lag33 {c |}{col 14}{res}{space 2} 2.384733{col 26}{space 2} 2.544208{col 37}{space 1}    0.94{col 46}{space 3}0.402{col 54}{space 4} -4.67912{col 67}{space 3} 9.448586
{txt}{space 7}lag34 {c |}{col 14}{res}{space 2} .3900465{col 26}{space 2} 2.891019{col 37}{space 1}    0.13{col 46}{space 3}0.899{col 54}{space 4}-7.636709{col 67}{space 3} 8.416802
{txt}{space 7}lag35 {c |}{col 14}{res}{space 2} 2.829109{col 26}{space 2} 2.754723{col 37}{space 1}    1.03{col 46}{space 3}0.362{col 54}{space 4}-4.819227{col 67}{space 3} 10.47745
{txt}{space 7}lag36 {c |}{col 14}{res}{space 2}  4.18015{col 26}{space 2} 2.624893{col 37}{space 1}    1.59{col 46}{space 3}0.186{col 54}{space 4} -3.10772{col 67}{space 3} 11.46802
{txt}{space 7}lag37 {c |}{col 14}{res}{space 2}  8.29784{col 26}{space 2}   2.3753{col 37}{space 1}    3.49{col 46}{space 3}0.025{col 54}{space 4} 1.702949{col 67}{space 3} 14.89273
{txt}{space 7}lag38 {c |}{col 14}{res}{space 2}-3.443435{col 26}{space 2}  3.05167{col 37}{space 1}   -1.13{col 46}{space 3}0.322{col 54}{space 4}-11.91623{col 67}{space 3}  5.02936
{txt}{space 7}lag39 {c |}{col 14}{res}{space 2}-1.376165{col 26}{space 2} 2.146797{col 37}{space 1}   -0.64{col 46}{space 3}0.556{col 54}{space 4}-7.336627{col 67}{space 3} 4.584298
{txt}{space 7}lag40 {c |}{col 14}{res}{space 2}-2.933864{col 26}{space 2} 1.927605{col 37}{space 1}   -1.52{col 46}{space 3}0.203{col 54}{space 4}-8.285753{col 67}{space 3} 2.418025
{txt}{space 7}lag41 {c |}{col 14}{res}{space 2} 2.891992{col 26}{space 2} 2.671947{col 37}{space 1}    1.08{col 46}{space 3}0.340{col 54}{space 4}-4.526522{col 67}{space 3} 10.31051
{txt}{space 7}lag42 {c |}{col 14}{res}{space 2} 1.471964{col 26}{space 2} 3.053493{col 37}{space 1}    0.48{col 46}{space 3}0.655{col 54}{space 4}-7.005891{col 67}{space 3} 9.949819
{txt}{space 7}lag43 {c |}{col 14}{res}{space 2}-3.540692{col 26}{space 2} 2.189196{col 37}{space 1}   -1.62{col 46}{space 3}0.181{col 54}{space 4}-9.618876{col 67}{space 3} 2.537491
{txt}{space 7}lag44 {c |}{col 14}{res}{space 2}-1.429907{col 26}{space 2} 1.811439{col 37}{space 1}   -0.79{col 46}{space 3}0.474{col 54}{space 4}-6.459267{col 67}{space 3} 3.599453
{txt}{space 7}lag45 {c |}{col 14}{res}{space 2} 4.204521{col 26}{space 2} 2.618156{col 37}{space 1}    1.61{col 46}{space 3}0.184{col 54}{space 4}-3.064646{col 67}{space 3} 11.47369
{txt}{space 7}lag46 {c |}{col 14}{res}{space 2}-2.310049{col 26}{space 2} 3.913898{col 37}{space 1}   -0.59{col 46}{space 3}0.587{col 54}{space 4}-13.17677{col 67}{space 3} 8.556676
{txt}{space 7}lag47 {c |}{col 14}{res}{space 2} 6.998078{col 26}{space 2}   2.2477{col 37}{space 1}    3.11{col 46}{space 3}0.036{col 54}{space 4} .7574628{col 67}{space 3} 13.23869
{txt}{space 7}lag48 {c |}{col 14}{res}{space 2} 1.557273{col 26}{space 2} 2.916721{col 37}{space 1}    0.53{col 46}{space 3}0.622{col 54}{space 4}-6.540842{col 67}{space 3} 9.655388
{txt}{space 7}lag49 {c |}{col 14}{res}{space 2} 1.904025{col 26}{space 2} 5.013623{col 37}{space 1}    0.38{col 46}{space 3}0.723{col 54}{space 4}-12.01602{col 67}{space 3} 15.82407
{txt}{space 7}lag50 {c |}{col 14}{res}{space 2}-7.093256{col 26}{space 2} 2.850452{col 37}{space 1}   -2.49{col 46}{space 3}0.068{col 54}{space 4}-15.00738{col 67}{space 3} .8208677
{txt}{space 7}lag51 {c |}{col 14}{res}{space 2}-2.532133{col 26}{space 2} 2.318186{col 37}{space 1}   -1.09{col 46}{space 3}0.336{col 54}{space 4}-8.968448{col 67}{space 3} 3.904183
{txt}{space 7}lag52 {c |}{col 14}{res}{space 2}  1.14691{col 26}{space 2} 4.638368{col 37}{space 1}    0.25{col 46}{space 3}0.817{col 54}{space 4}-11.73126{col 67}{space 3} 14.02508
{txt}{space 7}lag53 {c |}{col 14}{res}{space 2}-7.689013{col 26}{space 2} 2.151359{col 37}{space 1}   -3.57{col 46}{space 3}0.023{col 54}{space 4}-13.66214{col 67}{space 3}-1.715883
{txt}{space 7}lag54 {c |}{col 14}{res}{space 2} .3042446{col 26}{space 2} 1.965319{col 37}{space 1}    0.15{col 46}{space 3}0.884{col 54}{space 4}-5.152356{col 67}{space 3} 5.760845
{txt}{space 7}lag55 {c |}{col 14}{res}{space 2}-3.513107{col 26}{space 2} 2.783544{col 37}{space 1}   -1.26{col 46}{space 3}0.275{col 54}{space 4}-11.24146{col 67}{space 3}  4.21525
{txt}{space 7}lag56 {c |}{col 14}{res}{space 2} 7.337222{col 26}{space 2} 2.992874{col 37}{space 1}    2.45{col 46}{space 3}0.070{col 54}{space 4}-.9723289{col 67}{space 3} 15.64677
{txt}{space 7}lag57 {c |}{col 14}{res}{space 2} 3.782559{col 26}{space 2} 2.467542{col 37}{space 1}    1.53{col 46}{space 3}0.200{col 54}{space 4}-3.068437{col 67}{space 3} 10.63355
{txt}{space 7}lag58 {c |}{col 14}{res}{space 2} 1.396274{col 26}{space 2} 2.183227{col 37}{space 1}    0.64{col 46}{space 3}0.557{col 54}{space 4}-4.665337{col 67}{space 3} 7.457885
{txt}{space 7}lag59 {c |}{col 14}{res}{space 2} 7.554184{col 26}{space 2}  2.60654{col 37}{space 1}    2.90{col 46}{space 3}0.044{col 54}{space 4} .3172696{col 67}{space 3}  14.7911
{txt}{space 7}lag60 {c |}{col 14}{res}{space 2} 7.075527{col 26}{space 2} 2.371517{col 37}{space 1}    2.98{col 46}{space 3}0.041{col 54}{space 4} .4911392{col 67}{space 3} 13.65991
{txt}{space 7}lag61 {c |}{col 14}{res}{space 2}-1.840046{col 26}{space 2} 4.270118{col 37}{space 1}   -0.43{col 46}{space 3}0.689{col 54}{space 4}-13.69579{col 67}{space 3}  10.0157
{txt}{space 7}lag62 {c |}{col 14}{res}{space 2}-6.236451{col 26}{space 2}  1.72489{col 37}{space 1}   -3.62{col 46}{space 3}0.022{col 54}{space 4}-11.02551{col 67}{space 3}-1.447389
{txt}{space 7}lag63 {c |}{col 14}{res}{space 2}-6.990048{col 26}{space 2} 4.167468{col 37}{space 1}   -1.68{col 46}{space 3}0.169{col 54}{space 4}-18.56079{col 67}{space 3} 4.580698
{txt}{space 7}lag64 {c |}{col 14}{res}{space 2}-7.359184{col 26}{space 2} 2.480104{col 37}{space 1}   -2.97{col 46}{space 3}0.041{col 54}{space 4}-14.24506{col 67}{space 3}-.4733117
{txt}{space 7}lag65 {c |}{col 14}{res}{space 2}-14.75451{col 26}{space 2} 4.094454{col 37}{space 1}   -3.60{col 46}{space 3}0.023{col 54}{space 4}-26.12254{col 67}{space 3}-3.386483
{txt}{space 7}lag66 {c |}{col 14}{res}{space 2}  3.14291{col 26}{space 2} 1.164951{col 37}{space 1}    2.70{col 46}{space 3}0.054{col 54}{space 4}-.0915124{col 67}{space 3} 6.377332
{txt}{space 7}lag67 {c |}{col 14}{res}{space 2} 2.933184{col 26}{space 2} 2.367141{col 37}{space 1}    1.24{col 46}{space 3}0.283{col 54}{space 4}-3.639054{col 67}{space 3} 9.505422
{txt}{space 7}lag68 {c |}{col 14}{res}{space 2} 2.900147{col 26}{space 2} 3.500521{col 37}{space 1}    0.83{col 46}{space 3}0.454{col 54}{space 4}-6.818857{col 67}{space 3} 12.61915
{txt}{space 7}lag69 {c |}{col 14}{res}{space 2}-10.44058{col 26}{space 2} 2.127497{col 37}{space 1}   -4.91{col 46}{space 3}0.008{col 54}{space 4}-16.34745{col 67}{space 3}-4.533697
{txt}{space 7}lag70 {c |}{col 14}{res}{space 2}-4.871491{col 26}{space 2} 4.680966{col 37}{space 1}   -1.04{col 46}{space 3}0.357{col 54}{space 4}-17.86794{col 67}{space 3} 8.124955
{txt}{space 7}lag71 {c |}{col 14}{res}{space 2}-5.181858{col 26}{space 2} 3.407415{col 37}{space 1}   -1.52{col 46}{space 3}0.203{col 54}{space 4}-14.64236{col 67}{space 3} 4.278644
{txt}{space 7}lag72 {c |}{col 14}{res}{space 2}-6.188222{col 26}{space 2} 2.718549{col 37}{space 1}   -2.28{col 46}{space 3}0.085{col 54}{space 4}-13.73612{col 67}{space 3}  1.35968
{txt}{space 7}lag73 {c |}{col 14}{res}{space 2} 2.874205{col 26}{space 2} 5.221519{col 37}{space 1}    0.55{col 46}{space 3}0.611{col 54}{space 4}-11.62306{col 67}{space 3} 17.37147
{txt}{space 7}lag74 {c |}{col 14}{res}{space 2} .7874587{col 26}{space 2} 3.325303{col 37}{space 1}    0.24{col 46}{space 3}0.824{col 54}{space 4}-8.445063{col 67}{space 3} 10.01998
{txt}{space 7}lag75 {c |}{col 14}{res}{space 2} 2.928926{col 26}{space 2} 3.551357{col 37}{space 1}    0.82{col 46}{space 3}0.456{col 54}{space 4} -6.93122{col 67}{space 3} 12.78907
{txt}{space 7}lag76 {c |}{col 14}{res}{space 2} 1.369253{col 26}{space 2} 5.282061{col 37}{space 1}    0.26{col 46}{space 3}0.808{col 54}{space 4} -13.2961{col 67}{space 3} 16.03461
{txt}{space 7}lag77 {c |}{col 14}{res}{space 2}-3.953613{col 26}{space 2} 4.391191{col 37}{space 1}   -0.90{col 46}{space 3}0.419{col 54}{space 4}-16.14551{col 67}{space 3} 8.238289
{txt}{space 7}lag78 {c |}{col 14}{res}{space 2}-4.169941{col 26}{space 2} 3.774636{col 37}{space 1}   -1.10{col 46}{space 3}0.331{col 54}{space 4}-14.65001{col 67}{space 3} 6.310128
{txt}{space 7}lag79 {c |}{col 14}{res}{space 2}-6.268447{col 26}{space 2} 2.477151{col 37}{space 1}   -2.53{col 46}{space 3}0.065{col 54}{space 4}-13.14612{col 67}{space 3} .6092261
{txt}{space 7}lag80 {c |}{col 14}{res}{space 2}-.1973517{col 26}{space 2} 4.799834{col 37}{space 1}   -0.04{col 46}{space 3}0.969{col 54}{space 4}-13.52383{col 67}{space 3} 13.12913
{txt}{space 7}lag81 {c |}{col 14}{res}{space 2}-5.479283{col 26}{space 2} 3.267996{col 37}{space 1}   -1.68{col 46}{space 3}0.169{col 54}{space 4}-14.55269{col 67}{space 3} 3.594129
{txt}{space 7}lag82 {c |}{col 14}{res}{space 2} -8.03832{col 26}{space 2} 2.164867{col 37}{space 1}   -3.71{col 46}{space 3}0.021{col 54}{space 4}-14.04896{col 67}{space 3}-2.027685
{txt}{space 7}lag83 {c |}{col 14}{res}{space 2}  6.55637{col 26}{space 2}  3.07178{col 37}{space 1}    2.13{col 46}{space 3}0.100{col 54}{space 4}-1.972259{col 67}{space 3}   15.085
{txt}{space 7}lag84 {c |}{col 14}{res}{space 2} 2.992643{col 26}{space 2}  4.51451{col 37}{space 1}    0.66{col 46}{space 3}0.544{col 54}{space 4}-9.541645{col 67}{space 3} 15.52693
{txt}{space 7}lag85 {c |}{col 14}{res}{space 2} -4.62889{col 26}{space 2} 3.799797{col 37}{space 1}   -1.22{col 46}{space 3}0.290{col 54}{space 4}-15.17882{col 67}{space 3} 5.921038
{txt}{space 7}lag86 {c |}{col 14}{res}{space 2}-2.787327{col 26}{space 2} 4.187311{col 37}{space 1}   -0.67{col 46}{space 3}0.542{col 54}{space 4}-14.41317{col 67}{space 3} 8.838513
{txt}{space 7}lag87 {c |}{col 14}{res}{space 2}-2.152733{col 26}{space 2} 4.310513{col 37}{space 1}   -0.50{col 46}{space 3}0.644{col 54}{space 4}-14.12064{col 67}{space 3} 9.815171
{txt}{space 7}lag88 {c |}{col 14}{res}{space 2}-.6045908{col 26}{space 2} 3.466072{col 37}{space 1}   -0.17{col 46}{space 3}0.870{col 54}{space 4}-10.22795{col 67}{space 3} 9.018768
{txt}{space 7}lag89 {c |}{col 14}{res}{space 2} 3.870643{col 26}{space 2} 3.109215{col 37}{space 1}    1.24{col 46}{space 3}0.281{col 54}{space 4}-4.761922{col 67}{space 3} 12.50321
{txt}{space 7}lag90 {c |}{col 14}{res}{space 2} 3.270744{col 26}{space 2} 2.489332{col 37}{space 1}    1.31{col 46}{space 3}0.259{col 54}{space 4}-3.640749{col 67}{space 3} 10.18224
{txt}{space 7}lag91 {c |}{col 14}{res}{space 2}-1.811855{col 26}{space 2} 4.669791{col 37}{space 1}   -0.39{col 46}{space 3}0.718{col 54}{space 4}-14.77727{col 67}{space 3} 11.15356
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-165.7666{col 26}{space 2}  25.6964{col 37}{space 1}   -6.45{col 46}{space 3}0.003{col 54}{space 4}-237.1113{col 67}{space 3}-94.42199
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}   regionid1{col 14}{c |}{space 1}        5{col 27}{space 1}        5{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}        date{col 14}{c |}{space 1}     5267{col 27}{space 1}        1{col 39}{result}{space 1}     5266{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. graph export "results/EventStudy-MiddayElec.png", replace
{txt}{p 0 4 2}
file {bf}
results/EventStudy-MiddayElec.png{rm}
saved as
PNG
format
{p_end}

{com}. estat leads
{col 40}
{col 5}Joint significance test for leads
{hline 40}
F-stat:{col 25}   8.4864
P-value:{col 25}   0.0310
{hline 40}
Degrees of freedom{col 27}(4,4)
{hline 40}
{txt}
{com}. estat lags
{col 40}
{col 5}Joint significance test for lags
{hline 40}
F-stat:{col 25}   6.2627
P-value:{col 25}   0.0517
{hline 40}
Degrees of freedom{col 27}(4,4)
{hline 40}
{txt}
{com}. 
. /****************** 5. **Event Study by Transition Direction:*******************
> - Event studies for CO2 emissions in DDD design, separated by DST start and stop directions.
> - Results are exported to files.
> */
. 
. use "data/05-half-hourly.dta", clear
{txt}
{com}. gen timevar = .
{txt}(1,264,072 missing values generated)

{com}. replace timevar = days_into_dst if dst_here_anytime == 1
{txt}(1,011,256 real changes made)

{com}. drop if dst_start !=1 //DST start so only July to December direction
{txt}(614,512 observations deleted)

{com}. 
. eventdd co2_g_per_capita_vs_midday public_holiday c.temperature##c.temperature ///
> solar_exposure wind_3 [aweight = population], timevar(timevar) ///
> method(hdfe, absorb(regionid1 date) cluster(regionid1)) ///
> graph_op(ytitle("Co2 kg per capita") xtitle("Days until DST transition") ///
> title("Event Study - CO2 - Midday Normalised - DST Start Direction"))
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}{txt}warning: missing F statistic; dropped variables due to collinearity or too few clusters
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}   649,560
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F( 189,      4)}{col 67}=          {res}.
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.3259
{txt}{col 51}Adj R-squared{col 67}= {res}    0.3229
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0232
{txt}{col 1}Number of clusters ({res}regionid1{txt}) {col 30}= {res}         5{txt}{col 51}Root MSE{col 67}= {res}   58.6545

{txt}{ralign 78:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}co2_g_per_~y{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
public_hol~y {c |}{col 14}{res}{space 2} 11.64021{col 26}{space 2} 4.847418{col 37}{space 1}    2.40{col 46}{space 3}0.074{col 54}{space 4}-1.818381{col 67}{space 3}  25.0988
{txt}{space 1}temperature {c |}{col 14}{res}{space 2} 10.70686{col 26}{space 2} 1.866554{col 37}{space 1}    5.74{col 46}{space 3}0.005{col 54}{space 4} 5.524471{col 67}{space 3} 15.88924
{txt}{space 12} {c |}
{space 10}c. {c |}
{space 1}temperature#{c |}
{space 10}c. {c |}
{space 1}temperature {c |}{col 14}{res}{space 2}-.2261669{col 26}{space 2} .0331131{col 37}{space 1}   -6.83{col 46}{space 3}0.002{col 54}{space 4}-.3181035{col 67}{space 3}-.1342303
{txt}{space 12} {c |}
solar_expo~e {c |}{col 14}{res}{space 2} 3.647371{col 26}{space 2} .8459364{col 37}{space 1}    4.31{col 46}{space 3}0.013{col 54}{space 4} 1.298675{col 67}{space 3} 5.996067
{txt}{space 6}wind_3 {c |}{col 14}{res}{space 2}-2.698773{col 26}{space 2} 1.063939{col 37}{space 1}   -2.54{col 46}{space 3}0.064{col 54}{space 4}-5.652742{col 67}{space 3} .2551963
{txt}{space 6}lead94 {c |}{col 14}{res}{space 2} 19.77647{col 26}{space 2} 8.926557{col 37}{space 1}    2.22{col 46}{space 3}0.091{col 54}{space 4}-5.007626{col 67}{space 3} 44.56056
{txt}{space 6}lead93 {c |}{col 14}{res}{space 2} 8.680289{col 26}{space 2} 4.462566{col 37}{space 1}    1.95{col 46}{space 3}0.124{col 54}{space 4} -3.70978{col 67}{space 3} 21.07036
{txt}{space 6}lead92 {c |}{col 14}{res}{space 2}  18.5912{col 26}{space 2} 5.152826{col 37}{space 1}    3.61{col 46}{space 3}0.023{col 54}{space 4} 4.284658{col 67}{space 3} 32.89773
{txt}{space 6}lead91 {c |}{col 14}{res}{space 2} 9.598186{col 26}{space 2} 14.05361{col 37}{space 1}    0.68{col 46}{space 3}0.532{col 54}{space 4}-29.42089{col 67}{space 3} 48.61726
{txt}{space 6}lead90 {c |}{col 14}{res}{space 2} 9.357319{col 26}{space 2} 5.496943{col 37}{space 1}    1.70{col 46}{space 3}0.164{col 54}{space 4} -5.90464{col 67}{space 3} 24.61928
{txt}{space 6}lead89 {c |}{col 14}{res}{space 2} 10.87541{col 26}{space 2} 2.839888{col 37}{space 1}    3.83{col 46}{space 3}0.019{col 54}{space 4} 2.990616{col 67}{space 3}  18.7602
{txt}{space 6}lead88 {c |}{col 14}{res}{space 2} 11.32277{col 26}{space 2} 7.575995{col 37}{space 1}    1.49{col 46}{space 3}0.209{col 54}{space 4} -9.71156{col 67}{space 3} 32.35711
{txt}{space 6}lead87 {c |}{col 14}{res}{space 2} 10.23363{col 26}{space 2} 4.399072{col 37}{space 1}    2.33{col 46}{space 3}0.081{col 54}{space 4}-1.980152{col 67}{space 3} 22.44741
{txt}{space 6}lead86 {c |}{col 14}{res}{space 2}-1.270227{col 26}{space 2} 8.266149{col 37}{space 1}   -0.15{col 46}{space 3}0.885{col 54}{space 4}-24.22074{col 67}{space 3} 21.68028
{txt}{space 6}lead85 {c |}{col 14}{res}{space 2}-2.719321{col 26}{space 2} 11.66107{col 37}{space 1}   -0.23{col 46}{space 3}0.827{col 54}{space 4}-35.09565{col 67}{space 3} 29.65701
{txt}{space 6}lead84 {c |}{col 14}{res}{space 2} 6.049715{col 26}{space 2} 13.53704{col 37}{space 1}    0.45{col 46}{space 3}0.678{col 54}{space 4}-31.53513{col 67}{space 3} 43.63457
{txt}{space 6}lead83 {c |}{col 14}{res}{space 2}-.3944284{col 26}{space 2} 10.13596{col 37}{space 1}   -0.04{col 46}{space 3}0.971{col 54}{space 4}-28.53636{col 67}{space 3}  27.7475
{txt}{space 6}lead82 {c |}{col 14}{res}{space 2}-5.665496{col 26}{space 2} 9.093743{col 37}{space 1}   -0.62{col 46}{space 3}0.567{col 54}{space 4}-30.91378{col 67}{space 3} 19.58278
{txt}{space 6}lead81 {c |}{col 14}{res}{space 2}-2.802408{col 26}{space 2} 3.994681{col 37}{space 1}   -0.70{col 46}{space 3}0.522{col 54}{space 4}-13.89342{col 67}{space 3} 8.288606
{txt}{space 6}lead80 {c |}{col 14}{res}{space 2}-9.982913{col 26}{space 2} 11.33879{col 37}{space 1}   -0.88{col 46}{space 3}0.428{col 54}{space 4}-41.46443{col 67}{space 3}  21.4986
{txt}{space 6}lead79 {c |}{col 14}{res}{space 2}-3.546043{col 26}{space 2} 12.67528{col 37}{space 1}   -0.28{col 46}{space 3}0.794{col 54}{space 4}-38.73825{col 67}{space 3} 31.64616
{txt}{space 6}lead78 {c |}{col 14}{res}{space 2}  .980598{col 26}{space 2} 14.24091{col 37}{space 1}    0.07{col 46}{space 3}0.948{col 54}{space 4} -38.5585{col 67}{space 3}  40.5197
{txt}{space 6}lead77 {c |}{col 14}{res}{space 2} 10.26134{col 26}{space 2} 9.636749{col 37}{space 1}    1.06{col 46}{space 3}0.347{col 54}{space 4}-16.49457{col 67}{space 3} 37.01725
{txt}{space 6}lead76 {c |}{col 14}{res}{space 2} 1.276931{col 26}{space 2} 7.449542{col 37}{space 1}    0.17{col 46}{space 3}0.872{col 54}{space 4}-19.40631{col 67}{space 3} 21.96017
{txt}{space 6}lead75 {c |}{col 14}{res}{space 2} .1100698{col 26}{space 2} 12.64745{col 37}{space 1}    0.01{col 46}{space 3}0.993{col 54}{space 4}-35.00488{col 67}{space 3} 35.22502
{txt}{space 6}lead74 {c |}{col 14}{res}{space 2}  1.25596{col 26}{space 2} 11.90022{col 37}{space 1}    0.11{col 46}{space 3}0.921{col 54}{space 4}-31.78434{col 67}{space 3} 34.29626
{txt}{space 6}lead73 {c |}{col 14}{res}{space 2} 4.950662{col 26}{space 2} 7.666611{col 37}{space 1}    0.65{col 46}{space 3}0.554{col 54}{space 4}-16.33526{col 67}{space 3} 26.23659
{txt}{space 6}lead72 {c |}{col 14}{res}{space 2} 12.02695{col 26}{space 2} 12.06744{col 37}{space 1}    1.00{col 46}{space 3}0.375{col 54}{space 4}-21.47765{col 67}{space 3} 45.53155
{txt}{space 6}lead71 {c |}{col 14}{res}{space 2} 7.995716{col 26}{space 2} 9.957101{col 37}{space 1}    0.80{col 46}{space 3}0.467{col 54}{space 4}-19.64963{col 67}{space 3} 35.64106
{txt}{space 6}lead70 {c |}{col 14}{res}{space 2} 9.968264{col 26}{space 2} 8.528434{col 37}{space 1}    1.17{col 46}{space 3}0.307{col 54}{space 4}-13.71046{col 67}{space 3} 33.64699
{txt}{space 6}lead69 {c |}{col 14}{res}{space 2} 5.707144{col 26}{space 2} 12.76933{col 37}{space 1}    0.45{col 46}{space 3}0.678{col 54}{space 4}-29.74621{col 67}{space 3}  41.1605
{txt}{space 6}lead68 {c |}{col 14}{res}{space 2} 4.824656{col 26}{space 2} 17.83481{col 37}{space 1}    0.27{col 46}{space 3}0.800{col 54}{space 4}-44.69271{col 67}{space 3} 54.34202
{txt}{space 6}lead67 {c |}{col 14}{res}{space 2}-.9992997{col 26}{space 2} 19.08438{col 37}{space 1}   -0.05{col 46}{space 3}0.961{col 54}{space 4}-53.98604{col 67}{space 3} 51.98744
{txt}{space 6}lead66 {c |}{col 14}{res}{space 2} 5.305296{col 26}{space 2} 18.54089{col 37}{space 1}    0.29{col 46}{space 3}0.789{col 54}{space 4}-46.17247{col 67}{space 3} 56.78306
{txt}{space 6}lead65 {c |}{col 14}{res}{space 2}-.4485892{col 26}{space 2} 23.18464{col 37}{space 1}   -0.02{col 46}{space 3}0.985{col 54}{space 4}-64.81947{col 67}{space 3} 63.92229
{txt}{space 6}lead64 {c |}{col 14}{res}{space 2} 5.525947{col 26}{space 2} 13.07592{col 37}{space 1}    0.42{col 46}{space 3}0.694{col 54}{space 4}-30.77864{col 67}{space 3} 41.83053
{txt}{space 6}lead63 {c |}{col 14}{res}{space 2} 8.454648{col 26}{space 2} 9.228476{col 37}{space 1}    0.92{col 46}{space 3}0.411{col 54}{space 4}-17.16771{col 67}{space 3}   34.077
{txt}{space 6}lead62 {c |}{col 14}{res}{space 2} 6.460618{col 26}{space 2} 6.372952{col 37}{space 1}    1.01{col 46}{space 3}0.368{col 54}{space 4}-11.23353{col 67}{space 3} 24.15477
{txt}{space 6}lead61 {c |}{col 14}{res}{space 2} 7.458212{col 26}{space 2} 14.64797{col 37}{space 1}    0.51{col 46}{space 3}0.637{col 54}{space 4}-33.21107{col 67}{space 3}  48.1275
{txt}{space 6}lead60 {c |}{col 14}{res}{space 2} 6.177631{col 26}{space 2} 10.72679{col 37}{space 1}    0.58{col 46}{space 3}0.596{col 54}{space 4}-23.60472{col 67}{space 3} 35.95999
{txt}{space 6}lead59 {c |}{col 14}{res}{space 2}-1.568049{col 26}{space 2} 12.34187{col 37}{space 1}   -0.13{col 46}{space 3}0.905{col 54}{space 4}-35.83456{col 67}{space 3} 32.69847
{txt}{space 6}lead58 {c |}{col 14}{res}{space 2} 8.258973{col 26}{space 2} 12.12343{col 37}{space 1}    0.68{col 46}{space 3}0.533{col 54}{space 4}-25.40107{col 67}{space 3} 41.91902
{txt}{space 6}lead57 {c |}{col 14}{res}{space 2} 3.233775{col 26}{space 2} 9.375481{col 37}{space 1}    0.34{col 46}{space 3}0.748{col 54}{space 4}-22.79673{col 67}{space 3} 29.26428
{txt}{space 6}lead56 {c |}{col 14}{res}{space 2} 12.24833{col 26}{space 2} 6.462657{col 37}{space 1}    1.90{col 46}{space 3}0.131{col 54}{space 4}-5.694883{col 67}{space 3} 30.19154
{txt}{space 6}lead55 {c |}{col 14}{res}{space 2} 1.887606{col 26}{space 2} 10.94438{col 37}{space 1}    0.17{col 46}{space 3}0.871{col 54}{space 4}-28.49886{col 67}{space 3} 32.27407
{txt}{space 6}lead54 {c |}{col 14}{res}{space 2} 6.922481{col 26}{space 2} 12.40645{col 37}{space 1}    0.56{col 46}{space 3}0.607{col 54}{space 4}-27.52336{col 67}{space 3} 41.36832
{txt}{space 6}lead53 {c |}{col 14}{res}{space 2} 3.295952{col 26}{space 2} 10.05543{col 37}{space 1}    0.33{col 46}{space 3}0.760{col 54}{space 4} -24.6224{col 67}{space 3}  31.2143
{txt}{space 6}lead52 {c |}{col 14}{res}{space 2}  -1.1931{col 26}{space 2}  20.1531{col 37}{space 1}   -0.06{col 46}{space 3}0.956{col 54}{space 4}-57.14708{col 67}{space 3} 54.76088
{txt}{space 6}lead51 {c |}{col 14}{res}{space 2}-2.847134{col 26}{space 2} 9.604988{col 37}{space 1}   -0.30{col 46}{space 3}0.782{col 54}{space 4}-29.51485{col 67}{space 3} 23.82059
{txt}{space 6}lead50 {c |}{col 14}{res}{space 2} 5.709342{col 26}{space 2} 10.33133{col 37}{space 1}    0.55{col 46}{space 3}0.610{col 54}{space 4}-22.97503{col 67}{space 3} 34.39372
{txt}{space 6}lead49 {c |}{col 14}{res}{space 2}-1.778771{col 26}{space 2} 3.293672{col 37}{space 1}   -0.54{col 46}{space 3}0.618{col 54}{space 4}-10.92347{col 67}{space 3} 7.365929
{txt}{space 6}lead48 {c |}{col 14}{res}{space 2}-6.929336{col 26}{space 2} 10.95006{col 37}{space 1}   -0.63{col 46}{space 3}0.561{col 54}{space 4}-37.33157{col 67}{space 3}  23.4729
{txt}{space 6}lead47 {c |}{col 14}{res}{space 2}-1.813256{col 26}{space 2} 12.11392{col 37}{space 1}   -0.15{col 46}{space 3}0.888{col 54}{space 4} -35.4469{col 67}{space 3} 31.82039
{txt}{space 6}lead46 {c |}{col 14}{res}{space 2}   1.5873{col 26}{space 2} 14.20668{col 37}{space 1}    0.11{col 46}{space 3}0.916{col 54}{space 4}-37.85678{col 67}{space 3} 41.03138
{txt}{space 6}lead45 {c |}{col 14}{res}{space 2}-.0189655{col 26}{space 2} 11.39394{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4}-31.65362{col 67}{space 3} 31.61569
{txt}{space 6}lead44 {c |}{col 14}{res}{space 2} .1714791{col 26}{space 2}  13.1998{col 37}{space 1}    0.01{col 46}{space 3}0.990{col 54}{space 4}-36.47703{col 67}{space 3} 36.81999
{txt}{space 6}lead43 {c |}{col 14}{res}{space 2}   2.7908{col 26}{space 2} 7.345419{col 37}{space 1}    0.38{col 46}{space 3}0.723{col 54}{space 4}-17.60335{col 67}{space 3} 23.18495
{txt}{space 6}lead42 {c |}{col 14}{res}{space 2} 7.121024{col 26}{space 2} 3.241385{col 37}{space 1}    2.20{col 46}{space 3}0.093{col 54}{space 4}-1.878503{col 67}{space 3} 16.12055
{txt}{space 6}lead41 {c |}{col 14}{res}{space 2} 2.322111{col 26}{space 2} 8.111087{col 37}{space 1}    0.29{col 46}{space 3}0.789{col 54}{space 4}-20.19788{col 67}{space 3}  24.8421
{txt}{space 6}lead40 {c |}{col 14}{res}{space 2}-3.521453{col 26}{space 2} 8.323035{col 37}{space 1}   -0.42{col 46}{space 3}0.694{col 54}{space 4} -26.6299{col 67}{space 3}   19.587
{txt}{space 6}lead39 {c |}{col 14}{res}{space 2}-1.591621{col 26}{space 2} 12.37326{col 37}{space 1}   -0.13{col 46}{space 3}0.904{col 54}{space 4} -35.9453{col 67}{space 3} 32.76206
{txt}{space 6}lead38 {c |}{col 14}{res}{space 2}-.0691211{col 26}{space 2} 9.509876{col 37}{space 1}   -0.01{col 46}{space 3}0.995{col 54}{space 4}-26.47277{col 67}{space 3} 26.33453
{txt}{space 6}lead37 {c |}{col 14}{res}{space 2} 2.361826{col 26}{space 2} 9.897724{col 37}{space 1}    0.24{col 46}{space 3}0.823{col 54}{space 4}-25.11866{col 67}{space 3} 29.84231
{txt}{space 6}lead36 {c |}{col 14}{res}{space 2} 9.143043{col 26}{space 2} 7.662783{col 37}{space 1}    1.19{col 46}{space 3}0.299{col 54}{space 4}-12.13225{col 67}{space 3} 30.41834
{txt}{space 6}lead35 {c |}{col 14}{res}{space 2} 10.85139{col 26}{space 2}  8.19799{col 37}{space 1}    1.32{col 46}{space 3}0.256{col 54}{space 4}-11.90988{col 67}{space 3} 33.61266
{txt}{space 6}lead34 {c |}{col 14}{res}{space 2}-.8210956{col 26}{space 2} 7.750721{col 37}{space 1}   -0.11{col 46}{space 3}0.921{col 54}{space 4}-22.34055{col 67}{space 3} 20.69836
{txt}{space 6}lead33 {c |}{col 14}{res}{space 2} 4.038172{col 26}{space 2} 10.90031{col 37}{space 1}    0.37{col 46}{space 3}0.730{col 54}{space 4}-26.22594{col 67}{space 3} 34.30228
{txt}{space 6}lead32 {c |}{col 14}{res}{space 2} 2.695142{col 26}{space 2} 10.99103{col 37}{space 1}    0.25{col 46}{space 3}0.818{col 54}{space 4}-27.82086{col 67}{space 3} 33.21114
{txt}{space 6}lead31 {c |}{col 14}{res}{space 2}-.8670301{col 26}{space 2} 7.591691{col 37}{space 1}   -0.11{col 46}{space 3}0.915{col 54}{space 4}-21.94494{col 67}{space 3} 20.21088
{txt}{space 6}lead30 {c |}{col 14}{res}{space 2} 4.552627{col 26}{space 2} 6.732971{col 37}{space 1}    0.68{col 46}{space 3}0.536{col 54}{space 4} -14.1411{col 67}{space 3} 23.24635
{txt}{space 6}lead29 {c |}{col 14}{res}{space 2}  10.5319{col 26}{space 2} 4.640139{col 37}{space 1}    2.27{col 46}{space 3}0.086{col 54}{space 4}-2.351189{col 67}{space 3} 23.41499
{txt}{space 6}lead28 {c |}{col 14}{res}{space 2} 4.276686{col 26}{space 2} 5.490239{col 37}{space 1}    0.78{col 46}{space 3}0.480{col 54}{space 4}-10.96666{col 67}{space 3} 19.52003
{txt}{space 6}lead27 {c |}{col 14}{res}{space 2} .0164363{col 26}{space 2} 9.200469{col 37}{space 1}    0.00{col 46}{space 3}0.999{col 54}{space 4}-25.52816{col 67}{space 3} 25.56103
{txt}{space 6}lead26 {c |}{col 14}{res}{space 2} 3.247082{col 26}{space 2} 8.001964{col 37}{space 1}    0.41{col 46}{space 3}0.706{col 54}{space 4}-18.96993{col 67}{space 3}  25.4641
{txt}{space 6}lead25 {c |}{col 14}{res}{space 2}-3.790815{col 26}{space 2}   10.864{col 37}{space 1}   -0.35{col 46}{space 3}0.745{col 54}{space 4}-33.95413{col 67}{space 3}  26.3725
{txt}{space 6}lead24 {c |}{col 14}{res}{space 2} -1.79028{col 26}{space 2} 9.417453{col 37}{space 1}   -0.19{col 46}{space 3}0.858{col 54}{space 4}-27.93732{col 67}{space 3} 24.35676
{txt}{space 6}lead23 {c |}{col 14}{res}{space 2} 4.837809{col 26}{space 2} 10.72758{col 37}{space 1}    0.45{col 46}{space 3}0.675{col 54}{space 4}-24.94672{col 67}{space 3} 34.62234
{txt}{space 6}lead22 {c |}{col 14}{res}{space 2} -3.12453{col 26}{space 2} 10.41535{col 37}{space 1}   -0.30{col 46}{space 3}0.779{col 54}{space 4}-32.04217{col 67}{space 3}  25.7931
{txt}{space 6}lead21 {c |}{col 14}{res}{space 2} 5.289346{col 26}{space 2} 5.225858{col 37}{space 1}    1.01{col 46}{space 3}0.369{col 54}{space 4} -9.21996{col 67}{space 3} 19.79865
{txt}{space 6}lead20 {c |}{col 14}{res}{space 2} 8.598603{col 26}{space 2} 3.870808{col 37}{space 1}    2.22{col 46}{space 3}0.090{col 54}{space 4}-2.148482{col 67}{space 3} 19.34569
{txt}{space 6}lead19 {c |}{col 14}{res}{space 2}-.5167203{col 26}{space 2} 9.207528{col 37}{space 1}   -0.06{col 46}{space 3}0.958{col 54}{space 4}-26.08092{col 67}{space 3} 25.04748
{txt}{space 6}lead18 {c |}{col 14}{res}{space 2} 10.36149{col 26}{space 2} 5.355956{col 37}{space 1}    1.93{col 46}{space 3}0.125{col 54}{space 4}-4.509027{col 67}{space 3} 25.23201
{txt}{space 6}lead17 {c |}{col 14}{res}{space 2} 6.633597{col 26}{space 2} 5.565888{col 37}{space 1}    1.19{col 46}{space 3}0.299{col 54}{space 4}-8.819785{col 67}{space 3} 22.08698
{txt}{space 6}lead16 {c |}{col 14}{res}{space 2} 2.762124{col 26}{space 2} 6.217438{col 37}{space 1}    0.44{col 46}{space 3}0.680{col 54}{space 4}-14.50025{col 67}{space 3}  20.0245
{txt}{space 6}lead15 {c |}{col 14}{res}{space 2}-5.561183{col 26}{space 2} 3.242015{col 37}{space 1}   -1.72{col 46}{space 3}0.161{col 54}{space 4}-14.56246{col 67}{space 3} 3.440095
{txt}{space 6}lead14 {c |}{col 14}{res}{space 2}-5.213218{col 26}{space 2} 3.780674{col 37}{space 1}   -1.38{col 46}{space 3}0.240{col 54}{space 4}-15.71005{col 67}{space 3} 5.283617
{txt}{space 6}lead13 {c |}{col 14}{res}{space 2} .9555804{col 26}{space 2} 3.286842{col 37}{space 1}    0.29{col 46}{space 3}0.786{col 54}{space 4}-8.170157{col 67}{space 3} 10.08132
{txt}{space 6}lead12 {c |}{col 14}{res}{space 2} .4775549{col 26}{space 2} 4.540614{col 37}{space 1}    0.11{col 46}{space 3}0.921{col 54}{space 4}-12.12921{col 67}{space 3} 13.08432
{txt}{space 6}lead11 {c |}{col 14}{res}{space 2} .3379172{col 26}{space 2} 4.375695{col 37}{space 1}    0.08{col 46}{space 3}0.942{col 54}{space 4}-11.81096{col 67}{space 3} 12.48679
{txt}{space 6}lead10 {c |}{col 14}{res}{space 2}-3.064151{col 26}{space 2}  5.56294{col 37}{space 1}   -0.55{col 46}{space 3}0.611{col 54}{space 4}-18.50935{col 67}{space 3} 12.38105
{txt}{space 7}lead9 {c |}{col 14}{res}{space 2} 2.301179{col 26}{space 2} 3.787109{col 37}{space 1}    0.61{col 46}{space 3}0.576{col 54}{space 4}-8.213521{col 67}{space 3} 12.81588
{txt}{space 7}lead8 {c |}{col 14}{res}{space 2} 5.531175{col 26}{space 2} 3.739387{col 37}{space 1}    1.48{col 46}{space 3}0.213{col 54}{space 4}-4.851027{col 67}{space 3} 15.91338
{txt}{space 7}lead7 {c |}{col 14}{res}{space 2} 7.332168{col 26}{space 2} 2.452832{col 37}{space 1}    2.99{col 46}{space 3}0.040{col 54}{space 4} .5220136{col 67}{space 3} 14.14232
{txt}{space 7}lead6 {c |}{col 14}{res}{space 2}-2.259018{col 26}{space 2} 3.756602{col 37}{space 1}   -0.60{col 46}{space 3}0.580{col 54}{space 4}-12.68902{col 67}{space 3} 8.170982
{txt}{space 7}lead5 {c |}{col 14}{res}{space 2}-5.152839{col 26}{space 2} 6.145534{col 37}{space 1}   -0.84{col 46}{space 3}0.449{col 54}{space 4}-22.21558{col 67}{space 3}  11.9099
{txt}{space 7}lead4 {c |}{col 14}{res}{space 2} 1.670013{col 26}{space 2} 2.112525{col 37}{space 1}    0.79{col 46}{space 3}0.473{col 54}{space 4}-4.195297{col 67}{space 3} 7.535323
{txt}{space 7}lead3 {c |}{col 14}{res}{space 2} 5.179276{col 26}{space 2} 4.388642{col 37}{space 1}    1.18{col 46}{space 3}0.303{col 54}{space 4}-7.005547{col 67}{space 3}  17.3641
{txt}{space 7}lead2 {c |}{col 14}{res}{space 2} 3.070311{col 26}{space 2} 3.938597{col 37}{space 1}    0.78{col 46}{space 3}0.479{col 54}{space 4}-7.864988{col 67}{space 3} 14.00561
{txt}{space 8}lag0 {c |}{col 14}{res}{space 2} 1.012077{col 26}{space 2} 3.198156{col 37}{space 1}    0.32{col 46}{space 3}0.767{col 54}{space 4}-7.867429{col 67}{space 3} 9.891582
{txt}{space 8}lag1 {c |}{col 14}{res}{space 2}-1.790321{col 26}{space 2} 7.563567{col 37}{space 1}   -0.24{col 46}{space 3}0.825{col 54}{space 4}-22.79015{col 67}{space 3} 19.20951
{txt}{space 8}lag2 {c |}{col 14}{res}{space 2} .2655762{col 26}{space 2}  6.52964{col 37}{space 1}    0.04{col 46}{space 3}0.970{col 54}{space 4}-17.86361{col 67}{space 3} 18.39476
{txt}{space 8}lag3 {c |}{col 14}{res}{space 2}-8.607293{col 26}{space 2} 3.313625{col 37}{space 1}   -2.60{col 46}{space 3}0.060{col 54}{space 4}-17.80739{col 67}{space 3} .5928056
{txt}{space 8}lag4 {c |}{col 14}{res}{space 2} 5.683617{col 26}{space 2} 4.247557{col 37}{space 1}    1.34{col 46}{space 3}0.252{col 54}{space 4}-6.109493{col 67}{space 3} 17.47673
{txt}{space 8}lag5 {c |}{col 14}{res}{space 2} .7912896{col 26}{space 2} 4.632691{col 37}{space 1}    0.17{col 46}{space 3}0.873{col 54}{space 4}-12.07112{col 67}{space 3}  13.6537
{txt}{space 8}lag6 {c |}{col 14}{res}{space 2} 4.956617{col 26}{space 2} 4.375392{col 37}{space 1}    1.13{col 46}{space 3}0.321{col 54}{space 4}-7.191417{col 67}{space 3} 17.10465
{txt}{space 8}lag7 {c |}{col 14}{res}{space 2} 5.563011{col 26}{space 2} 1.003159{col 37}{space 1}    5.55{col 46}{space 3}0.005{col 54}{space 4} 2.777796{col 67}{space 3} 8.348227
{txt}{space 8}lag8 {c |}{col 14}{res}{space 2} 9.861993{col 26}{space 2} 2.291362{col 37}{space 1}    4.30{col 46}{space 3}0.013{col 54}{space 4} 3.500152{col 67}{space 3} 16.22383
{txt}{space 8}lag9 {c |}{col 14}{res}{space 2}  12.4079{col 26}{space 2}  1.07915{col 37}{space 1}   11.50{col 46}{space 3}0.000{col 54}{space 4} 9.411698{col 67}{space 3}  15.4041
{txt}{space 7}lag10 {c |}{col 14}{res}{space 2} 8.571385{col 26}{space 2} .7949932{col 37}{space 1}   10.78{col 46}{space 3}0.000{col 54}{space 4}  6.36413{col 67}{space 3} 10.77864
{txt}{space 7}lag11 {c |}{col 14}{res}{space 2} .4797577{col 26}{space 2} 5.701105{col 37}{space 1}    0.08{col 46}{space 3}0.937{col 54}{space 4}-15.34905{col 67}{space 3} 16.30856
{txt}{space 7}lag12 {c |}{col 14}{res}{space 2} 11.03561{col 26}{space 2} 2.872426{col 37}{space 1}    3.84{col 46}{space 3}0.018{col 54}{space 4} 3.060482{col 67}{space 3} 19.01075
{txt}{space 7}lag13 {c |}{col 14}{res}{space 2} 8.157955{col 26}{space 2} 2.459682{col 37}{space 1}    3.32{col 46}{space 3}0.029{col 54}{space 4} 1.328784{col 67}{space 3} 14.98713
{txt}{space 7}lag14 {c |}{col 14}{res}{space 2} 7.472192{col 26}{space 2} 3.761491{col 37}{space 1}    1.99{col 46}{space 3}0.118{col 54}{space 4} -2.97138{col 67}{space 3} 17.91576
{txt}{space 7}lag15 {c |}{col 14}{res}{space 2} 7.017763{col 26}{space 2} 4.221444{col 37}{space 1}    1.66{col 46}{space 3}0.172{col 54}{space 4}-4.702843{col 67}{space 3} 18.73837
{txt}{space 7}lag16 {c |}{col 14}{res}{space 2} 3.903735{col 26}{space 2} 7.304745{col 37}{space 1}    0.53{col 46}{space 3}0.621{col 54}{space 4}-16.37749{col 67}{space 3} 24.18496
{txt}{space 7}lag17 {c |}{col 14}{res}{space 2} 13.10266{col 26}{space 2}  6.67991{col 37}{space 1}    1.96{col 46}{space 3}0.121{col 54}{space 4}-5.443745{col 67}{space 3} 31.64906
{txt}{space 7}lag18 {c |}{col 14}{res}{space 2} 4.936724{col 26}{space 2} 2.460108{col 37}{space 1}    2.01{col 46}{space 3}0.115{col 54}{space 4}-1.893633{col 67}{space 3} 11.76708
{txt}{space 7}lag19 {c |}{col 14}{res}{space 2} .4020654{col 26}{space 2}  1.01611{col 37}{space 1}    0.40{col 46}{space 3}0.713{col 54}{space 4}-2.419109{col 67}{space 3}  3.22324
{txt}{space 7}lag20 {c |}{col 14}{res}{space 2} 4.841093{col 26}{space 2} 2.990885{col 37}{space 1}    1.62{col 46}{space 3}0.181{col 54}{space 4}-3.462934{col 67}{space 3} 13.14512
{txt}{space 7}lag21 {c |}{col 14}{res}{space 2}-.2522444{col 26}{space 2} 2.639528{col 37}{space 1}   -0.10{col 46}{space 3}0.928{col 54}{space 4}-7.580749{col 67}{space 3}  7.07626
{txt}{space 7}lag22 {c |}{col 14}{res}{space 2} .4071801{col 26}{space 2} 2.881028{col 37}{space 1}    0.14{col 46}{space 3}0.894{col 54}{space 4}-7.591835{col 67}{space 3} 8.406195
{txt}{space 7}lag23 {c |}{col 14}{res}{space 2} 1.192647{col 26}{space 2} 4.564477{col 37}{space 1}    0.26{col 46}{space 3}0.807{col 54}{space 4}-11.48037{col 67}{space 3} 13.86567
{txt}{space 7}lag24 {c |}{col 14}{res}{space 2}  5.47019{col 26}{space 2} 5.029704{col 37}{space 1}    1.09{col 46}{space 3}0.338{col 54}{space 4}-8.494506{col 67}{space 3} 19.43489
{txt}{space 7}lag25 {c |}{col 14}{res}{space 2} 6.702044{col 26}{space 2} 4.452451{col 37}{space 1}    1.51{col 46}{space 3}0.207{col 54}{space 4}-5.659941{col 67}{space 3} 19.06403
{txt}{space 7}lag26 {c |}{col 14}{res}{space 2} 4.936149{col 26}{space 2} 3.520091{col 37}{space 1}    1.40{col 46}{space 3}0.233{col 54}{space 4}-4.837189{col 67}{space 3} 14.70949
{txt}{space 7}lag27 {c |}{col 14}{res}{space 2}-2.964578{col 26}{space 2} 1.358451{col 37}{space 1}   -2.18{col 46}{space 3}0.094{col 54}{space 4}-6.736241{col 67}{space 3} .8070862
{txt}{space 7}lag28 {c |}{col 14}{res}{space 2} 6.556962{col 26}{space 2} 1.867802{col 37}{space 1}    3.51{col 46}{space 3}0.025{col 54}{space 4} 1.371113{col 67}{space 3} 11.74281
{txt}{space 7}lag29 {c |}{col 14}{res}{space 2} 15.21753{col 26}{space 2} 2.471779{col 37}{space 1}    6.16{col 46}{space 3}0.004{col 54}{space 4}  8.35477{col 67}{space 3} 22.08029
{txt}{space 7}lag30 {c |}{col 14}{res}{space 2}-.3662912{col 26}{space 2} 3.056119{col 37}{space 1}   -0.12{col 46}{space 3}0.910{col 54}{space 4}-8.851438{col 67}{space 3} 8.118856
{txt}{space 7}lag31 {c |}{col 14}{res}{space 2} 2.782317{col 26}{space 2} 3.637476{col 37}{space 1}    0.76{col 46}{space 3}0.487{col 54}{space 4}-7.316937{col 67}{space 3} 12.88157
{txt}{space 7}lag32 {c |}{col 14}{res}{space 2} .9127518{col 26}{space 2} 2.134875{col 37}{space 1}    0.43{col 46}{space 3}0.691{col 54}{space 4}-5.014611{col 67}{space 3} 6.840115
{txt}{space 7}lag33 {c |}{col 14}{res}{space 2} 4.229889{col 26}{space 2}  1.77302{col 37}{space 1}    2.39{col 46}{space 3}0.076{col 54}{space 4}-.6928037{col 67}{space 3} 9.152581
{txt}{space 7}lag34 {c |}{col 14}{res}{space 2}-6.144598{col 26}{space 2} 5.599812{col 37}{space 1}   -1.10{col 46}{space 3}0.334{col 54}{space 4}-21.69217{col 67}{space 3} 9.402974
{txt}{space 7}lag35 {c |}{col 14}{res}{space 2}-2.443533{col 26}{space 2} 1.779041{col 37}{space 1}   -1.37{col 46}{space 3}0.242{col 54}{space 4}-7.382943{col 67}{space 3} 2.495877
{txt}{space 7}lag36 {c |}{col 14}{res}{space 2} 8.002976{col 26}{space 2} 2.035585{col 37}{space 1}    3.93{col 46}{space 3}0.017{col 54}{space 4} 2.351285{col 67}{space 3} 13.65467
{txt}{space 7}lag37 {c |}{col 14}{res}{space 2} 14.99264{col 26}{space 2} 3.903869{col 37}{space 1}    3.84{col 46}{space 3}0.018{col 54}{space 4} 4.153763{col 67}{space 3} 25.83152
{txt}{space 7}lag38 {c |}{col 14}{res}{space 2}-.6914045{col 26}{space 2}  7.98269{col 37}{space 1}   -0.09{col 46}{space 3}0.935{col 54}{space 4}-22.85491{col 67}{space 3}  21.4721
{txt}{space 7}lag39 {c |}{col 14}{res}{space 2} -2.39332{col 26}{space 2} 2.952522{col 37}{space 1}   -0.81{col 46}{space 3}0.463{col 54}{space 4}-10.59084{col 67}{space 3} 5.804197
{txt}{space 7}lag40 {c |}{col 14}{res}{space 2}-3.879626{col 26}{space 2} 1.674388{col 37}{space 1}   -2.32{col 46}{space 3}0.081{col 54}{space 4}-8.528471{col 67}{space 3} .7692193
{txt}{space 7}lag41 {c |}{col 14}{res}{space 2} .0907079{col 26}{space 2} 4.665888{col 37}{space 1}    0.02{col 46}{space 3}0.985{col 54}{space 4}-12.86387{col 67}{space 3} 13.04529
{txt}{space 7}lag42 {c |}{col 14}{res}{space 2}-6.046045{col 26}{space 2} 5.256725{col 37}{space 1}   -1.15{col 46}{space 3}0.314{col 54}{space 4}-20.64105{col 67}{space 3} 8.548964
{txt}{space 7}lag43 {c |}{col 14}{res}{space 2}-.6600645{col 26}{space 2} 2.268173{col 37}{space 1}   -0.29{col 46}{space 3}0.786{col 54}{space 4}-6.957522{col 67}{space 3} 5.637393
{txt}{space 7}lag44 {c |}{col 14}{res}{space 2}-2.398269{col 26}{space 2} 5.891133{col 37}{space 1}   -0.41{col 46}{space 3}0.705{col 54}{space 4}-18.75468{col 67}{space 3} 13.95814
{txt}{space 7}lag45 {c |}{col 14}{res}{space 2} 6.373094{col 26}{space 2} 3.819989{col 37}{space 1}    1.67{col 46}{space 3}0.171{col 54}{space 4}-4.232896{col 67}{space 3} 16.97908
{txt}{space 7}lag46 {c |}{col 14}{res}{space 2} 8.199362{col 26}{space 2} 3.337285{col 37}{space 1}    2.46{col 46}{space 3}0.070{col 54}{space 4}-1.066427{col 67}{space 3} 17.46515
{txt}{space 7}lag47 {c |}{col 14}{res}{space 2} 9.300654{col 26}{space 2} 2.055983{col 37}{space 1}    4.52{col 46}{space 3}0.011{col 54}{space 4}  3.59233{col 67}{space 3} 15.00898
{txt}{space 7}lag48 {c |}{col 14}{res}{space 2}-6.464693{col 26}{space 2} 5.644986{col 37}{space 1}   -1.15{col 46}{space 3}0.316{col 54}{space 4}-22.13769{col 67}{space 3} 9.208302
{txt}{space 7}lag49 {c |}{col 14}{res}{space 2}-1.523256{col 26}{space 2}  1.20794{col 37}{space 1}   -1.26{col 46}{space 3}0.276{col 54}{space 4}-4.877035{col 67}{space 3} 1.830523
{txt}{space 7}lag50 {c |}{col 14}{res}{space 2}-8.821549{col 26}{space 2} 3.486451{col 37}{space 1}   -2.53{col 46}{space 3}0.065{col 54}{space 4}-18.50149{col 67}{space 3} .8583918
{txt}{space 7}lag51 {c |}{col 14}{res}{space 2}-8.169592{col 26}{space 2} 1.788366{col 37}{space 1}   -4.57{col 46}{space 3}0.010{col 54}{space 4}-13.13489{col 67}{space 3}-3.204292
{txt}{space 7}lag52 {c |}{col 14}{res}{space 2} 4.864642{col 26}{space 2}    2.939{col 37}{space 1}    1.66{col 46}{space 3}0.173{col 54}{space 4}-3.295332{col 67}{space 3} 13.02462
{txt}{space 7}lag53 {c |}{col 14}{res}{space 2}-2.697853{col 26}{space 2}  3.06731{col 37}{space 1}   -0.88{col 46}{space 3}0.429{col 54}{space 4}-11.21407{col 67}{space 3} 5.818364
{txt}{space 7}lag54 {c |}{col 14}{res}{space 2} 5.393077{col 26}{space 2} 2.700068{col 37}{space 1}    2.00{col 46}{space 3}0.116{col 54}{space 4}-2.103515{col 67}{space 3} 12.88967
{txt}{space 7}lag55 {c |}{col 14}{res}{space 2}-4.339128{col 26}{space 2} 2.510342{col 37}{space 1}   -1.73{col 46}{space 3}0.159{col 54}{space 4}-11.30895{col 67}{space 3} 2.630699
{txt}{space 7}lag56 {c |}{col 14}{res}{space 2} 12.42936{col 26}{space 2} 2.887807{col 37}{space 1}    4.30{col 46}{space 3}0.013{col 54}{space 4} 4.411521{col 67}{space 3} 20.44719
{txt}{space 7}lag57 {c |}{col 14}{res}{space 2}-.5210289{col 26}{space 2} 3.317034{col 37}{space 1}   -0.16{col 46}{space 3}0.883{col 54}{space 4}-9.730592{col 67}{space 3} 8.688534
{txt}{space 7}lag58 {c |}{col 14}{res}{space 2} .2849555{col 26}{space 2} 2.267439{col 37}{space 1}    0.13{col 46}{space 3}0.906{col 54}{space 4}-6.010464{col 67}{space 3} 6.580376
{txt}{space 7}lag59 {c |}{col 14}{res}{space 2} 3.992004{col 26}{space 2} 1.163628{col 37}{space 1}    3.43{col 46}{space 3}0.027{col 54}{space 4} .7612538{col 67}{space 3} 7.222755
{txt}{space 7}lag60 {c |}{col 14}{res}{space 2} .1155109{col 26}{space 2} 3.167457{col 37}{space 1}    0.04{col 46}{space 3}0.973{col 54}{space 4}-8.678759{col 67}{space 3} 8.909781
{txt}{space 7}lag61 {c |}{col 14}{res}{space 2}-4.258944{col 26}{space 2} 4.131719{col 37}{space 1}   -1.03{col 46}{space 3}0.361{col 54}{space 4}-15.73044{col 67}{space 3} 7.212547
{txt}{space 7}lag62 {c |}{col 14}{res}{space 2}  1.58622{col 26}{space 2} 2.449277{col 37}{space 1}    0.65{col 46}{space 3}0.553{col 54}{space 4}-5.214063{col 67}{space 3} 8.386503
{txt}{space 7}lag63 {c |}{col 14}{res}{space 2}-1.580501{col 26}{space 2} 3.174381{col 37}{space 1}   -0.50{col 46}{space 3}0.645{col 54}{space 4}  -10.394{col 67}{space 3} 7.232994
{txt}{space 7}lag64 {c |}{col 14}{res}{space 2} 1.112074{col 26}{space 2} 3.940181{col 37}{space 1}    0.28{col 46}{space 3}0.792{col 54}{space 4}-9.827623{col 67}{space 3} 12.05177
{txt}{space 7}lag65 {c |}{col 14}{res}{space 2}-10.14312{col 26}{space 2}    3.015{col 37}{space 1}   -3.36{col 46}{space 3}0.028{col 54}{space 4} -18.5141{col 67}{space 3}-1.772141
{txt}{space 7}lag66 {c |}{col 14}{res}{space 2} 4.664798{col 26}{space 2} 6.986112{col 37}{space 1}    0.67{col 46}{space 3}0.541{col 54}{space 4}-14.73176{col 67}{space 3} 24.06135
{txt}{space 7}lag67 {c |}{col 14}{res}{space 2} 3.959509{col 26}{space 2} 7.000049{col 37}{space 1}    0.57{col 46}{space 3}0.602{col 54}{space 4}-15.47574{col 67}{space 3} 23.39476
{txt}{space 7}lag68 {c |}{col 14}{res}{space 2} 7.550196{col 26}{space 2}   5.9577{col 37}{space 1}    1.27{col 46}{space 3}0.274{col 54}{space 4} -8.99103{col 67}{space 3} 24.09142
{txt}{space 7}lag69 {c |}{col 14}{res}{space 2}-3.820964{col 26}{space 2} 4.186268{col 37}{space 1}   -0.91{col 46}{space 3}0.413{col 54}{space 4}-15.44391{col 67}{space 3} 7.801981
{txt}{space 7}lag70 {c |}{col 14}{res}{space 2}-5.018491{col 26}{space 2} 4.799597{col 37}{space 1}   -1.05{col 46}{space 3}0.355{col 54}{space 4}-18.34431{col 67}{space 3} 8.307326
{txt}{space 7}lag71 {c |}{col 14}{res}{space 2}-5.806671{col 26}{space 2} 4.019133{col 37}{space 1}   -1.44{col 46}{space 3}0.222{col 54}{space 4}-16.96557{col 67}{space 3} 5.352231
{txt}{space 7}lag72 {c |}{col 14}{res}{space 2}-3.353546{col 26}{space 2} 3.044002{col 37}{space 1}   -1.10{col 46}{space 3}0.332{col 54}{space 4}-11.80505{col 67}{space 3} 5.097959
{txt}{space 7}lag73 {c |}{col 14}{res}{space 2}-3.954445{col 26}{space 2} 2.544296{col 37}{space 1}   -1.55{col 46}{space 3}0.195{col 54}{space 4}-11.01854{col 67}{space 3} 3.109652
{txt}{space 7}lag74 {c |}{col 14}{res}{space 2}-1.981393{col 26}{space 2} 3.528415{col 37}{space 1}   -0.56{col 46}{space 3}0.604{col 54}{space 4}-11.77784{col 67}{space 3} 7.815057
{txt}{space 7}lag75 {c |}{col 14}{res}{space 2} 2.951178{col 26}{space 2} 3.302448{col 37}{space 1}    0.89{col 46}{space 3}0.422{col 54}{space 4}-6.217887{col 67}{space 3} 12.12024
{txt}{space 7}lag76 {c |}{col 14}{res}{space 2}  -5.1121{col 26}{space 2} 3.374999{col 37}{space 1}   -1.51{col 46}{space 3}0.204{col 54}{space 4} -14.4826{col 67}{space 3}   4.2584
{txt}{space 7}lag77 {c |}{col 14}{res}{space 2}-8.990214{col 26}{space 2} 2.240663{col 37}{space 1}   -4.01{col 46}{space 3}0.016{col 54}{space 4}-15.21129{col 67}{space 3}-2.769135
{txt}{space 7}lag78 {c |}{col 14}{res}{space 2} .6196508{col 26}{space 2} 8.580092{col 37}{space 1}    0.07{col 46}{space 3}0.946{col 54}{space 4} -23.2025{col 67}{space 3} 24.44181
{txt}{space 7}lag79 {c |}{col 14}{res}{space 2}-2.693787{col 26}{space 2} 3.420386{col 37}{space 1}   -0.79{col 46}{space 3}0.475{col 54}{space 4} -12.1903{col 67}{space 3} 6.802727
{txt}{space 7}lag80 {c |}{col 14}{res}{space 2}-.5909134{col 26}{space 2} 2.379983{col 37}{space 1}   -0.25{col 46}{space 3}0.816{col 54}{space 4}-7.198806{col 67}{space 3} 6.016979
{txt}{space 7}lag81 {c |}{col 14}{res}{space 2} 3.516099{col 26}{space 2} 3.722524{col 37}{space 1}    0.94{col 46}{space 3}0.398{col 54}{space 4}-6.819285{col 67}{space 3} 13.85148
{txt}{space 7}lag82 {c |}{col 14}{res}{space 2}-2.243623{col 26}{space 2} 3.053835{col 37}{space 1}   -0.73{col 46}{space 3}0.503{col 54}{space 4}-10.72243{col 67}{space 3} 6.235182
{txt}{space 7}lag83 {c |}{col 14}{res}{space 2} 12.40495{col 26}{space 2} 2.027974{col 37}{space 1}    6.12{col 46}{space 3}0.004{col 54}{space 4} 6.774389{col 67}{space 3} 18.03551
{txt}{space 7}lag84 {c |}{col 14}{res}{space 2} 4.524338{col 26}{space 2} 2.179631{col 37}{space 1}    2.08{col 46}{space 3}0.107{col 54}{space 4}-1.527287{col 67}{space 3} 10.57596
{txt}{space 7}lag85 {c |}{col 14}{res}{space 2}-5.207247{col 26}{space 2} 4.163976{col 37}{space 1}   -1.25{col 46}{space 3}0.279{col 54}{space 4} -16.7683{col 67}{space 3} 6.353805
{txt}{space 7}lag86 {c |}{col 14}{res}{space 2}-7.293138{col 26}{space 2} 4.001403{col 37}{space 1}   -1.82{col 46}{space 3}0.142{col 54}{space 4}-18.40281{col 67}{space 3} 3.816538
{txt}{space 7}lag87 {c |}{col 14}{res}{space 2}-2.090393{col 26}{space 2} 7.073297{col 37}{space 1}   -0.30{col 46}{space 3}0.782{col 54}{space 4}-21.72901{col 67}{space 3} 17.54823
{txt}{space 7}lag88 {c |}{col 14}{res}{space 2} -4.57535{col 26}{space 2} 4.160925{col 37}{space 1}   -1.10{col 46}{space 3}0.333{col 54}{space 4}-16.12793{col 67}{space 3} 6.977229
{txt}{space 7}lag89 {c |}{col 14}{res}{space 2} 10.53939{col 26}{space 2} 5.354539{col 37}{space 1}    1.97{col 46}{space 3}0.120{col 54}{space 4}-4.327189{col 67}{space 3} 25.40598
{txt}{space 7}lag90 {c |}{col 14}{res}{space 2}-2.106365{col 26}{space 2} 3.774148{col 37}{space 1}   -0.56{col 46}{space 3}0.607{col 54}{space 4}-12.58508{col 67}{space 3} 8.372351
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-128.6648{col 26}{space 2} 28.66336{col 37}{space 1}   -4.49{col 46}{space 3}0.011{col 54}{space 4}-208.2471{col 67}{space 3}-49.08257
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}   regionid1{col 14}{c |}{space 1}        5{col 27}{space 1}        5{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}        date{col 14}{c |}{space 1}     2707{col 27}{space 1}        1{col 39}{result}{space 1}     2706{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. graph export "results/EventStudy-MiddayCO2-DST-Start.png", replace
{txt}{p 0 4 2}
file {bf}
results/EventStudy-MiddayCO2-DST-Start.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. use "data/05-half-hourly.dta", clear
{txt}
{com}. gen timevar = .
{txt}(1,264,072 missing values generated)

{com}. replace timevar = days_into_dst if dst_here_anytime == 1
{txt}(1,011,256 real changes made)

{com}. drop if dst_start !=0 //DST stop so only January to June direction
{txt}(649,560 observations deleted)

{com}. 
. eventdd co2_g_per_capita_vs_midday public_holiday c.temperature##c.temperature ///
>  solar_exposure wind_3 [aweight = population], timevar(timevar) /// 
>  method(hdfe, absorb(regionid1 date) cluster(regionid1)) /// 
>  graph_op(ytitle("Co2 kg per capita") xtitle("Days until DST transition") ///
>  title("Event Study - CO2 - Midday Normalised - DST Stop Direction"))
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}{txt}warning: missing F statistic; dropped variables due to collinearity or too few clusters
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}   614,512
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F( 190,      4)}{col 67}=          {res}.
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.2962
{txt}{col 51}Adj R-squared{col 67}= {res}    0.2931
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0246
{txt}{col 1}Number of clusters ({res}regionid1{txt}) {col 30}= {res}         5{txt}{col 51}Root MSE{col 67}= {res}   59.0147

{txt}{ralign 78:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}co2_g_per_~y{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
public_hol~y {c |}{col 14}{res}{space 2} 15.08089{col 26}{space 2} 2.877142{col 37}{space 1}    5.24{col 46}{space 3}0.006{col 54}{space 4}  7.09266{col 67}{space 3} 23.06911
{txt}{space 1}temperature {c |}{col 14}{res}{space 2} 12.29534{col 26}{space 2} 1.425504{col 37}{space 1}    8.63{col 46}{space 3}0.001{col 54}{space 4} 8.337511{col 67}{space 3} 16.25318
{txt}{space 12} {c |}
{space 10}c. {c |}
{space 1}temperature#{c |}
{space 10}c. {c |}
{space 1}temperature {c |}{col 14}{res}{space 2}-.2520643{col 26}{space 2} .0198222{col 37}{space 1}  -12.72{col 46}{space 3}0.000{col 54}{space 4}-.3070997{col 67}{space 3} -.197029
{txt}{space 12} {c |}
solar_expo~e {c |}{col 14}{res}{space 2} 3.665031{col 26}{space 2} .7417056{col 37}{space 1}    4.94{col 46}{space 3}0.008{col 54}{space 4} 1.605726{col 67}{space 3} 5.724336
{txt}{space 6}wind_3 {c |}{col 14}{res}{space 2}-1.187892{col 26}{space 2} 1.011072{col 37}{space 1}   -1.17{col 46}{space 3}0.305{col 54}{space 4}-3.995077{col 67}{space 3} 1.619293
{txt}{space 6}lead94 {c |}{col 14}{res}{space 2} 3.209777{col 26}{space 2} 7.932609{col 37}{space 1}    0.40{col 46}{space 3}0.706{col 54}{space 4}-18.81468{col 67}{space 3} 25.23423
{txt}{space 6}lead93 {c |}{col 14}{res}{space 2}-12.34267{col 26}{space 2} 4.709864{col 37}{space 1}   -2.62{col 46}{space 3}0.059{col 54}{space 4}-25.41935{col 67}{space 3} .7340104
{txt}{space 6}lead92 {c |}{col 14}{res}{space 2} 17.63663{col 26}{space 2} 13.12809{col 37}{space 1}    1.34{col 46}{space 3}0.250{col 54}{space 4}-18.81279{col 67}{space 3} 54.08604
{txt}{space 6}lead91 {c |}{col 14}{res}{space 2} 1.376943{col 26}{space 2} 3.863742{col 37}{space 1}    0.36{col 46}{space 3}0.740{col 54}{space 4}-9.350523{col 67}{space 3} 12.10441
{txt}{space 6}lead90 {c |}{col 14}{res}{space 2} 11.81863{col 26}{space 2} 9.554998{col 37}{space 1}    1.24{col 46}{space 3}0.284{col 54}{space 4} -14.7103{col 67}{space 3} 38.34755
{txt}{space 6}lead89 {c |}{col 14}{res}{space 2} 5.026383{col 26}{space 2}  10.5699{col 37}{space 1}    0.48{col 46}{space 3}0.659{col 54}{space 4}-24.32037{col 67}{space 3} 34.37314
{txt}{space 6}lead88 {c |}{col 14}{res}{space 2} 18.99162{col 26}{space 2} 6.540456{col 37}{space 1}    2.90{col 46}{space 3}0.044{col 54}{space 4} .8324047{col 67}{space 3} 37.15084
{txt}{space 6}lead87 {c |}{col 14}{res}{space 2} 1.788215{col 26}{space 2} 2.337814{col 37}{space 1}    0.76{col 46}{space 3}0.487{col 54}{space 4}-4.702598{col 67}{space 3} 8.279029
{txt}{space 6}lead86 {c |}{col 14}{res}{space 2} -4.33417{col 26}{space 2} 4.397753{col 37}{space 1}   -0.99{col 46}{space 3}0.380{col 54}{space 4}-16.54429{col 67}{space 3}  7.87595
{txt}{space 6}lead85 {c |}{col 14}{res}{space 2}-8.856306{col 26}{space 2} 7.748745{col 37}{space 1}   -1.14{col 46}{space 3}0.317{col 54}{space 4}-30.37027{col 67}{space 3} 12.65766
{txt}{space 6}lead84 {c |}{col 14}{res}{space 2}   7.0566{col 26}{space 2}  11.2664{col 37}{space 1}    0.63{col 46}{space 3}0.565{col 54}{space 4}-24.22394{col 67}{space 3} 38.33714
{txt}{space 6}lead83 {c |}{col 14}{res}{space 2} 1.963617{col 26}{space 2} 9.796497{col 37}{space 1}    0.20{col 46}{space 3}0.851{col 54}{space 4}-25.23582{col 67}{space 3} 29.16305
{txt}{space 6}lead82 {c |}{col 14}{res}{space 2} 2.265738{col 26}{space 2} 5.722552{col 37}{space 1}    0.40{col 46}{space 3}0.712{col 54}{space 4}-13.62261{col 67}{space 3} 18.15409
{txt}{space 6}lead81 {c |}{col 14}{res}{space 2}-.6154299{col 26}{space 2} 6.368469{col 37}{space 1}   -0.10{col 46}{space 3}0.928{col 54}{space 4}-18.29714{col 67}{space 3} 17.06628
{txt}{space 6}lead80 {c |}{col 14}{res}{space 2}-14.66932{col 26}{space 2} 9.046318{col 37}{space 1}   -1.62{col 46}{space 3}0.180{col 54}{space 4}-39.78593{col 67}{space 3} 10.44728
{txt}{space 6}lead79 {c |}{col 14}{res}{space 2} -8.38174{col 26}{space 2} 6.783908{col 37}{space 1}   -1.24{col 46}{space 3}0.284{col 54}{space 4}-27.21689{col 67}{space 3} 10.45341
{txt}{space 6}lead78 {c |}{col 14}{res}{space 2}-11.01149{col 26}{space 2} 6.472978{col 37}{space 1}   -1.70{col 46}{space 3}0.164{col 54}{space 4}-28.98335{col 67}{space 3}  6.96038
{txt}{space 6}lead77 {c |}{col 14}{res}{space 2}-.3867527{col 26}{space 2} 5.972561{col 37}{space 1}   -0.06{col 46}{space 3}0.951{col 54}{space 4}-16.96924{col 67}{space 3} 16.19574
{txt}{space 6}lead76 {c |}{col 14}{res}{space 2}  -9.5421{col 26}{space 2}  6.68725{col 37}{space 1}   -1.43{col 46}{space 3}0.227{col 54}{space 4}-28.10888{col 67}{space 3} 9.024683
{txt}{space 6}lead75 {c |}{col 14}{res}{space 2}-5.165933{col 26}{space 2} 9.416033{col 37}{space 1}   -0.55{col 46}{space 3}0.612{col 54}{space 4}-31.30903{col 67}{space 3} 20.97716
{txt}{space 6}lead74 {c |}{col 14}{res}{space 2} .6201691{col 26}{space 2} 5.864476{col 37}{space 1}    0.11{col 46}{space 3}0.921{col 54}{space 4}-15.66223{col 67}{space 3} 16.90257
{txt}{space 6}lead73 {c |}{col 14}{res}{space 2}-2.474356{col 26}{space 2} 5.706159{col 37}{space 1}   -0.43{col 46}{space 3}0.687{col 54}{space 4}-18.31719{col 67}{space 3} 13.36848
{txt}{space 6}lead72 {c |}{col 14}{res}{space 2}-1.088818{col 26}{space 2} 6.432514{col 37}{space 1}   -0.17{col 46}{space 3}0.874{col 54}{space 4}-18.94834{col 67}{space 3}  16.7707
{txt}{space 6}lead71 {c |}{col 14}{res}{space 2} .4428855{col 26}{space 2}  8.02431{col 37}{space 1}    0.06{col 46}{space 3}0.959{col 54}{space 4}-21.83617{col 67}{space 3} 22.72194
{txt}{space 6}lead70 {c |}{col 14}{res}{space 2} 4.635522{col 26}{space 2} 7.351324{col 37}{space 1}    0.63{col 46}{space 3}0.563{col 54}{space 4}-15.77503{col 67}{space 3} 25.04607
{txt}{space 6}lead69 {c |}{col 14}{res}{space 2}-5.118438{col 26}{space 2}  8.83837{col 37}{space 1}   -0.58{col 46}{space 3}0.594{col 54}{space 4}-29.65769{col 67}{space 3} 19.42081
{txt}{space 6}lead68 {c |}{col 14}{res}{space 2}-13.53816{col 26}{space 2} 4.619427{col 37}{space 1}   -2.93{col 46}{space 3}0.043{col 54}{space 4}-26.36375{col 67}{space 3}-.7125764
{txt}{space 6}lead67 {c |}{col 14}{res}{space 2}-7.517651{col 26}{space 2} 4.997427{col 37}{space 1}   -1.50{col 46}{space 3}0.207{col 54}{space 4}-21.39273{col 67}{space 3} 6.357431
{txt}{space 6}lead66 {c |}{col 14}{res}{space 2}-2.880219{col 26}{space 2} 3.168743{col 37}{space 1}   -0.91{col 46}{space 3}0.415{col 54}{space 4}-11.67806{col 67}{space 3} 5.917622
{txt}{space 6}lead65 {c |}{col 14}{res}{space 2}-5.352518{col 26}{space 2} 4.954751{col 37}{space 1}   -1.08{col 46}{space 3}0.341{col 54}{space 4}-19.10911{col 67}{space 3} 8.404076
{txt}{space 6}lead64 {c |}{col 14}{res}{space 2} 1.008613{col 26}{space 2} 5.067011{col 37}{space 1}    0.20{col 46}{space 3}0.852{col 54}{space 4}-13.05966{col 67}{space 3} 15.07689
{txt}{space 6}lead63 {c |}{col 14}{res}{space 2} 6.973649{col 26}{space 2} 5.972172{col 37}{space 1}    1.17{col 46}{space 3}0.308{col 54}{space 4}-9.607759{col 67}{space 3} 23.55506
{txt}{space 6}lead62 {c |}{col 14}{res}{space 2} 2.338516{col 26}{space 2} 2.914803{col 37}{space 1}    0.80{col 46}{space 3}0.467{col 54}{space 4}-5.754275{col 67}{space 3} 10.43131
{txt}{space 6}lead61 {c |}{col 14}{res}{space 2} 3.423184{col 26}{space 2} 6.609393{col 37}{space 1}    0.52{col 46}{space 3}0.632{col 54}{space 4}-14.92743{col 67}{space 3}  21.7738
{txt}{space 6}lead60 {c |}{col 14}{res}{space 2}-1.545025{col 26}{space 2} 7.593871{col 37}{space 1}   -0.20{col 46}{space 3}0.849{col 54}{space 4}-22.62899{col 67}{space 3} 19.53894
{txt}{space 6}lead59 {c |}{col 14}{res}{space 2}-5.480707{col 26}{space 2} 6.532584{col 37}{space 1}   -0.84{col 46}{space 3}0.449{col 54}{space 4}-23.61807{col 67}{space 3} 12.65665
{txt}{space 6}lead58 {c |}{col 14}{res}{space 2}-7.400122{col 26}{space 2} 6.909327{col 37}{space 1}   -1.07{col 46}{space 3}0.344{col 54}{space 4}-26.58349{col 67}{space 3} 11.78324
{txt}{space 6}lead57 {c |}{col 14}{res}{space 2}-3.104269{col 26}{space 2} 7.983341{col 37}{space 1}   -0.39{col 46}{space 3}0.717{col 54}{space 4}-25.26958{col 67}{space 3} 19.06104
{txt}{space 6}lead56 {c |}{col 14}{res}{space 2} -4.65655{col 26}{space 2} 6.996404{col 37}{space 1}   -0.67{col 46}{space 3}0.542{col 54}{space 4}-24.08168{col 67}{space 3} 14.76858
{txt}{space 6}lead55 {c |}{col 14}{res}{space 2} 1.530898{col 26}{space 2} 6.246684{col 37}{space 1}    0.25{col 46}{space 3}0.818{col 54}{space 4}-15.81268{col 67}{space 3} 18.87447
{txt}{space 6}lead54 {c |}{col 14}{res}{space 2}-6.998236{col 26}{space 2}  7.94369{col 37}{space 1}   -0.88{col 46}{space 3}0.428{col 54}{space 4}-29.05345{col 67}{space 3} 15.05698
{txt}{space 6}lead53 {c |}{col 14}{res}{space 2}-4.713543{col 26}{space 2} 6.698672{col 37}{space 1}   -0.70{col 46}{space 3}0.520{col 54}{space 4}-23.31204{col 67}{space 3} 13.88495
{txt}{space 6}lead52 {c |}{col 14}{res}{space 2}-8.076866{col 26}{space 2} 8.512702{col 37}{space 1}   -0.95{col 46}{space 3}0.396{col 54}{space 4}-31.71192{col 67}{space 3} 15.55818
{txt}{space 6}lead51 {c |}{col 14}{res}{space 2}-.2168857{col 26}{space 2} 7.517884{col 37}{space 1}   -0.03{col 46}{space 3}0.978{col 54}{space 4}-21.08988{col 67}{space 3} 20.65611
{txt}{space 6}lead50 {c |}{col 14}{res}{space 2}-3.229884{col 26}{space 2} 5.983051{col 37}{space 1}   -0.54{col 46}{space 3}0.618{col 54}{space 4} -19.8415{col 67}{space 3} 13.38173
{txt}{space 6}lead49 {c |}{col 14}{res}{space 2}-7.608468{col 26}{space 2} 5.429214{col 37}{space 1}   -1.40{col 46}{space 3}0.234{col 54}{space 4}-22.68238{col 67}{space 3} 7.465447
{txt}{space 6}lead48 {c |}{col 14}{res}{space 2}-9.318699{col 26}{space 2} 1.805944{col 37}{space 1}   -5.16{col 46}{space 3}0.007{col 54}{space 4} -14.3328{col 67}{space 3}-4.304593
{txt}{space 6}lead47 {c |}{col 14}{res}{space 2}-14.22491{col 26}{space 2} 1.070514{col 37}{space 1}  -13.29{col 46}{space 3}0.000{col 54}{space 4}-17.19713{col 67}{space 3}-11.25268
{txt}{space 6}lead46 {c |}{col 14}{res}{space 2} .0440879{col 26}{space 2} 4.733277{col 37}{space 1}    0.01{col 46}{space 3}0.993{col 54}{space 4} -13.0976{col 67}{space 3} 13.18577
{txt}{space 6}lead45 {c |}{col 14}{res}{space 2} 6.761005{col 26}{space 2}  3.14435{col 37}{space 1}    2.15{col 46}{space 3}0.098{col 54}{space 4}-1.969109{col 67}{space 3} 15.49112
{txt}{space 6}lead44 {c |}{col 14}{res}{space 2}-.6857041{col 26}{space 2} 8.312318{col 37}{space 1}   -0.08{col 46}{space 3}0.938{col 54}{space 4} -23.7644{col 67}{space 3} 22.39299
{txt}{space 6}lead43 {c |}{col 14}{res}{space 2} -7.48436{col 26}{space 2} 1.934844{col 37}{space 1}   -3.87{col 46}{space 3}0.018{col 54}{space 4}-12.85635{col 67}{space 3}-2.112373
{txt}{space 6}lead42 {c |}{col 14}{res}{space 2} 1.986699{col 26}{space 2} 3.367895{col 37}{space 1}    0.59{col 46}{space 3}0.587{col 54}{space 4}-7.364075{col 67}{space 3} 11.33747
{txt}{space 6}lead41 {c |}{col 14}{res}{space 2} -5.03187{col 26}{space 2}  4.41934{col 37}{space 1}   -1.14{col 46}{space 3}0.318{col 54}{space 4}-17.30193{col 67}{space 3} 7.238186
{txt}{space 6}lead40 {c |}{col 14}{res}{space 2}-4.091346{col 26}{space 2} 7.879373{col 37}{space 1}   -0.52{col 46}{space 3}0.631{col 54}{space 4}-25.96799{col 67}{space 3}  17.7853
{txt}{space 6}lead39 {c |}{col 14}{res}{space 2}-3.113638{col 26}{space 2} 6.338615{col 37}{space 1}   -0.49{col 46}{space 3}0.649{col 54}{space 4}-20.71246{col 67}{space 3} 14.48518
{txt}{space 6}lead38 {c |}{col 14}{res}{space 2}  4.49192{col 26}{space 2} 1.851091{col 37}{space 1}    2.43{col 46}{space 3}0.072{col 54}{space 4}-.6475335{col 67}{space 3} 9.631374
{txt}{space 6}lead37 {c |}{col 14}{res}{space 2}-2.517674{col 26}{space 2}  2.24268{col 37}{space 1}   -1.12{col 46}{space 3}0.324{col 54}{space 4}-8.744353{col 67}{space 3} 3.709005
{txt}{space 6}lead36 {c |}{col 14}{res}{space 2}-6.329376{col 26}{space 2} 6.008412{col 37}{space 1}   -1.05{col 46}{space 3}0.352{col 54}{space 4} -23.0114{col 67}{space 3} 10.35265
{txt}{space 6}lead35 {c |}{col 14}{res}{space 2} 7.166177{col 26}{space 2} 3.384854{col 37}{space 1}    2.12{col 46}{space 3}0.102{col 54}{space 4}-2.231684{col 67}{space 3} 16.56404
{txt}{space 6}lead34 {c |}{col 14}{res}{space 2}-.4912437{col 26}{space 2} 6.917123{col 37}{space 1}   -0.07{col 46}{space 3}0.947{col 54}{space 4}-19.69626{col 67}{space 3} 18.71377
{txt}{space 6}lead33 {c |}{col 14}{res}{space 2}-1.359398{col 26}{space 2} 1.731969{col 37}{space 1}   -0.78{col 46}{space 3}0.476{col 54}{space 4}-6.168115{col 67}{space 3} 3.449319
{txt}{space 6}lead32 {c |}{col 14}{res}{space 2}-1.590373{col 26}{space 2} 3.447872{col 37}{space 1}   -0.46{col 46}{space 3}0.669{col 54}{space 4} -11.1632{col 67}{space 3} 7.982455
{txt}{space 6}lead31 {c |}{col 14}{res}{space 2}-.8316553{col 26}{space 2} 4.448525{col 37}{space 1}   -0.19{col 46}{space 3}0.861{col 54}{space 4}-13.18274{col 67}{space 3} 11.51943
{txt}{space 6}lead30 {c |}{col 14}{res}{space 2} 1.697765{col 26}{space 2} 4.250603{col 37}{space 1}    0.40{col 46}{space 3}0.710{col 54}{space 4} -10.1038{col 67}{space 3} 13.49933
{txt}{space 6}lead29 {c |}{col 14}{res}{space 2}-1.471984{col 26}{space 2} 4.248917{col 37}{space 1}   -0.35{col 46}{space 3}0.746{col 54}{space 4}-13.26887{col 67}{space 3}  10.3249
{txt}{space 6}lead28 {c |}{col 14}{res}{space 2} 2.813526{col 26}{space 2} 4.106225{col 37}{space 1}    0.69{col 46}{space 3}0.531{col 54}{space 4}-8.587183{col 67}{space 3} 14.21424
{txt}{space 6}lead27 {c |}{col 14}{res}{space 2} 8.578182{col 26}{space 2} 3.072935{col 37}{space 1}    2.79{col 46}{space 3}0.049{col 54}{space 4} .0463465{col 67}{space 3} 17.11002
{txt}{space 6}lead26 {c |}{col 14}{res}{space 2} 3.896564{col 26}{space 2} 5.024204{col 37}{space 1}    0.78{col 46}{space 3}0.481{col 54}{space 4}-10.05286{col 67}{space 3} 17.84599
{txt}{space 6}lead25 {c |}{col 14}{res}{space 2}-8.107637{col 26}{space 2} 1.784715{col 37}{space 1}   -4.54{col 46}{space 3}0.010{col 54}{space 4} -13.0628{col 67}{space 3}-3.152475
{txt}{space 6}lead24 {c |}{col 14}{res}{space 2}-2.723867{col 26}{space 2} 1.879735{col 37}{space 1}   -1.45{col 46}{space 3}0.221{col 54}{space 4}-7.942847{col 67}{space 3} 2.495113
{txt}{space 6}lead23 {c |}{col 14}{res}{space 2}-2.821207{col 26}{space 2} 3.918281{col 37}{space 1}   -0.72{col 46}{space 3}0.511{col 54}{space 4} -13.7001{col 67}{space 3} 8.057686
{txt}{space 6}lead22 {c |}{col 14}{res}{space 2}-4.003129{col 26}{space 2} 3.970207{col 37}{space 1}   -1.01{col 46}{space 3}0.370{col 54}{space 4}-15.02619{col 67}{space 3} 7.019931
{txt}{space 6}lead21 {c |}{col 14}{res}{space 2}-6.794797{col 26}{space 2} 5.747458{col 37}{space 1}   -1.18{col 46}{space 3}0.303{col 54}{space 4} -22.7523{col 67}{space 3} 9.162704
{txt}{space 6}lead20 {c |}{col 14}{res}{space 2}-4.177455{col 26}{space 2} 4.650057{col 37}{space 1}   -0.90{col 46}{space 3}0.420{col 54}{space 4}-17.08808{col 67}{space 3} 8.733173
{txt}{space 6}lead19 {c |}{col 14}{res}{space 2}-7.653809{col 26}{space 2} 5.383951{col 37}{space 1}   -1.42{col 46}{space 3}0.228{col 54}{space 4}-22.60205{col 67}{space 3} 7.294435
{txt}{space 6}lead18 {c |}{col 14}{res}{space 2}-3.663411{col 26}{space 2} 1.816542{col 37}{space 1}   -2.02{col 46}{space 3}0.114{col 54}{space 4}-8.706941{col 67}{space 3} 1.380119
{txt}{space 6}lead17 {c |}{col 14}{res}{space 2}-8.946262{col 26}{space 2} .7180214{col 37}{space 1}  -12.46{col 46}{space 3}0.000{col 54}{space 4}-10.93981{col 67}{space 3}-6.952715
{txt}{space 6}lead16 {c |}{col 14}{res}{space 2}-4.551918{col 26}{space 2} 1.392807{col 37}{space 1}   -3.27{col 46}{space 3}0.031{col 54}{space 4}-8.418972{col 67}{space 3}-.6848653
{txt}{space 6}lead15 {c |}{col 14}{res}{space 2}-10.25328{col 26}{space 2} .2971834{col 37}{space 1}  -34.50{col 46}{space 3}0.000{col 54}{space 4}-11.07839{col 67}{space 3}-9.428162
{txt}{space 6}lead14 {c |}{col 14}{res}{space 2}-4.653812{col 26}{space 2} 2.145254{col 37}{space 1}   -2.17{col 46}{space 3}0.096{col 54}{space 4}-10.60999{col 67}{space 3} 1.302367
{txt}{space 6}lead13 {c |}{col 14}{res}{space 2} 4.746625{col 26}{space 2} 1.257291{col 37}{space 1}    3.78{col 46}{space 3}0.020{col 54}{space 4} 1.255826{col 67}{space 3} 8.237424
{txt}{space 6}lead12 {c |}{col 14}{res}{space 2}-9.092718{col 26}{space 2} 3.417702{col 37}{space 1}   -2.66{col 46}{space 3}0.056{col 54}{space 4}-18.58178{col 67}{space 3} .3963435
{txt}{space 6}lead11 {c |}{col 14}{res}{space 2}-8.124925{col 26}{space 2} 3.847728{col 37}{space 1}   -2.11{col 46}{space 3}0.102{col 54}{space 4}-18.80793{col 67}{space 3} 2.558081
{txt}{space 6}lead10 {c |}{col 14}{res}{space 2}-9.812644{col 26}{space 2} 4.101848{col 37}{space 1}   -2.39{col 46}{space 3}0.075{col 54}{space 4} -21.2012{col 67}{space 3} 1.575911
{txt}{space 7}lead9 {c |}{col 14}{res}{space 2}-10.61271{col 26}{space 2} 5.836367{col 37}{space 1}   -1.82{col 46}{space 3}0.143{col 54}{space 4}-26.81706{col 67}{space 3} 5.591644
{txt}{space 7}lead8 {c |}{col 14}{res}{space 2}-4.573266{col 26}{space 2} 4.507914{col 37}{space 1}   -1.01{col 46}{space 3}0.368{col 54}{space 4}-17.08924{col 67}{space 3} 7.942708
{txt}{space 7}lead7 {c |}{col 14}{res}{space 2}-1.017744{col 26}{space 2} 5.435525{col 37}{space 1}   -0.19{col 46}{space 3}0.861{col 54}{space 4}-16.10918{col 67}{space 3} 14.07369
{txt}{space 7}lead6 {c |}{col 14}{res}{space 2} -7.26683{col 26}{space 2} 4.010286{col 37}{space 1}   -1.81{col 46}{space 3}0.144{col 54}{space 4}-18.40117{col 67}{space 3}  3.86751
{txt}{space 7}lead5 {c |}{col 14}{res}{space 2}-13.43199{col 26}{space 2} 2.797758{col 37}{space 1}   -4.80{col 46}{space 3}0.009{col 54}{space 4}-21.19981{col 67}{space 3}-5.664164
{txt}{space 7}lead4 {c |}{col 14}{res}{space 2}-14.38604{col 26}{space 2} 6.440549{col 37}{space 1}   -2.23{col 46}{space 3}0.089{col 54}{space 4}-32.26787{col 67}{space 3}  3.49579
{txt}{space 7}lead3 {c |}{col 14}{res}{space 2}-21.14681{col 26}{space 2} 6.216283{col 37}{space 1}   -3.40{col 46}{space 3}0.027{col 54}{space 4}-38.40598{col 67}{space 3}-3.887647
{txt}{space 7}lead2 {c |}{col 14}{res}{space 2}-7.473921{col 26}{space 2} 4.370941{col 37}{space 1}   -1.71{col 46}{space 3}0.162{col 54}{space 4} -19.6096{col 67}{space 3} 4.661757
{txt}{space 8}lag0 {c |}{col 14}{res}{space 2}-6.678528{col 26}{space 2}  2.43811{col 37}{space 1}   -2.74{col 46}{space 3}0.052{col 54}{space 4}-13.44781{col 67}{space 3} .0907501
{txt}{space 8}lag1 {c |}{col 14}{res}{space 2}-6.611435{col 26}{space 2} 4.104451{col 37}{space 1}   -1.61{col 46}{space 3}0.183{col 54}{space 4}-18.00722{col 67}{space 3} 4.784348
{txt}{space 8}lag2 {c |}{col 14}{res}{space 2}-7.153741{col 26}{space 2} 3.241931{col 37}{space 1}   -2.21{col 46}{space 3}0.092{col 54}{space 4}-16.15478{col 67}{space 3} 1.847302
{txt}{space 8}lag3 {c |}{col 14}{res}{space 2}-2.548781{col 26}{space 2} 4.325302{col 37}{space 1}   -0.59{col 46}{space 3}0.587{col 54}{space 4}-14.55774{col 67}{space 3} 9.460181
{txt}{space 8}lag4 {c |}{col 14}{res}{space 2} .2172404{col 26}{space 2} 5.869747{col 37}{space 1}    0.04{col 46}{space 3}0.972{col 54}{space 4}-16.07979{col 67}{space 3} 16.51427
{txt}{space 8}lag5 {c |}{col 14}{res}{space 2} .1698834{col 26}{space 2} 3.271926{col 37}{space 1}    0.05{col 46}{space 3}0.961{col 54}{space 4}-8.914441{col 67}{space 3} 9.254208
{txt}{space 8}lag6 {c |}{col 14}{res}{space 2}-7.241344{col 26}{space 2} 2.525104{col 37}{space 1}   -2.87{col 46}{space 3}0.046{col 54}{space 4}-14.25216{col 67}{space 3} -.230532
{txt}{space 8}lag7 {c |}{col 14}{res}{space 2}-6.441939{col 26}{space 2} 2.451119{col 37}{space 1}   -2.63{col 46}{space 3}0.058{col 54}{space 4}-13.24734{col 67}{space 3} .3634588
{txt}{space 8}lag8 {c |}{col 14}{res}{space 2} 6.819513{col 26}{space 2} 6.005705{col 37}{space 1}    1.14{col 46}{space 3}0.320{col 54}{space 4}-9.854996{col 67}{space 3} 23.49402
{txt}{space 8}lag9 {c |}{col 14}{res}{space 2} .3469315{col 26}{space 2} 3.481649{col 37}{space 1}    0.10{col 46}{space 3}0.925{col 54}{space 4}-9.319676{col 67}{space 3} 10.01354
{txt}{space 7}lag10 {c |}{col 14}{res}{space 2}-8.248905{col 26}{space 2} 3.493359{col 37}{space 1}   -2.36{col 46}{space 3}0.078{col 54}{space 4}-17.94803{col 67}{space 3} 1.450215
{txt}{space 7}lag11 {c |}{col 14}{res}{space 2}-.9211106{col 26}{space 2} 6.709059{col 37}{space 1}   -0.14{col 46}{space 3}0.897{col 54}{space 4}-19.54844{col 67}{space 3} 17.70622
{txt}{space 7}lag12 {c |}{col 14}{res}{space 2}-8.783919{col 26}{space 2}   3.5553{col 37}{space 1}   -2.47{col 46}{space 3}0.069{col 54}{space 4}-18.65501{col 67}{space 3} 1.087176
{txt}{space 7}lag13 {c |}{col 14}{res}{space 2}-1.483786{col 26}{space 2} 2.921014{col 37}{space 1}   -0.51{col 46}{space 3}0.638{col 54}{space 4} -9.59382{col 67}{space 3} 6.626249
{txt}{space 7}lag14 {c |}{col 14}{res}{space 2}-6.007377{col 26}{space 2} 1.910764{col 37}{space 1}   -3.14{col 46}{space 3}0.035{col 54}{space 4}-11.31251{col 67}{space 3}-.7022465
{txt}{space 7}lag15 {c |}{col 14}{res}{space 2}-4.962275{col 26}{space 2} 3.198196{col 37}{space 1}   -1.55{col 46}{space 3}0.196{col 54}{space 4}-13.84189{col 67}{space 3}  3.91734
{txt}{space 7}lag16 {c |}{col 14}{res}{space 2} 3.294445{col 26}{space 2} 1.449985{col 37}{space 1}    2.27{col 46}{space 3}0.086{col 54}{space 4}-.7313576{col 67}{space 3} 7.320247
{txt}{space 7}lag17 {c |}{col 14}{res}{space 2} 2.934463{col 26}{space 2} 2.644508{col 37}{space 1}    1.11{col 46}{space 3}0.329{col 54}{space 4}-4.407868{col 67}{space 3} 10.27679
{txt}{space 7}lag18 {c |}{col 14}{res}{space 2}-6.323049{col 26}{space 2} 1.314247{col 37}{space 1}   -4.81{col 46}{space 3}0.009{col 54}{space 4}-9.971984{col 67}{space 3}-2.674115
{txt}{space 7}lag19 {c |}{col 14}{res}{space 2}-7.301734{col 26}{space 2} 3.351013{col 37}{space 1}   -2.18{col 46}{space 3}0.095{col 54}{space 4}-16.60564{col 67}{space 3}  2.00217
{txt}{space 7}lag20 {c |}{col 14}{res}{space 2}-1.756692{col 26}{space 2} 1.723189{col 37}{space 1}   -1.02{col 46}{space 3}0.366{col 54}{space 4}-6.541031{col 67}{space 3} 3.027647
{txt}{space 7}lag21 {c |}{col 14}{res}{space 2}-1.804632{col 26}{space 2} 8.249779{col 37}{space 1}   -0.22{col 46}{space 3}0.838{col 54}{space 4}-24.70969{col 67}{space 3} 21.10043
{txt}{space 7}lag22 {c |}{col 14}{res}{space 2}-1.445124{col 26}{space 2} 6.256938{col 37}{space 1}   -0.23{col 46}{space 3}0.829{col 54}{space 4}-18.81717{col 67}{space 3} 15.92692
{txt}{space 7}lag23 {c |}{col 14}{res}{space 2}-1.042379{col 26}{space 2}  1.47585{col 37}{space 1}   -0.71{col 46}{space 3}0.519{col 54}{space 4}-5.139996{col 67}{space 3} 3.055237
{txt}{space 7}lag24 {c |}{col 14}{res}{space 2}-6.136609{col 26}{space 2} 5.047434{col 37}{space 1}   -1.22{col 46}{space 3}0.291{col 54}{space 4}-20.15053{col 67}{space 3} 7.877316
{txt}{space 7}lag25 {c |}{col 14}{res}{space 2}-11.65908{col 26}{space 2} 7.364493{col 37}{space 1}   -1.58{col 46}{space 3}0.189{col 54}{space 4}-32.10619{col 67}{space 3} 8.788035
{txt}{space 7}lag26 {c |}{col 14}{res}{space 2}-8.078696{col 26}{space 2} 6.465341{col 37}{space 1}   -1.25{col 46}{space 3}0.280{col 54}{space 4}-26.02936{col 67}{space 3}  9.87197
{txt}{space 7}lag27 {c |}{col 14}{res}{space 2}-6.762265{col 26}{space 2} 3.188459{col 37}{space 1}   -2.12{col 46}{space 3}0.101{col 54}{space 4}-15.61485{col 67}{space 3} 2.090316
{txt}{space 7}lag28 {c |}{col 14}{res}{space 2} -5.75822{col 26}{space 2} 4.619365{col 37}{space 1}   -1.25{col 46}{space 3}0.281{col 54}{space 4}-18.58363{col 67}{space 3} 7.067194
{txt}{space 7}lag29 {c |}{col 14}{res}{space 2}-9.969695{col 26}{space 2} 3.538367{col 37}{space 1}   -2.82{col 46}{space 3}0.048{col 54}{space 4}-19.79378{col 67}{space 3}-.1456142
{txt}{space 7}lag30 {c |}{col 14}{res}{space 2}-4.885257{col 26}{space 2} 5.456245{col 37}{space 1}   -0.90{col 46}{space 3}0.421{col 54}{space 4}-20.03422{col 67}{space 3} 10.26371
{txt}{space 7}lag31 {c |}{col 14}{res}{space 2}-12.50719{col 26}{space 2} 2.102631{col 37}{space 1}   -5.95{col 46}{space 3}0.004{col 54}{space 4}-18.34503{col 67}{space 3}-6.669351
{txt}{space 7}lag32 {c |}{col 14}{res}{space 2}-4.376091{col 26}{space 2} 3.347106{col 37}{space 1}   -1.31{col 46}{space 3}0.261{col 54}{space 4}-13.66915{col 67}{space 3} 4.916965
{txt}{space 7}lag33 {c |}{col 14}{res}{space 2} -14.8478{col 26}{space 2} 4.720846{col 37}{space 1}   -3.15{col 46}{space 3}0.035{col 54}{space 4}-27.95497{col 67}{space 3}-1.740635
{txt}{space 7}lag34 {c |}{col 14}{res}{space 2}-11.55713{col 26}{space 2} 4.441326{col 37}{space 1}   -2.60{col 46}{space 3}0.060{col 54}{space 4}-23.88823{col 67}{space 3} .7739658
{txt}{space 7}lag35 {c |}{col 14}{res}{space 2}-8.131607{col 26}{space 2} 4.256338{col 37}{space 1}   -1.91{col 46}{space 3}0.129{col 54}{space 4} -19.9491{col 67}{space 3} 3.685883
{txt}{space 7}lag36 {c |}{col 14}{res}{space 2}-5.758181{col 26}{space 2} 2.703912{col 37}{space 1}   -2.13{col 46}{space 3}0.100{col 54}{space 4}-13.26544{col 67}{space 3} 1.749081
{txt}{space 7}lag37 {c |}{col 14}{res}{space 2}-1.701053{col 26}{space 2}   8.7947{col 37}{space 1}   -0.19{col 46}{space 3}0.856{col 54}{space 4}-26.11906{col 67}{space 3} 22.71695
{txt}{space 7}lag38 {c |}{col 14}{res}{space 2}-8.816062{col 26}{space 2} 6.354233{col 37}{space 1}   -1.39{col 46}{space 3}0.238{col 54}{space 4}-26.45824{col 67}{space 3} 8.826118
{txt}{space 7}lag39 {c |}{col 14}{res}{space 2}-10.61218{col 26}{space 2} 6.691396{col 37}{space 1}   -1.59{col 46}{space 3}0.188{col 54}{space 4}-29.19048{col 67}{space 3}  7.96611
{txt}{space 7}lag40 {c |}{col 14}{res}{space 2}-7.234755{col 26}{space 2}  10.8173{col 37}{space 1}   -0.67{col 46}{space 3}0.540{col 54}{space 4}-37.26838{col 67}{space 3} 22.79887
{txt}{space 7}lag41 {c |}{col 14}{res}{space 2}-10.34503{col 26}{space 2} 10.36389{col 37}{space 1}   -1.00{col 46}{space 3}0.375{col 54}{space 4}-39.11981{col 67}{space 3} 18.42976
{txt}{space 7}lag42 {c |}{col 14}{res}{space 2}-.2308463{col 26}{space 2}    7.968{col 37}{space 1}   -0.03{col 46}{space 3}0.978{col 54}{space 4}-22.35356{col 67}{space 3} 21.89187
{txt}{space 7}lag43 {c |}{col 14}{res}{space 2}-18.03876{col 26}{space 2} 5.282373{col 37}{space 1}   -3.41{col 46}{space 3}0.027{col 54}{space 4}-32.70498{col 67}{space 3}-3.372544
{txt}{space 7}lag44 {c |}{col 14}{res}{space 2} -9.42477{col 26}{space 2}  10.1304{col 37}{space 1}   -0.93{col 46}{space 3}0.405{col 54}{space 4}-37.55128{col 67}{space 3} 18.70174
{txt}{space 7}lag45 {c |}{col 14}{res}{space 2}-8.714885{col 26}{space 2} 1.772737{col 37}{space 1}   -4.92{col 46}{space 3}0.008{col 54}{space 4}-13.63679{col 67}{space 3}-3.792977
{txt}{space 7}lag46 {c |}{col 14}{res}{space 2}-10.75046{col 26}{space 2} 5.216718{col 37}{space 1}   -2.06{col 46}{space 3}0.108{col 54}{space 4}-25.23439{col 67}{space 3} 3.733476
{txt}{space 7}lag47 {c |}{col 14}{res}{space 2}-4.227253{col 26}{space 2}   7.7712{col 37}{space 1}   -0.54{col 46}{space 3}0.615{col 54}{space 4}-25.80356{col 67}{space 3} 17.34906
{txt}{space 7}lag48 {c |}{col 14}{res}{space 2}-7.470929{col 26}{space 2}  6.98581{col 37}{space 1}   -1.07{col 46}{space 3}0.345{col 54}{space 4}-26.86665{col 67}{space 3} 11.92479
{txt}{space 7}lag49 {c |}{col 14}{res}{space 2}-20.83711{col 26}{space 2} 5.956456{col 37}{space 1}   -3.50{col 46}{space 3}0.025{col 54}{space 4}-37.37488{col 67}{space 3}-4.299334
{txt}{space 7}lag50 {c |}{col 14}{res}{space 2}-14.51532{col 26}{space 2} 3.010614{col 37}{space 1}   -4.82{col 46}{space 3}0.009{col 54}{space 4}-22.87413{col 67}{space 3}-6.156518
{txt}{space 7}lag51 {c |}{col 14}{res}{space 2} .6626912{col 26}{space 2} 2.275635{col 37}{space 1}    0.29{col 46}{space 3}0.785{col 54}{space 4}-5.655484{col 67}{space 3} 6.980866
{txt}{space 7}lag52 {c |}{col 14}{res}{space 2}-9.025598{col 26}{space 2} 2.900775{col 37}{space 1}   -3.11{col 46}{space 3}0.036{col 54}{space 4}-17.07944{col 67}{space 3}-.9717543
{txt}{space 7}lag53 {c |}{col 14}{res}{space 2}-14.93134{col 26}{space 2} 7.659894{col 37}{space 1}   -1.95{col 46}{space 3}0.123{col 54}{space 4}-36.19862{col 67}{space 3} 6.335934
{txt}{space 7}lag54 {c |}{col 14}{res}{space 2}-9.058534{col 26}{space 2} 7.171267{col 37}{space 1}   -1.26{col 46}{space 3}0.275{col 54}{space 4}-28.96916{col 67}{space 3}  10.8521
{txt}{space 7}lag55 {c |}{col 14}{res}{space 2}-13.07689{col 26}{space 2} 7.086914{col 37}{space 1}   -1.85{col 46}{space 3}0.139{col 54}{space 4}-32.75331{col 67}{space 3} 6.599542
{txt}{space 7}lag56 {c |}{col 14}{res}{space 2}-14.34922{col 26}{space 2} 2.138965{col 37}{space 1}   -6.71{col 46}{space 3}0.003{col 54}{space 4}-20.28794{col 67}{space 3}-8.410498
{txt}{space 7}lag57 {c |}{col 14}{res}{space 2} -4.82934{col 26}{space 2} 7.716204{col 37}{space 1}   -0.63{col 46}{space 3}0.565{col 54}{space 4}-26.25296{col 67}{space 3} 16.59428
{txt}{space 7}lag58 {c |}{col 14}{res}{space 2}-7.756022{col 26}{space 2} 4.148359{col 37}{space 1}   -1.87{col 46}{space 3}0.135{col 54}{space 4}-19.27371{col 67}{space 3} 3.761669
{txt}{space 7}lag59 {c |}{col 14}{res}{space 2}-6.667636{col 26}{space 2} 5.477165{col 37}{space 1}   -1.22{col 46}{space 3}0.290{col 54}{space 4}-21.87469{col 67}{space 3} 8.539413
{txt}{space 7}lag60 {c |}{col 14}{res}{space 2}-4.296587{col 26}{space 2} 10.17347{col 37}{space 1}   -0.42{col 46}{space 3}0.694{col 54}{space 4}-32.54266{col 67}{space 3} 23.94949
{txt}{space 7}lag61 {c |}{col 14}{res}{space 2}-4.288696{col 26}{space 2} 9.870947{col 37}{space 1}   -0.43{col 46}{space 3}0.686{col 54}{space 4}-31.69484{col 67}{space 3} 23.11745
{txt}{space 7}lag62 {c |}{col 14}{res}{space 2}-13.66166{col 26}{space 2} 7.604713{col 37}{space 1}   -1.80{col 46}{space 3}0.147{col 54}{space 4}-34.77572{col 67}{space 3}  7.45241
{txt}{space 7}lag63 {c |}{col 14}{res}{space 2}-19.32079{col 26}{space 2} 12.66277{col 37}{space 1}   -1.53{col 46}{space 3}0.202{col 54}{space 4}-54.47826{col 67}{space 3} 15.83668
{txt}{space 7}lag64 {c |}{col 14}{res}{space 2}-19.20834{col 26}{space 2} 5.393564{col 37}{space 1}   -3.56{col 46}{space 3}0.024{col 54}{space 4}-34.18327{col 67}{space 3}-4.233402
{txt}{space 7}lag65 {c |}{col 14}{res}{space 2}-25.57075{col 26}{space 2} 6.452522{col 37}{space 1}   -3.96{col 46}{space 3}0.017{col 54}{space 4}-43.48583{col 67}{space 3} -7.65568
{txt}{space 7}lag66 {c |}{col 14}{res}{space 2}-9.083583{col 26}{space 2} 3.374212{col 37}{space 1}   -2.69{col 46}{space 3}0.055{col 54}{space 4} -18.4519{col 67}{space 3} .2847321
{txt}{space 7}lag67 {c |}{col 14}{res}{space 2} .1059907{col 26}{space 2} 8.178432{col 37}{space 1}    0.01{col 46}{space 3}0.990{col 54}{space 4}-22.60098{col 67}{space 3} 22.81296
{txt}{space 7}lag68 {c |}{col 14}{res}{space 2}-6.235827{col 26}{space 2} 6.980441{col 37}{space 1}   -0.89{col 46}{space 3}0.422{col 54}{space 4}-25.61664{col 67}{space 3} 13.14498
{txt}{space 7}lag69 {c |}{col 14}{res}{space 2}-13.82284{col 26}{space 2} 6.129782{col 37}{space 1}   -2.26{col 46}{space 3}0.087{col 54}{space 4}-30.84184{col 67}{space 3} 3.196162
{txt}{space 7}lag70 {c |}{col 14}{res}{space 2}-11.01402{col 26}{space 2}  6.22502{col 37}{space 1}   -1.77{col 46}{space 3}0.152{col 54}{space 4}-28.29745{col 67}{space 3} 6.269407
{txt}{space 7}lag71 {c |}{col 14}{res}{space 2}-17.81508{col 26}{space 2} 2.888817{col 37}{space 1}   -6.17{col 46}{space 3}0.004{col 54}{space 4}-25.83573{col 67}{space 3}-9.794443
{txt}{space 7}lag72 {c |}{col 14}{res}{space 2}-6.806196{col 26}{space 2} 7.362494{col 37}{space 1}   -0.92{col 46}{space 3}0.408{col 54}{space 4}-27.24776{col 67}{space 3} 13.63536
{txt}{space 7}lag73 {c |}{col 14}{res}{space 2} .3418081{col 26}{space 2} 10.23874{col 37}{space 1}    0.03{col 46}{space 3}0.975{col 54}{space 4} -28.0855{col 67}{space 3} 28.76911
{txt}{space 7}lag74 {c |}{col 14}{res}{space 2}-9.192284{col 26}{space 2}  9.93452{col 37}{space 1}   -0.93{col 46}{space 3}0.407{col 54}{space 4}-36.77493{col 67}{space 3} 18.39036
{txt}{space 7}lag75 {c |}{col 14}{res}{space 2}-8.009031{col 26}{space 2} 10.80504{col 37}{space 1}   -0.74{col 46}{space 3}0.500{col 54}{space 4}-38.00864{col 67}{space 3} 21.99058
{txt}{space 7}lag76 {c |}{col 14}{res}{space 2}-9.937785{col 26}{space 2} 6.199858{col 37}{space 1}   -1.60{col 46}{space 3}0.184{col 54}{space 4}-27.15135{col 67}{space 3} 7.275782
{txt}{space 7}lag77 {c |}{col 14}{res}{space 2}-19.80733{col 26}{space 2} 4.641201{col 37}{space 1}   -4.27{col 46}{space 3}0.013{col 54}{space 4}-32.69336{col 67}{space 3}-6.921286
{txt}{space 7}lag78 {c |}{col 14}{res}{space 2}-12.89773{col 26}{space 2} 4.380364{col 37}{space 1}   -2.94{col 46}{space 3}0.042{col 54}{space 4}-25.05957{col 67}{space 3}  -.73589
{txt}{space 7}lag79 {c |}{col 14}{res}{space 2}-7.214031{col 26}{space 2} 9.565717{col 37}{space 1}   -0.75{col 46}{space 3}0.493{col 54}{space 4}-33.77272{col 67}{space 3} 19.34466
{txt}{space 7}lag80 {c |}{col 14}{res}{space 2}-1.259514{col 26}{space 2} 12.74021{col 37}{space 1}   -0.10{col 46}{space 3}0.926{col 54}{space 4}-36.63201{col 67}{space 3} 34.11298
{txt}{space 7}lag81 {c |}{col 14}{res}{space 2}-9.564923{col 26}{space 2} 8.193753{col 37}{space 1}   -1.17{col 46}{space 3}0.308{col 54}{space 4}-32.31443{col 67}{space 3} 13.18458
{txt}{space 7}lag82 {c |}{col 14}{res}{space 2}-14.65155{col 26}{space 2} 5.730704{col 37}{space 1}   -2.56{col 46}{space 3}0.063{col 54}{space 4}-30.56254{col 67}{space 3} 1.259431
{txt}{space 7}lag83 {c |}{col 14}{res}{space 2}-3.510018{col 26}{space 2} 6.835945{col 37}{space 1}   -0.51{col 46}{space 3}0.635{col 54}{space 4}-22.48964{col 67}{space 3} 15.46961
{txt}{space 7}lag84 {c |}{col 14}{res}{space 2}-8.715732{col 26}{space 2}  5.92794{col 37}{space 1}   -1.47{col 46}{space 3}0.215{col 54}{space 4}-25.17433{col 67}{space 3} 7.742869
{txt}{space 7}lag85 {c |}{col 14}{res}{space 2}-11.58012{col 26}{space 2} 5.069451{col 37}{space 1}   -2.28{col 46}{space 3}0.084{col 54}{space 4}-25.65517{col 67}{space 3} 2.494937
{txt}{space 7}lag86 {c |}{col 14}{res}{space 2}-10.75719{col 26}{space 2} 4.965301{col 37}{space 1}   -2.17{col 46}{space 3}0.096{col 54}{space 4}-24.54308{col 67}{space 3} 3.028694
{txt}{space 7}lag87 {c |}{col 14}{res}{space 2}-9.065413{col 26}{space 2} 8.169424{col 37}{space 1}   -1.11{col 46}{space 3}0.329{col 54}{space 4}-31.74737{col 67}{space 3} 13.61654
{txt}{space 7}lag88 {c |}{col 14}{res}{space 2}-12.50174{col 26}{space 2} 9.238666{col 37}{space 1}   -1.35{col 46}{space 3}0.247{col 54}{space 4}-38.15239{col 67}{space 3} 13.14891
{txt}{space 7}lag89 {c |}{col 14}{res}{space 2} -6.48924{col 26}{space 2} 6.487046{col 37}{space 1}   -1.00{col 46}{space 3}0.374{col 54}{space 4}-24.50017{col 67}{space 3} 11.52169
{txt}{space 7}lag90 {c |}{col 14}{res}{space 2}-10.17891{col 26}{space 2} 7.275799{col 37}{space 1}   -1.40{col 46}{space 3}0.234{col 54}{space 4}-30.37977{col 67}{space 3} 10.02194
{txt}{space 7}lag91 {c |}{col 14}{res}{space 2}-17.14231{col 26}{space 2} 5.459746{col 37}{space 1}   -3.14{col 46}{space 3}0.035{col 54}{space 4}-32.30099{col 67}{space 3}-1.983626
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-157.9221{col 26}{space 2}  26.6202{col 37}{space 1}   -5.93{col 46}{space 3}0.004{col 54}{space 4}-231.8316{col 67}{space 3} -84.0126
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}   regionid1{col 14}{c |}{space 1}        5{col 27}{space 1}        5{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}        date{col 14}{c |}{space 1}     2560{col 27}{space 1}        1{col 39}{result}{space 1}     2559{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. graph export "results/EventStudy-MiddayCO2-DST-Stop.png", replace
{txt}{p 0 4 2}
file {bf}
results/EventStudy-MiddayCO2-DST-Stop.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. 
. /****************** 6. **Additional Robustness Checks:**************************
>    - Event studies for CO2 emissions and electricity consumption after dropping data related to Tasmania.
>    - Results are exported to files. */
.    
. // DDD dropping Tasmania
. use "data/05-half-hourly.dta", clear
{txt}
{com}. gen timevar = .
{txt}(1,264,072 missing values generated)

{com}. replace timevar = days_into_dst if dst_here_anytime == 1
{txt}(1,011,256 real changes made)

{com}. drop if regionid == "TAS1"
{txt}(252,814 observations deleted)

{com}. 
. eventdd co2_g_per_capita_vs_midday public_holiday c.temperature##c.temperature /// 
> solar_exposure wind_3  [aweight = population], timevar(timevar) /// 
> method(hdfe, absorb(regionid1 date) cluster(regionid1)) ///
>  graph_op(ytitle("Co2 g per capita") xtitle("Days until DST transition") /// 
>  title("Event Study - CO2 - Midday - w/o Tasmania"))
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}{txt}warning: missing F statistic; dropped variables due to collinearity or too few clusters
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,011,258
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F( 190,      3)}{col 67}=          {res}.
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.3237
{txt}{col 51}Adj R-squared{col 67}= {res}    0.3201
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0236
{txt}{col 1}Number of clusters ({res}regionid1{txt}) {col 30}= {res}         4{txt}{col 51}Root MSE{col 67}= {res}   59.3055

{txt}{ralign 78:(Std. err. adjusted for {res:4} clusters in {res:regionid1})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}co2_g_per_~y{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
public_hol~y {c |}{col 14}{res}{space 2} 12.64229{col 26}{space 2} 3.249159{col 37}{space 1}    3.89{col 46}{space 3}0.030{col 54}{space 4} 2.302014{col 67}{space 3} 22.98256
{txt}{space 1}temperature {c |}{col 14}{res}{space 2}  12.0054{col 26}{space 2} 1.633289{col 37}{space 1}    7.35{col 46}{space 3}0.005{col 54}{space 4} 6.807546{col 67}{space 3} 17.20326
{txt}{space 12} {c |}
{space 10}c. {c |}
{space 1}temperature#{c |}
{space 10}c. {c |}
{space 1}temperature {c |}{col 14}{res}{space 2}-.2473968{col 26}{space 2} .0266511{col 37}{space 1}   -9.28{col 46}{space 3}0.003{col 54}{space 4}-.3322126{col 67}{space 3} -.162581
{txt}{space 12} {c |}
solar_expo~e {c |}{col 14}{res}{space 2} 3.857961{col 26}{space 2}  .809311{col 37}{space 1}    4.77{col 46}{space 3}0.018{col 54}{space 4} 1.282373{col 67}{space 3}  6.43355
{txt}{space 6}wind_3 {c |}{col 14}{res}{space 2}-1.819429{col 26}{space 2} .8883221{col 37}{space 1}   -2.05{col 46}{space 3}0.133{col 54}{space 4}-4.646467{col 67}{space 3} 1.007608
{txt}{space 6}lead94 {c |}{col 14}{res}{space 2} 11.85841{col 26}{space 2} 7.754225{col 37}{space 1}    1.53{col 46}{space 3}0.224{col 54}{space 4}-12.81899{col 67}{space 3} 36.53582
{txt}{space 6}lead93 {c |}{col 14}{res}{space 2}-1.669385{col 26}{space 2} 3.288528{col 37}{space 1}   -0.51{col 46}{space 3}0.647{col 54}{space 4}-12.13495{col 67}{space 3}  8.79618
{txt}{space 6}lead92 {c |}{col 14}{res}{space 2}  19.4629{col 26}{space 2} 8.750823{col 37}{space 1}    2.22{col 46}{space 3}0.113{col 54}{space 4}-8.386122{col 67}{space 3} 47.31192
{txt}{space 6}lead91 {c |}{col 14}{res}{space 2}  7.59792{col 26}{space 2} 11.83344{col 37}{space 1}    0.64{col 46}{space 3}0.567{col 54}{space 4}-30.06136{col 67}{space 3}  45.2572
{txt}{space 6}lead90 {c |}{col 14}{res}{space 2} 11.11349{col 26}{space 2}  7.32502{col 37}{space 1}    1.52{col 46}{space 3}0.226{col 54}{space 4}-12.19799{col 67}{space 3} 34.42497
{txt}{space 6}lead89 {c |}{col 14}{res}{space 2}  8.35178{col 26}{space 2} 6.045936{col 37}{space 1}    1.38{col 46}{space 3}0.261{col 54}{space 4}-10.88909{col 67}{space 3} 27.59265
{txt}{space 6}lead88 {c |}{col 14}{res}{space 2} 15.57572{col 26}{space 2} 6.778626{col 37}{space 1}    2.30{col 46}{space 3}0.105{col 54}{space 4}-5.996896{col 67}{space 3} 37.14833
{txt}{space 6}lead87 {c |}{col 14}{res}{space 2} 6.630614{col 26}{space 2} 2.905893{col 37}{space 1}    2.28{col 46}{space 3}0.107{col 54}{space 4}-2.617233{col 67}{space 3} 15.87846
{txt}{space 6}lead86 {c |}{col 14}{res}{space 2}-2.395431{col 26}{space 2} 6.167312{col 37}{space 1}   -0.39{col 46}{space 3}0.724{col 54}{space 4}-22.02257{col 67}{space 3} 17.23171
{txt}{space 6}lead85 {c |}{col 14}{res}{space 2}-4.987964{col 26}{space 2} 9.581158{col 37}{space 1}   -0.52{col 46}{space 3}0.639{col 54}{space 4}-35.47948{col 67}{space 3} 25.50356
{txt}{space 6}lead84 {c |}{col 14}{res}{space 2}   7.3975{col 26}{space 2} 12.49477{col 37}{space 1}    0.59{col 46}{space 3}0.595{col 54}{space 4}-32.36644{col 67}{space 3} 47.16144
{txt}{space 6}lead83 {c |}{col 14}{res}{space 2} 1.369373{col 26}{space 2} 10.05891{col 37}{space 1}    0.14{col 46}{space 3}0.900{col 54}{space 4}-30.64257{col 67}{space 3} 33.38132
{txt}{space 6}lead82 {c |}{col 14}{res}{space 2} -1.20357{col 26}{space 2} 7.011235{col 37}{space 1}   -0.17{col 46}{space 3}0.875{col 54}{space 4}-23.51645{col 67}{space 3} 21.10931
{txt}{space 6}lead81 {c |}{col 14}{res}{space 2}-1.074959{col 26}{space 2} 4.296951{col 37}{space 1}   -0.25{col 46}{space 3}0.819{col 54}{space 4}-14.74978{col 67}{space 3} 12.59986
{txt}{space 6}lead80 {c |}{col 14}{res}{space 2} -11.7678{col 26}{space 2}  10.3838{col 37}{space 1}   -1.13{col 46}{space 3}0.339{col 54}{space 4} -44.8137{col 67}{space 3}  21.2781
{txt}{space 6}lead79 {c |}{col 14}{res}{space 2}-5.374311{col 26}{space 2}  9.92065{col 37}{space 1}   -0.54{col 46}{space 3}0.626{col 54}{space 4}-36.94625{col 67}{space 3} 26.19762
{txt}{space 6}lead78 {c |}{col 14}{res}{space 2}-3.990788{col 26}{space 2} 10.31553{col 37}{space 1}   -0.39{col 46}{space 3}0.725{col 54}{space 4} -36.8194{col 67}{space 3} 28.83782
{txt}{space 6}lead77 {c |}{col 14}{res}{space 2}  6.42252{col 26}{space 2}  6.49055{col 37}{space 1}    0.99{col 46}{space 3}0.395{col 54}{space 4}-14.23331{col 67}{space 3} 27.07835
{txt}{space 6}lead76 {c |}{col 14}{res}{space 2} -3.50586{col 26}{space 2} 6.620775{col 37}{space 1}   -0.53{col 46}{space 3}0.633{col 54}{space 4}-24.57612{col 67}{space 3}  17.5644
{txt}{space 6}lead75 {c |}{col 14}{res}{space 2}-1.866377{col 26}{space 2} 10.99524{col 37}{space 1}   -0.17{col 46}{space 3}0.876{col 54}{space 4}-36.85814{col 67}{space 3} 33.12538
{txt}{space 6}lead74 {c |}{col 14}{res}{space 2} 1.431104{col 26}{space 2} 8.405439{col 37}{space 1}    0.17{col 46}{space 3}0.876{col 54}{space 4}-25.31876{col 67}{space 3} 28.18096
{txt}{space 6}lead73 {c |}{col 14}{res}{space 2} 1.961352{col 26}{space 2} 5.972358{col 37}{space 1}    0.33{col 46}{space 3}0.764{col 54}{space 4}-17.04536{col 67}{space 3} 20.96806
{txt}{space 6}lead72 {c |}{col 14}{res}{space 2} 6.301882{col 26}{space 2} 8.965787{col 37}{space 1}    0.70{col 46}{space 3}0.533{col 54}{space 4}-22.23125{col 67}{space 3} 34.83502
{txt}{space 6}lead71 {c |}{col 14}{res}{space 2} 5.882099{col 26}{space 2}  8.04561{col 37}{space 1}    0.73{col 46}{space 3}0.518{col 54}{space 4}-19.72262{col 67}{space 3} 31.48682
{txt}{space 6}lead70 {c |}{col 14}{res}{space 2}  8.42187{col 26}{space 2} 7.566154{col 37}{space 1}    1.11{col 46}{space 3}0.347{col 54}{space 4}-15.65701{col 67}{space 3} 32.50075
{txt}{space 6}lead69 {c |}{col 14}{res}{space 2} 1.114831{col 26}{space 2} 10.68525{col 37}{space 1}    0.10{col 46}{space 3}0.923{col 54}{space 4}-32.89039{col 67}{space 3} 35.12005
{txt}{space 6}lead68 {c |}{col 14}{res}{space 2}-3.301628{col 26}{space 2} 11.06881{col 37}{space 1}   -0.30{col 46}{space 3}0.785{col 54}{space 4}-38.52754{col 67}{space 3} 31.92428
{txt}{space 6}lead67 {c |}{col 14}{res}{space 2}-3.351078{col 26}{space 2} 12.43534{col 37}{space 1}   -0.27{col 46}{space 3}0.805{col 54}{space 4}-42.92588{col 67}{space 3} 36.22372
{txt}{space 6}lead66 {c |}{col 14}{res}{space 2} 2.098263{col 26}{space 2} 10.95485{col 37}{space 1}    0.19{col 46}{space 3}0.860{col 54}{space 4}-32.76495{col 67}{space 3} 36.96148
{txt}{space 6}lead65 {c |}{col 14}{res}{space 2}-2.207161{col 26}{space 2} 12.84824{col 37}{space 1}   -0.17{col 46}{space 3}0.875{col 54}{space 4}-43.09599{col 67}{space 3} 38.68167
{txt}{space 6}lead64 {c |}{col 14}{res}{space 2} 4.432394{col 26}{space 2}  8.72116{col 37}{space 1}    0.51{col 46}{space 3}0.646{col 54}{space 4}-23.32223{col 67}{space 3} 32.18702
{txt}{space 6}lead63 {c |}{col 14}{res}{space 2} 8.585816{col 26}{space 2} 6.628448{col 37}{space 1}    1.30{col 46}{space 3}0.286{col 54}{space 4}-12.50887{col 67}{space 3}  29.6805
{txt}{space 6}lead62 {c |}{col 14}{res}{space 2}  5.00003{col 26}{space 2} 3.959023{col 37}{space 1}    1.26{col 46}{space 3}0.296{col 54}{space 4}-7.599347{col 67}{space 3} 17.59941
{txt}{space 6}lead61 {c |}{col 14}{res}{space 2} 6.209542{col 26}{space 2} 8.479766{col 37}{space 1}    0.73{col 46}{space 3}0.517{col 54}{space 4}-20.77686{col 67}{space 3} 33.19594
{txt}{space 6}lead60 {c |}{col 14}{res}{space 2} 2.921112{col 26}{space 2} 8.440923{col 37}{space 1}    0.35{col 46}{space 3}0.752{col 54}{space 4}-23.94167{col 67}{space 3}  29.7839
{txt}{space 6}lead59 {c |}{col 14}{res}{space 2}-2.682941{col 26}{space 2} 9.399408{col 37}{space 1}   -0.29{col 46}{space 3}0.794{col 54}{space 4}-32.59605{col 67}{space 3} 27.23017
{txt}{space 6}lead58 {c |}{col 14}{res}{space 2} 1.251195{col 26}{space 2} 9.217893{col 37}{space 1}    0.14{col 46}{space 3}0.901{col 54}{space 4}-28.08425{col 67}{space 3} 30.58664
{txt}{space 6}lead57 {c |}{col 14}{res}{space 2} .9950403{col 26}{space 2} 7.098018{col 37}{space 1}    0.14{col 46}{space 3}0.897{col 54}{space 4}-21.59402{col 67}{space 3}  23.5841
{txt}{space 6}lead56 {c |}{col 14}{res}{space 2}  5.11904{col 26}{space 2}  6.33968{col 37}{space 1}    0.81{col 46}{space 3}0.478{col 54}{space 4}-15.05665{col 67}{space 3} 25.29473
{txt}{space 6}lead55 {c |}{col 14}{res}{space 2} 2.684067{col 26}{space 2} 7.970435{col 37}{space 1}    0.34{col 46}{space 3}0.758{col 54}{space 4}-22.68141{col 67}{space 3} 28.04955
{txt}{space 6}lead54 {c |}{col 14}{res}{space 2} .7585542{col 26}{space 2} 9.624171{col 37}{space 1}    0.08{col 46}{space 3}0.942{col 54}{space 4}-29.86985{col 67}{space 3} 31.38696
{txt}{space 6}lead53 {c |}{col 14}{res}{space 2} .0495992{col 26}{space 2} 8.042364{col 37}{space 1}    0.01{col 46}{space 3}0.995{col 54}{space 4}-25.54479{col 67}{space 3} 25.64399
{txt}{space 6}lead52 {c |}{col 14}{res}{space 2}-3.979537{col 26}{space 2} 14.58828{col 37}{space 1}   -0.27{col 46}{space 3}0.803{col 54}{space 4}-50.40594{col 67}{space 3} 42.44687
{txt}{space 6}lead51 {c |}{col 14}{res}{space 2}-.8344026{col 26}{space 2} 8.369829{col 37}{space 1}   -0.10{col 46}{space 3}0.927{col 54}{space 4}-27.47093{col 67}{space 3} 25.80213
{txt}{space 6}lead50 {c |}{col 14}{res}{space 2} 1.756463{col 26}{space 2} 7.882712{col 37}{space 1}    0.22{col 46}{space 3}0.838{col 54}{space 4}-23.32985{col 67}{space 3} 26.84277
{txt}{space 6}lead49 {c |}{col 14}{res}{space 2}-3.759891{col 26}{space 2} 3.307972{col 37}{space 1}   -1.14{col 46}{space 3}0.338{col 54}{space 4}-14.28733{col 67}{space 3} 6.767551
{txt}{space 6}lead48 {c |}{col 14}{res}{space 2}-7.195568{col 26}{space 2} 5.131487{col 37}{space 1}   -1.40{col 46}{space 3}0.255{col 54}{space 4}-23.52625{col 67}{space 3} 9.135113
{txt}{space 6}lead47 {c |}{col 14}{res}{space 2}-7.025178{col 26}{space 2} 6.500424{col 37}{space 1}   -1.08{col 46}{space 3}0.359{col 54}{space 4}-27.71243{col 67}{space 3} 13.66207
{txt}{space 6}lead46 {c |}{col 14}{res}{space 2} 1.209878{col 26}{space 2} 9.533097{col 37}{space 1}    0.13{col 46}{space 3}0.907{col 54}{space 4}-29.12869{col 67}{space 3} 31.54845
{txt}{space 6}lead45 {c |}{col 14}{res}{space 2} 3.453394{col 26}{space 2} 6.674596{col 37}{space 1}    0.52{col 46}{space 3}0.641{col 54}{space 4}-17.78815{col 67}{space 3} 24.69494
{txt}{space 6}lead44 {c |}{col 14}{res}{space 2} .1772025{col 26}{space 2} 10.82989{col 37}{space 1}    0.02{col 46}{space 3}0.988{col 54}{space 4}-34.28835{col 67}{space 3} 34.64275
{txt}{space 6}lead43 {c |}{col 14}{res}{space 2} -1.50683{col 26}{space 2} 4.118935{col 37}{space 1}   -0.37{col 46}{space 3}0.739{col 54}{space 4}-14.61512{col 67}{space 3} 11.60146
{txt}{space 6}lead42 {c |}{col 14}{res}{space 2} 5.671814{col 26}{space 2} 1.695478{col 37}{space 1}    3.35{col 46}{space 3}0.044{col 54}{space 4} .2760449{col 67}{space 3} 11.06758
{txt}{space 6}lead41 {c |}{col 14}{res}{space 2}-.5104227{col 26}{space 2} 5.302198{col 37}{space 1}   -0.10{col 46}{space 3}0.929{col 54}{space 4}-17.38438{col 67}{space 3} 16.36354
{txt}{space 6}lead40 {c |}{col 14}{res}{space 2}-3.094266{col 26}{space 2} 8.192364{col 37}{space 1}   -0.38{col 46}{space 3}0.731{col 54}{space 4}-29.16603{col 67}{space 3} 22.97749
{txt}{space 6}lead39 {c |}{col 14}{res}{space 2}-1.874818{col 26}{space 2} 9.261243{col 37}{space 1}   -0.20{col 46}{space 3}0.853{col 54}{space 4}-31.34823{col 67}{space 3} 27.59859
{txt}{space 6}lead38 {c |}{col 14}{res}{space 2} 2.473502{col 26}{space 2} 5.697597{col 37}{space 1}    0.43{col 46}{space 3}0.694{col 54}{space 4}-15.65879{col 67}{space 3}  20.6058
{txt}{space 6}lead37 {c |}{col 14}{res}{space 2}  .624643{col 26}{space 2} 6.051863{col 37}{space 1}    0.10{col 46}{space 3}0.924{col 54}{space 4}-18.63509{col 67}{space 3} 19.88437
{txt}{space 6}lead36 {c |}{col 14}{res}{space 2} 2.314693{col 26}{space 2} 6.875348{col 37}{space 1}    0.34{col 46}{space 3}0.759{col 54}{space 4}-19.56573{col 67}{space 3} 24.19512
{txt}{space 6}lead35 {c |}{col 14}{res}{space 2} 10.02927{col 26}{space 2} 5.385591{col 37}{space 1}    1.86{col 46}{space 3}0.159{col 54}{space 4}-7.110086{col 67}{space 3} 27.16862
{txt}{space 6}lead34 {c |}{col 14}{res}{space 2} .0656631{col 26}{space 2} 7.310867{col 37}{space 1}    0.01{col 46}{space 3}0.993{col 54}{space 4}-23.20078{col 67}{space 3} 23.33211
{txt}{space 6}lead33 {c |}{col 14}{res}{space 2} 1.722065{col 26}{space 2} 6.336037{col 37}{space 1}    0.27{col 46}{space 3}0.803{col 54}{space 4}-18.44203{col 67}{space 3} 21.88616
{txt}{space 6}lead32 {c |}{col 14}{res}{space 2} .7893753{col 26}{space 2} 6.515601{col 37}{space 1}    0.12{col 46}{space 3}0.911{col 54}{space 4}-19.94618{col 67}{space 3} 21.52493
{txt}{space 6}lead31 {c |}{col 14}{res}{space 2}-.6195915{col 26}{space 2}  4.75637{col 37}{space 1}   -0.13{col 46}{space 3}0.905{col 54}{space 4}-15.75648{col 67}{space 3}  14.5173
{txt}{space 6}lead30 {c |}{col 14}{res}{space 2} 3.942202{col 26}{space 2} 4.492664{col 37}{space 1}    0.88{col 46}{space 3}0.445{col 54}{space 4}-10.35546{col 67}{space 3} 18.23986
{txt}{space 6}lead29 {c |}{col 14}{res}{space 2} 4.333646{col 26}{space 2} 4.433744{col 37}{space 1}    0.98{col 46}{space 3}0.400{col 54}{space 4}-9.776505{col 67}{space 3}  18.4438
{txt}{space 6}lead28 {c |}{col 14}{res}{space 2} 4.360769{col 26}{space 2} 4.247694{col 37}{space 1}    1.03{col 46}{space 3}0.380{col 54}{space 4}-9.157288{col 67}{space 3} 17.87883
{txt}{space 6}lead27 {c |}{col 14}{res}{space 2} 4.460636{col 26}{space 2} 3.333573{col 37}{space 1}    1.34{col 46}{space 3}0.273{col 54}{space 4} -6.14828{col 67}{space 3} 15.06955
{txt}{space 6}lead26 {c |}{col 14}{res}{space 2}  3.98545{col 26}{space 2} 6.248671{col 37}{space 1}    0.64{col 46}{space 3}0.569{col 54}{space 4}-15.90061{col 67}{space 3} 23.87151
{txt}{space 6}lead25 {c |}{col 14}{res}{space 2} -5.74745{col 26}{space 2} 5.241172{col 37}{space 1}   -1.10{col 46}{space 3}0.353{col 54}{space 4} -22.4272{col 67}{space 3}  10.9323
{txt}{space 6}lead24 {c |}{col 14}{res}{space 2}-2.195588{col 26}{space 2}  4.50678{col 37}{space 1}   -0.49{col 46}{space 3}0.660{col 54}{space 4}-16.53817{col 67}{space 3}   12.147
{txt}{space 6}lead23 {c |}{col 14}{res}{space 2} 1.611335{col 26}{space 2}  4.35704{col 37}{space 1}    0.37{col 46}{space 3}0.736{col 54}{space 4}-12.25471{col 67}{space 3} 15.47738
{txt}{space 6}lead22 {c |}{col 14}{res}{space 2}-3.207787{col 26}{space 2} 3.424735{col 37}{space 1}   -0.94{col 46}{space 3}0.418{col 54}{space 4}-14.10682{col 67}{space 3} 7.691249
{txt}{space 6}lead21 {c |}{col 14}{res}{space 2} .3919208{col 26}{space 2} 2.848851{col 37}{space 1}    0.14{col 46}{space 3}0.899{col 54}{space 4}-8.674395{col 67}{space 3} 9.458237
{txt}{space 6}lead20 {c |}{col 14}{res}{space 2} 2.977836{col 26}{space 2} 3.667457{col 37}{space 1}    0.81{col 46}{space 3}0.476{col 54}{space 4}-8.693648{col 67}{space 3} 14.64932
{txt}{space 6}lead19 {c |}{col 14}{res}{space 2}-3.685141{col 26}{space 2} 2.655773{col 37}{space 1}   -1.39{col 46}{space 3}0.259{col 54}{space 4}  -12.137{col 67}{space 3} 4.766715
{txt}{space 6}lead18 {c |}{col 14}{res}{space 2} 3.715893{col 26}{space 2} 2.276559{col 37}{space 1}    1.63{col 46}{space 3}0.201{col 54}{space 4}-3.529133{col 67}{space 3} 10.96092
{txt}{space 6}lead17 {c |}{col 14}{res}{space 2}-.5820245{col 26}{space 2} 2.313337{col 37}{space 1}   -0.25{col 46}{space 3}0.818{col 54}{space 4}-7.944095{col 67}{space 3} 6.780046
{txt}{space 6}lead16 {c |}{col 14}{res}{space 2}-.6514409{col 26}{space 2} 2.492916{col 37}{space 1}   -0.26{col 46}{space 3}0.811{col 54}{space 4}-8.585012{col 67}{space 3}  7.28213
{txt}{space 6}lead15 {c |}{col 14}{res}{space 2} -7.70935{col 26}{space 2} 1.429781{col 37}{space 1}   -5.39{col 46}{space 3}0.012{col 54}{space 4}-12.25955{col 67}{space 3}-3.159149
{txt}{space 6}lead14 {c |}{col 14}{res}{space 2} -4.45345{col 26}{space 2} 1.997236{col 37}{space 1}   -2.23{col 46}{space 3}0.112{col 54}{space 4}-10.80955{col 67}{space 3} 1.902647
{txt}{space 6}lead13 {c |}{col 14}{res}{space 2} 3.012724{col 26}{space 2} 1.092062{col 37}{space 1}    2.76{col 46}{space 3}0.070{col 54}{space 4}-.4627057{col 67}{space 3} 6.488154
{txt}{space 6}lead12 {c |}{col 14}{res}{space 2}-4.134371{col 26}{space 2} 2.577374{col 37}{space 1}   -1.60{col 46}{space 3}0.207{col 54}{space 4}-12.33673{col 67}{space 3} 4.067984
{txt}{space 6}lead11 {c |}{col 14}{res}{space 2} -3.78611{col 26}{space 2} 2.669353{col 37}{space 1}   -1.42{col 46}{space 3}0.251{col 54}{space 4}-12.28118{col 67}{space 3} 4.708963
{txt}{space 6}lead10 {c |}{col 14}{res}{space 2}-6.434789{col 26}{space 2} 3.415999{col 37}{space 1}   -1.88{col 46}{space 3}0.156{col 54}{space 4}-17.30602{col 67}{space 3} 4.436444
{txt}{space 7}lead9 {c |}{col 14}{res}{space 2}-3.988881{col 26}{space 2} 2.640781{col 37}{space 1}   -1.51{col 46}{space 3}0.228{col 54}{space 4}-12.39302{col 67}{space 3} 4.415262
{txt}{space 7}lead8 {c |}{col 14}{res}{space 2} .8560052{col 26}{space 2} 3.109619{col 37}{space 1}    0.28{col 46}{space 3}0.801{col 54}{space 4} -9.04019{col 67}{space 3}  10.7522
{txt}{space 7}lead7 {c |}{col 14}{res}{space 2} 3.919728{col 26}{space 2} 3.111089{col 37}{space 1}    1.26{col 46}{space 3}0.297{col 54}{space 4}-5.981145{col 67}{space 3}  13.8206
{txt}{space 7}lead6 {c |}{col 14}{res}{space 2}-4.791974{col 26}{space 2} 1.284075{col 37}{space 1}   -3.73{col 46}{space 3}0.034{col 54}{space 4}-8.878475{col 67}{space 3}-.7054735
{txt}{space 7}lead5 {c |}{col 14}{res}{space 2}-9.424232{col 26}{space 2} 3.328051{col 37}{space 1}   -2.83{col 46}{space 3}0.066{col 54}{space 4}-20.01557{col 67}{space 3}  1.16711
{txt}{space 7}lead4 {c |}{col 14}{res}{space 2}-6.269727{col 26}{space 2} 2.457605{col 37}{space 1}   -2.55{col 46}{space 3}0.084{col 54}{space 4}-14.09092{col 67}{space 3} 1.551468
{txt}{space 7}lead3 {c |}{col 14}{res}{space 2}-7.778748{col 26}{space 2} 1.059576{col 37}{space 1}   -7.34{col 46}{space 3}0.005{col 54}{space 4}-11.15079{col 67}{space 3}-4.406705
{txt}{space 7}lead2 {c |}{col 14}{res}{space 2}-2.168221{col 26}{space 2}  3.54543{col 37}{space 1}   -0.61{col 46}{space 3}0.584{col 54}{space 4}-13.45136{col 67}{space 3}  9.11492
{txt}{space 8}lag0 {c |}{col 14}{res}{space 2}-2.488982{col 26}{space 2} 1.769515{col 37}{space 1}   -1.41{col 46}{space 3}0.254{col 54}{space 4}-8.120368{col 67}{space 3} 3.142404
{txt}{space 8}lag1 {c |}{col 14}{res}{space 2}-4.196198{col 26}{space 2} 5.090891{col 37}{space 1}   -0.82{col 46}{space 3}0.470{col 54}{space 4}-20.39768{col 67}{space 3} 12.00529
{txt}{space 8}lag2 {c |}{col 14}{res}{space 2} -3.08241{col 26}{space 2} 2.663435{col 37}{space 1}   -1.16{col 46}{space 3}0.331{col 54}{space 4}-11.55865{col 67}{space 3} 5.393828
{txt}{space 8}lag3 {c |}{col 14}{res}{space 2}-5.838083{col 26}{space 2} 1.221029{col 37}{space 1}   -4.78{col 46}{space 3}0.017{col 54}{space 4}-9.723943{col 67}{space 3}-1.952223
{txt}{space 8}lag4 {c |}{col 14}{res}{space 2} 3.083269{col 26}{space 2}  2.81541{col 37}{space 1}    1.10{col 46}{space 3}0.354{col 54}{space 4}-5.876623{col 67}{space 3} 12.04316
{txt}{space 8}lag5 {c |}{col 14}{res}{space 2} .4113425{col 26}{space 2} 2.390747{col 37}{space 1}    0.17{col 46}{space 3}0.874{col 54}{space 4}-7.197081{col 67}{space 3} 8.019766
{txt}{space 8}lag6 {c |}{col 14}{res}{space 2}-1.007927{col 26}{space 2} 3.611758{col 37}{space 1}   -0.28{col 46}{space 3}0.798{col 54}{space 4}-12.50215{col 67}{space 3}  10.4863
{txt}{space 8}lag7 {c |}{col 14}{res}{space 2}-.1035769{col 26}{space 2} .5877554{col 37}{space 1}   -0.18{col 46}{space 3}0.871{col 54}{space 4}-1.974077{col 67}{space 3} 1.766923
{txt}{space 8}lag8 {c |}{col 14}{res}{space 2}  8.27677{col 26}{space 2} 2.123399{col 37}{space 1}    3.90{col 46}{space 3}0.030{col 54}{space 4} 1.519168{col 67}{space 3} 15.03437
{txt}{space 8}lag9 {c |}{col 14}{res}{space 2}  6.46194{col 26}{space 2} 2.248485{col 37}{space 1}    2.87{col 46}{space 3}0.064{col 54}{space 4}-.6937418{col 67}{space 3} 13.61762
{txt}{space 7}lag10 {c |}{col 14}{res}{space 2}  .324196{col 26}{space 2}  2.18555{col 37}{space 1}    0.15{col 46}{space 3}0.891{col 54}{space 4}-6.631199{col 67}{space 3} 7.279591
{txt}{space 7}lag11 {c |}{col 14}{res}{space 2}-.5910997{col 26}{space 2} .7598066{col 37}{space 1}   -0.78{col 46}{space 3}0.493{col 54}{space 4}-3.009144{col 67}{space 3} 1.826944
{txt}{space 7}lag12 {c |}{col 14}{res}{space 2} 1.102392{col 26}{space 2} 2.141047{col 37}{space 1}    0.51{col 46}{space 3}0.642{col 54}{space 4}-5.711375{col 67}{space 3}  7.91616
{txt}{space 7}lag13 {c |}{col 14}{res}{space 2}  3.43224{col 26}{space 2} 1.113784{col 37}{space 1}    3.08{col 46}{space 3}0.054{col 54}{space 4} -.112318{col 67}{space 3} 6.976799
{txt}{space 7}lag14 {c |}{col 14}{res}{space 2} 1.175342{col 26}{space 2} 1.590376{col 37}{space 1}    0.74{col 46}{space 3}0.513{col 54}{space 4}-3.885944{col 67}{space 3} 6.236629
{txt}{space 7}lag15 {c |}{col 14}{res}{space 2} 1.121021{col 26}{space 2} 3.694912{col 37}{space 1}    0.30{col 46}{space 3}0.781{col 54}{space 4}-10.63784{col 67}{space 3} 12.87988
{txt}{space 7}lag16 {c |}{col 14}{res}{space 2} 3.197949{col 26}{space 2} 3.669966{col 37}{space 1}    0.87{col 46}{space 3}0.448{col 54}{space 4} -8.48152{col 67}{space 3} 14.87742
{txt}{space 7}lag17 {c |}{col 14}{res}{space 2} 7.681881{col 26}{space 2} 3.388992{col 37}{space 1}    2.27{col 46}{space 3}0.108{col 54}{space 4}-3.103404{col 67}{space 3} 18.46717
{txt}{space 7}lag18 {c |}{col 14}{res}{space 2}-1.201796{col 26}{space 2} .8402037{col 37}{space 1}   -1.43{col 46}{space 3}0.248{col 54}{space 4}-3.875699{col 67}{space 3} 1.472107
{txt}{space 7}lag19 {c |}{col 14}{res}{space 2}-3.936427{col 26}{space 2} 1.844043{col 37}{space 1}   -2.13{col 46}{space 3}0.122{col 54}{space 4}-9.804995{col 67}{space 3} 1.932142
{txt}{space 7}lag20 {c |}{col 14}{res}{space 2} 1.837678{col 26}{space 2} 1.349298{col 37}{space 1}    1.36{col 46}{space 3}0.266{col 54}{space 4} -2.45639{col 67}{space 3} 6.131747
{txt}{space 7}lag21 {c |}{col 14}{res}{space 2}-.6163986{col 26}{space 2} 5.182105{col 37}{space 1}   -0.12{col 46}{space 3}0.913{col 54}{space 4}-17.10817{col 67}{space 3} 15.87537
{txt}{space 7}lag22 {c |}{col 14}{res}{space 2}-.4534027{col 26}{space 2}  3.00739{col 37}{space 1}   -0.15{col 46}{space 3}0.890{col 54}{space 4}-10.02426{col 67}{space 3} 9.117456
{txt}{space 7}lag23 {c |}{col 14}{res}{space 2}-.8109703{col 26}{space 2} 3.076658{col 37}{space 1}   -0.26{col 46}{space 3}0.809{col 54}{space 4}-10.60227{col 67}{space 3}  8.98033
{txt}{space 7}lag24 {c |}{col 14}{res}{space 2}-.8875343{col 26}{space 2} 2.747174{col 37}{space 1}   -0.32{col 46}{space 3}0.768{col 54}{space 4}-9.630269{col 67}{space 3}   7.8552
{txt}{space 7}lag25 {c |}{col 14}{res}{space 2}-2.540436{col 26}{space 2} 3.446152{col 37}{space 1}   -0.74{col 46}{space 3}0.514{col 54}{space 4}-13.50763{col 67}{space 3} 8.426759
{txt}{space 7}lag26 {c |}{col 14}{res}{space 2}-1.998064{col 26}{space 2} 4.847958{col 37}{space 1}   -0.41{col 46}{space 3}0.708{col 54}{space 4}-17.42643{col 67}{space 3}  13.4303
{txt}{space 7}lag27 {c |}{col 14}{res}{space 2}-4.828735{col 26}{space 2} 2.147996{col 37}{space 1}   -2.25{col 46}{space 3}0.110{col 54}{space 4}-11.66462{col 67}{space 3} 2.007147
{txt}{space 7}lag28 {c |}{col 14}{res}{space 2}  .714239{col 26}{space 2}  3.45624{col 37}{space 1}    0.21{col 46}{space 3}0.850{col 54}{space 4}-10.28506{col 67}{space 3} 11.71354
{txt}{space 7}lag29 {c |}{col 14}{res}{space 2} 2.891902{col 26}{space 2} 2.870598{col 37}{space 1}    1.01{col 46}{space 3}0.388{col 54}{space 4}-6.243622{col 67}{space 3} 12.02743
{txt}{space 7}lag30 {c |}{col 14}{res}{space 2}-3.045308{col 26}{space 2} 4.207059{col 37}{space 1}   -0.72{col 46}{space 3}0.521{col 54}{space 4}-16.43405{col 67}{space 3} 10.34343
{txt}{space 7}lag31 {c |}{col 14}{res}{space 2}-4.723994{col 26}{space 2} 2.702382{col 37}{space 1}   -1.75{col 46}{space 3}0.179{col 54}{space 4}-13.32418{col 67}{space 3} 3.876192
{txt}{space 7}lag32 {c |}{col 14}{res}{space 2}-1.899511{col 26}{space 2} 1.718061{col 37}{space 1}   -1.11{col 46}{space 3}0.350{col 54}{space 4}-7.367147{col 67}{space 3} 3.568125
{txt}{space 7}lag33 {c |}{col 14}{res}{space 2}-5.656289{col 26}{space 2} 1.874191{col 37}{space 1}   -3.02{col 46}{space 3}0.057{col 54}{space 4} -11.6208{col 67}{space 3} .3082247
{txt}{space 7}lag34 {c |}{col 14}{res}{space 2}-9.219072{col 26}{space 2}  4.77507{col 37}{space 1}   -1.93{col 46}{space 3}0.149{col 54}{space 4}-24.41548{col 67}{space 3} 5.977333
{txt}{space 7}lag35 {c |}{col 14}{res}{space 2}-5.321632{col 26}{space 2} 2.370031{col 37}{space 1}   -2.25{col 46}{space 3}0.110{col 54}{space 4}-12.86413{col 67}{space 3} 2.220863
{txt}{space 7}lag36 {c |}{col 14}{res}{space 2} .7292551{col 26}{space 2} 1.919799{col 37}{space 1}    0.38{col 46}{space 3}0.729{col 54}{space 4}-5.380401{col 67}{space 3} 6.838911
{txt}{space 7}lag37 {c |}{col 14}{res}{space 2} 6.476722{col 26}{space 2} 3.880626{col 37}{space 1}    1.67{col 46}{space 3}0.194{col 54}{space 4}-5.873163{col 67}{space 3} 18.82661
{txt}{space 7}lag38 {c |}{col 14}{res}{space 2}-5.074865{col 26}{space 2} 3.866459{col 37}{space 1}   -1.31{col 46}{space 3}0.281{col 54}{space 4}-17.37966{col 67}{space 3} 7.229935
{txt}{space 7}lag39 {c |}{col 14}{res}{space 2}-7.206742{col 26}{space 2} 3.040119{col 37}{space 1}   -2.37{col 46}{space 3}0.098{col 54}{space 4}-16.88176{col 67}{space 3} 2.468273
{txt}{space 7}lag40 {c |}{col 14}{res}{space 2}-6.298657{col 26}{space 2} 5.310297{col 37}{space 1}   -1.19{col 46}{space 3}0.321{col 54}{space 4}-23.19839{col 67}{space 3} 10.60108
{txt}{space 7}lag41 {c |}{col 14}{res}{space 2}-5.593251{col 26}{space 2} 6.356622{col 37}{space 1}   -0.88{col 46}{space 3}0.444{col 54}{space 4}-25.82286{col 67}{space 3} 14.63636
{txt}{space 7}lag42 {c |}{col 14}{res}{space 2} -3.68229{col 26}{space 2} 6.842331{col 37}{space 1}   -0.54{col 46}{space 3}0.628{col 54}{space 4}-25.45764{col 67}{space 3} 18.09306
{txt}{space 7}lag43 {c |}{col 14}{res}{space 2}-9.485904{col 26}{space 2} 2.440453{col 37}{space 1}   -3.89{col 46}{space 3}0.030{col 54}{space 4}-17.25252{col 67}{space 3}-1.719292
{txt}{space 7}lag44 {c |}{col 14}{res}{space 2}-6.539611{col 26}{space 2} 2.656467{col 37}{space 1}   -2.46{col 46}{space 3}0.091{col 54}{space 4}-14.99367{col 67}{space 3} 1.914452
{txt}{space 7}lag45 {c |}{col 14}{res}{space 2}-1.739195{col 26}{space 2} 2.281523{col 37}{space 1}   -0.76{col 46}{space 3}0.501{col 54}{space 4}-9.000021{col 67}{space 3}  5.52163
{txt}{space 7}lag46 {c |}{col 14}{res}{space 2}-1.791479{col 26}{space 2}    2.079{col 37}{space 1}   -0.86{col 46}{space 3}0.452{col 54}{space 4}-8.407785{col 67}{space 3} 4.824828
{txt}{space 7}lag47 {c |}{col 14}{res}{space 2} 2.272493{col 26}{space 2} 4.266697{col 37}{space 1}    0.53{col 46}{space 3}0.631{col 54}{space 4}-11.30604{col 67}{space 3} 15.85103
{txt}{space 7}lag48 {c |}{col 14}{res}{space 2}-7.431743{col 26}{space 2} 6.522188{col 37}{space 1}   -1.14{col 46}{space 3}0.337{col 54}{space 4}-28.18826{col 67}{space 3} 13.32477
{txt}{space 7}lag49 {c |}{col 14}{res}{space 2}-11.20572{col 26}{space 2} 2.580909{col 37}{space 1}   -4.34{col 46}{space 3}0.023{col 54}{space 4}-19.41932{col 67}{space 3}-2.992111
{txt}{space 7}lag50 {c |}{col 14}{res}{space 2}-12.16694{col 26}{space 2} 2.139303{col 37}{space 1}   -5.69{col 46}{space 3}0.011{col 54}{space 4}-18.97516{col 67}{space 3}-5.358723
{txt}{space 7}lag51 {c |}{col 14}{res}{space 2}-4.443403{col 26}{space 2} 1.792927{col 37}{space 1}   -2.48{col 46}{space 3}0.089{col 54}{space 4} -10.1493{col 67}{space 3} 1.262491
{txt}{space 7}lag52 {c |}{col 14}{res}{space 2}-2.762881{col 26}{space 2} 2.503028{col 37}{space 1}   -1.10{col 46}{space 3}0.350{col 54}{space 4}-10.72863{col 67}{space 3} 5.202873
{txt}{space 7}lag53 {c |}{col 14}{res}{space 2}-9.659939{col 26}{space 2} 5.431531{col 37}{space 1}   -1.78{col 46}{space 3}0.173{col 54}{space 4} -26.9455{col 67}{space 3} 7.625617
{txt}{space 7}lag54 {c |}{col 14}{res}{space 2}-2.475543{col 26}{space 2} 3.724429{col 37}{space 1}   -0.66{col 46}{space 3}0.554{col 54}{space 4}-14.32834{col 67}{space 3} 9.377253
{txt}{space 7}lag55 {c |}{col 14}{res}{space 2}-9.335561{col 26}{space 2} 4.716975{col 37}{space 1}   -1.98{col 46}{space 3}0.142{col 54}{space 4}-24.34708{col 67}{space 3}  5.67596
{txt}{space 7}lag56 {c |}{col 14}{res}{space 2}-.8953338{col 26}{space 2} 2.597156{col 37}{space 1}   -0.34{col 46}{space 3}0.753{col 54}{space 4}-9.160644{col 67}{space 3} 7.369976
{txt}{space 7}lag57 {c |}{col 14}{res}{space 2}-3.194311{col 26}{space 2} 3.102148{col 37}{space 1}   -1.03{col 46}{space 3}0.379{col 54}{space 4}-13.06673{col 67}{space 3} 6.678108
{txt}{space 7}lag58 {c |}{col 14}{res}{space 2}-4.824032{col 26}{space 2} 2.111889{col 37}{space 1}   -2.28{col 46}{space 3}0.107{col 54}{space 4}-11.54501{col 67}{space 3} 1.896941
{txt}{space 7}lag59 {c |}{col 14}{res}{space 2}-1.913734{col 26}{space 2} 2.967218{col 37}{space 1}   -0.64{col 46}{space 3}0.565{col 54}{space 4}-11.35675{col 67}{space 3} 7.529278
{txt}{space 7}lag60 {c |}{col 14}{res}{space 2}-3.223429{col 26}{space 2} 4.626913{col 37}{space 1}   -0.70{col 46}{space 3}0.536{col 54}{space 4}-17.94833{col 67}{space 3} 11.50147
{txt}{space 7}lag61 {c |}{col 14}{res}{space 2}-5.192515{col 26}{space 2}  6.23149{col 37}{space 1}   -0.83{col 46}{space 3}0.466{col 54}{space 4} -25.0239{col 67}{space 3} 14.63887
{txt}{space 7}lag62 {c |}{col 14}{res}{space 2}-7.018233{col 26}{space 2} 4.803004{col 37}{space 1}   -1.46{col 46}{space 3}0.240{col 54}{space 4}-22.30354{col 67}{space 3}  8.26707
{txt}{space 7}lag63 {c |}{col 14}{res}{space 2}-11.44608{col 26}{space 2} 8.381098{col 37}{space 1}   -1.37{col 46}{space 3}0.265{col 54}{space 4}-38.11847{col 67}{space 3} 15.22631
{txt}{space 7}lag64 {c |}{col 14}{res}{space 2}-10.10344{col 26}{space 2} 3.819518{col 37}{space 1}   -2.65{col 46}{space 3}0.077{col 54}{space 4}-22.25885{col 67}{space 3} 2.051967
{txt}{space 7}lag65 {c |}{col 14}{res}{space 2}-19.09195{col 26}{space 2} 4.413612{col 37}{space 1}   -4.33{col 46}{space 3}0.023{col 54}{space 4}-33.13803{col 67}{space 3}-5.045867
{txt}{space 7}lag66 {c |}{col 14}{res}{space 2}-3.404676{col 26}{space 2} 4.594917{col 37}{space 1}   -0.74{col 46}{space 3}0.512{col 54}{space 4}-18.02775{col 67}{space 3}  11.2184
{txt}{space 7}lag67 {c |}{col 14}{res}{space 2} .9332439{col 26}{space 2} 7.776422{col 37}{space 1}    0.12{col 46}{space 3}0.912{col 54}{space 4} -23.8148{col 67}{space 3} 25.68129
{txt}{space 7}lag68 {c |}{col 14}{res}{space 2}-.6870581{col 26}{space 2} 6.590577{col 37}{space 1}   -0.10{col 46}{space 3}0.924{col 54}{space 4}-21.66122{col 67}{space 3}  20.2871
{txt}{space 7}lag69 {c |}{col 14}{res}{space 2}-9.933793{col 26}{space 2} 2.165078{col 37}{space 1}   -4.59{col 46}{space 3}0.019{col 54}{space 4}-16.82404{col 67}{space 3}-3.043548
{txt}{space 7}lag70 {c |}{col 14}{res}{space 2}-8.645093{col 26}{space 2} 4.635024{col 37}{space 1}   -1.87{col 46}{space 3}0.159{col 54}{space 4}-23.39581{col 67}{space 3} 6.105623
{txt}{space 7}lag71 {c |}{col 14}{res}{space 2}-12.89467{col 26}{space 2} 2.914875{col 37}{space 1}   -4.42{col 46}{space 3}0.021{col 54}{space 4} -22.1711{col 67}{space 3}-3.618238
{txt}{space 7}lag72 {c |}{col 14}{res}{space 2}-6.207812{col 26}{space 2} 2.782583{col 37}{space 1}   -2.23{col 46}{space 3}0.112{col 54}{space 4}-15.06323{col 67}{space 3} 2.647609
{txt}{space 7}lag73 {c |}{col 14}{res}{space 2}-2.527101{col 26}{space 2} 6.475021{col 37}{space 1}   -0.39{col 46}{space 3}0.722{col 54}{space 4}-23.13351{col 67}{space 3} 18.07931
{txt}{space 7}lag74 {c |}{col 14}{res}{space 2}-6.626019{col 26}{space 2}  6.28458{col 37}{space 1}   -1.05{col 46}{space 3}0.369{col 54}{space 4}-26.62636{col 67}{space 3} 13.37432
{txt}{space 7}lag75 {c |}{col 14}{res}{space 2}-3.559779{col 26}{space 2} 7.046047{col 37}{space 1}   -0.51{col 46}{space 3}0.648{col 54}{space 4}-25.98344{col 67}{space 3} 18.86389
{txt}{space 7}lag76 {c |}{col 14}{res}{space 2}-8.499756{col 26}{space 2} 4.420365{col 37}{space 1}   -1.92{col 46}{space 3}0.150{col 54}{space 4}-22.56733{col 67}{space 3} 5.567819
{txt}{space 7}lag77 {c |}{col 14}{res}{space 2}-15.02815{col 26}{space 2} 2.550742{col 37}{space 1}   -5.89{col 46}{space 3}0.010{col 54}{space 4}-23.14575{col 67}{space 3}-6.910554
{txt}{space 7}lag78 {c |}{col 14}{res}{space 2}-6.917362{col 26}{space 2} 5.768703{col 37}{space 1}   -1.20{col 46}{space 3}0.317{col 54}{space 4}-25.27595{col 67}{space 3} 11.44123
{txt}{space 7}lag79 {c |}{col 14}{res}{space 2}-5.984743{col 26}{space 2} 5.408988{col 37}{space 1}   -1.11{col 46}{space 3}0.349{col 54}{space 4}-23.19856{col 67}{space 3} 11.22907
{txt}{space 7}lag80 {c |}{col 14}{res}{space 2}-1.567068{col 26}{space 2}   7.0588{col 37}{space 1}   -0.22{col 46}{space 3}0.839{col 54}{space 4}-24.03132{col 67}{space 3} 20.89718
{txt}{space 7}lag81 {c |}{col 14}{res}{space 2}-3.934091{col 26}{space 2} 5.994167{col 37}{space 1}   -0.66{col 46}{space 3}0.558{col 54}{space 4} -23.0102{col 67}{space 3} 15.14202
{txt}{space 7}lag82 {c |}{col 14}{res}{space 2}-9.386419{col 26}{space 2} 4.045844{col 37}{space 1}   -2.32{col 46}{space 3}0.103{col 54}{space 4} -22.2621{col 67}{space 3} 3.489263
{txt}{space 7}lag83 {c |}{col 14}{res}{space 2} 3.638233{col 26}{space 2} 3.828609{col 37}{space 1}    0.95{col 46}{space 3}0.412{col 54}{space 4} -8.54611{col 67}{space 3} 15.82258
{txt}{space 7}lag84 {c |}{col 14}{res}{space 2}-2.387939{col 26}{space 2} 2.902002{col 37}{space 1}   -0.82{col 46}{space 3}0.471{col 54}{space 4} -11.6234{col 67}{space 3} 6.847527
{txt}{space 7}lag85 {c |}{col 14}{res}{space 2} -9.29331{col 26}{space 2} 4.515889{col 37}{space 1}   -2.06{col 46}{space 3}0.132{col 54}{space 4}-23.66488{col 67}{space 3} 5.078264
{txt}{space 7}lag86 {c |}{col 14}{res}{space 2}-10.35674{col 26}{space 2} 4.385255{col 37}{space 1}   -2.36{col 46}{space 3}0.099{col 54}{space 4}-24.31258{col 67}{space 3} 3.599095
{txt}{space 7}lag87 {c |}{col 14}{res}{space 2}-6.733167{col 26}{space 2}  7.20084{col 37}{space 1}   -0.94{col 46}{space 3}0.419{col 54}{space 4}-29.64945{col 67}{space 3} 16.18312
{txt}{space 7}lag88 {c |}{col 14}{res}{space 2} -9.81318{col 26}{space 2} 6.143285{col 37}{space 1}   -1.60{col 46}{space 3}0.208{col 54}{space 4}-29.36385{col 67}{space 3} 9.737495
{txt}{space 7}lag89 {c |}{col 14}{res}{space 2} .8955821{col 26}{space 2}   4.8085{col 37}{space 1}    0.19{col 46}{space 3}0.864{col 54}{space 4}-14.40721{col 67}{space 3} 16.19838
{txt}{space 7}lag90 {c |}{col 14}{res}{space 2}-7.280313{col 26}{space 2} 3.010029{col 37}{space 1}   -2.42{col 46}{space 3}0.094{col 54}{space 4}-16.85957{col 67}{space 3} 2.298942
{txt}{space 7}lag91 {c |}{col 14}{res}{space 2}-13.73718{col 26}{space 2} 4.924485{col 37}{space 1}   -2.79{col 46}{space 3}0.068{col 54}{space 4}-29.40909{col 67}{space 3} 1.934728
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-151.3371{col 26}{space 2} 27.44516{col 37}{space 1}   -5.51{col 46}{space 3}0.012{col 54}{space 4}-238.6799{col 67}{space 3}-63.99438
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}   regionid1{col 14}{c |}{space 1}        4{col 27}{space 1}        4{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}        date{col 14}{c |}{space 1}     5267{col 27}{space 1}        1{col 39}{result}{space 1}     5266{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. graph export "results/EventStudy-MiddayCo2-Dropping-Tasmania.png", replace
{txt}{p 0 4 2}
file {bf}
results/EventStudy-MiddayCo2-Dropping-Tasmania.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. eventdd energy_wh_per_capita_vs_midday public_holiday /// 
> c.temperature##c.temperature solar_exposure wind_3  [aweight = population], ///
>  timevar(timevar) method(hdfe, absorb(regionid1 date) cluster(regionid1)) ///
>  graph_op(ytitle("Wh energy p.c.") xtitle("Days until DST transition") /// 
>  title("Event Study - Energy - Midday - w/o Tasmania"))
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}{txt}warning: missing F statistic; dropped variables due to collinearity or too few clusters
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,011,258
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F( 190,      3)}{col 67}=          {res}.
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.3069
{txt}{col 51}Adj R-squared{col 67}= {res}    0.3031
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0252
{txt}{col 1}Number of clusters ({res}regionid1{txt}) {col 30}= {res}         4{txt}{col 51}Root MSE{col 67}= {res}   65.7192

{txt}{ralign 78:(Std. err. adjusted for {res:4} clusters in {res:regionid1})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}energy_wh_~y{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
public_hol~y {c |}{col 14}{res}{space 2} 14.88672{col 26}{space 2} 2.666032{col 37}{space 1}    5.58{col 46}{space 3}0.011{col 54}{space 4} 6.402211{col 67}{space 3} 23.37122
{txt}{space 1}temperature {c |}{col 14}{res}{space 2} 14.09735{col 26}{space 2} 1.284255{col 37}{space 1}   10.98{col 46}{space 3}0.002{col 54}{space 4} 10.01028{col 67}{space 3} 18.18442
{txt}{space 12} {c |}
{space 10}c. {c |}
{space 1}temperature#{c |}
{space 10}c. {c |}
{space 1}temperature {c |}{col 14}{res}{space 2}-.2908439{col 26}{space 2} .0205095{col 37}{space 1}  -14.18{col 46}{space 3}0.001{col 54}{space 4}-.3561142{col 67}{space 3}-.2255735
{txt}{space 12} {c |}
solar_expo~e {c |}{col 14}{res}{space 2} 3.203342{col 26}{space 2} .7922112{col 37}{space 1}    4.04{col 46}{space 3}0.027{col 54}{space 4} .6821724{col 67}{space 3} 5.724511
{txt}{space 6}wind_3 {c |}{col 14}{res}{space 2}-2.565854{col 26}{space 2} 1.487963{col 37}{space 1}   -1.72{col 46}{space 3}0.183{col 54}{space 4}-7.301214{col 67}{space 3} 2.169507
{txt}{space 6}lead94 {c |}{col 14}{res}{space 2} 4.697286{col 26}{space 2} 18.86736{col 37}{space 1}    0.25{col 46}{space 3}0.819{col 54}{space 4}-55.34707{col 67}{space 3} 64.74164
{txt}{space 6}lead93 {c |}{col 14}{res}{space 2}-4.122568{col 26}{space 2} 5.266539{col 37}{space 1}   -0.78{col 46}{space 3}0.491{col 54}{space 4}-20.88305{col 67}{space 3} 12.63791
{txt}{space 6}lead92 {c |}{col 14}{res}{space 2}  11.2644{col 26}{space 2} 5.491006{col 37}{space 1}    2.05{col 46}{space 3}0.133{col 54}{space 4}-6.210433{col 67}{space 3} 28.73923
{txt}{space 6}lead91 {c |}{col 14}{res}{space 2}   11.955{col 26}{space 2} 10.44376{col 37}{space 1}    1.14{col 46}{space 3}0.335{col 54}{space 4}-21.28171{col 67}{space 3}  45.1917
{txt}{space 6}lead90 {c |}{col 14}{res}{space 2} 7.424887{col 26}{space 2} 8.116331{col 37}{space 1}    0.91{col 46}{space 3}0.428{col 54}{space 4} -18.4049{col 67}{space 3} 33.25467
{txt}{space 6}lead89 {c |}{col 14}{res}{space 2} 3.797661{col 26}{space 2} 9.055472{col 37}{space 1}    0.42{col 46}{space 3}0.703{col 54}{space 4}-25.02089{col 67}{space 3} 32.61622
{txt}{space 6}lead88 {c |}{col 14}{res}{space 2} 11.72231{col 26}{space 2} 6.279499{col 37}{space 1}    1.87{col 46}{space 3}0.159{col 54}{space 4}-8.261859{col 67}{space 3} 31.70648
{txt}{space 6}lead87 {c |}{col 14}{res}{space 2} 5.428471{col 26}{space 2} 9.253113{col 37}{space 1}    0.59{col 46}{space 3}0.599{col 54}{space 4}-24.01906{col 67}{space 3} 34.87601
{txt}{space 6}lead86 {c |}{col 14}{res}{space 2} .7814649{col 26}{space 2} 8.347497{col 37}{space 1}    0.09{col 46}{space 3}0.931{col 54}{space 4}  -25.784{col 67}{space 3} 27.34693
{txt}{space 6}lead85 {c |}{col 14}{res}{space 2}-1.055104{col 26}{space 2} 9.960371{col 37}{space 1}   -0.11{col 46}{space 3}0.922{col 54}{space 4}-32.75345{col 67}{space 3} 30.64324
{txt}{space 6}lead84 {c |}{col 14}{res}{space 2}  12.0555{col 26}{space 2} 10.29941{col 37}{space 1}    1.17{col 46}{space 3}0.326{col 54}{space 4}-20.72181{col 67}{space 3} 44.83281
{txt}{space 6}lead83 {c |}{col 14}{res}{space 2}  2.32996{col 26}{space 2}  8.10767{col 37}{space 1}    0.29{col 46}{space 3}0.793{col 54}{space 4}-23.47226{col 67}{space 3} 28.13218
{txt}{space 6}lead82 {c |}{col 14}{res}{space 2} -.079747{col 26}{space 2} 7.080776{col 37}{space 1}   -0.01{col 46}{space 3}0.992{col 54}{space 4}-22.61393{col 67}{space 3} 22.45444
{txt}{space 6}lead81 {c |}{col 14}{res}{space 2}-5.795238{col 26}{space 2}  5.48443{col 37}{space 1}   -1.06{col 46}{space 3}0.368{col 54}{space 4}-23.24914{col 67}{space 3} 11.65867
{txt}{space 6}lead80 {c |}{col 14}{res}{space 2}-11.83048{col 26}{space 2} 8.495736{col 37}{space 1}   -1.39{col 46}{space 3}0.258{col 54}{space 4} -38.8677{col 67}{space 3} 15.20675
{txt}{space 6}lead79 {c |}{col 14}{res}{space 2}-2.825843{col 26}{space 2} 8.772123{col 37}{space 1}   -0.32{col 46}{space 3}0.768{col 54}{space 4}-30.74265{col 67}{space 3} 25.09097
{txt}{space 6}lead78 {c |}{col 14}{res}{space 2} .3540471{col 26}{space 2} 7.862823{col 37}{space 1}    0.05{col 46}{space 3}0.967{col 54}{space 4}-24.66897{col 67}{space 3} 25.37706
{txt}{space 6}lead77 {c |}{col 14}{res}{space 2} 11.91244{col 26}{space 2} 4.205383{col 37}{space 1}    2.83{col 46}{space 3}0.066{col 54}{space 4}-1.470965{col 67}{space 3} 25.29585
{txt}{space 6}lead76 {c |}{col 14}{res}{space 2} 2.042723{col 26}{space 2} 6.432945{col 37}{space 1}    0.32{col 46}{space 3}0.772{col 54}{space 4}-18.42978{col 67}{space 3} 22.51522
{txt}{space 6}lead75 {c |}{col 14}{res}{space 2} 1.157056{col 26}{space 2} 11.89244{col 37}{space 1}    0.10{col 46}{space 3}0.929{col 54}{space 4}-36.68998{col 67}{space 3}  39.0041
{txt}{space 6}lead74 {c |}{col 14}{res}{space 2} 1.029158{col 26}{space 2}  11.1451{col 37}{space 1}    0.09{col 46}{space 3}0.932{col 54}{space 4}-34.43952{col 67}{space 3} 36.49784
{txt}{space 6}lead73 {c |}{col 14}{res}{space 2} 3.386321{col 26}{space 2}  8.98085{col 37}{space 1}    0.38{col 46}{space 3}0.731{col 54}{space 4}-25.19475{col 67}{space 3} 31.96739
{txt}{space 6}lead72 {c |}{col 14}{res}{space 2} 8.770064{col 26}{space 2} 9.323358{col 37}{space 1}    0.94{col 46}{space 3}0.416{col 54}{space 4}-20.90102{col 67}{space 3} 38.44115
{txt}{space 6}lead71 {c |}{col 14}{res}{space 2} 10.30628{col 26}{space 2} 7.072621{col 37}{space 1}    1.46{col 46}{space 3}0.241{col 54}{space 4}-12.20196{col 67}{space 3} 32.81452
{txt}{space 6}lead70 {c |}{col 14}{res}{space 2} 12.81522{col 26}{space 2} 6.366901{col 37}{space 1}    2.01{col 46}{space 3}0.138{col 54}{space 4}-7.447104{col 67}{space 3} 33.07754
{txt}{space 6}lead69 {c |}{col 14}{res}{space 2} 4.187874{col 26}{space 2} 10.75758{col 37}{space 1}    0.39{col 46}{space 3}0.723{col 54}{space 4}-30.04756{col 67}{space 3}  38.4233
{txt}{space 6}lead68 {c |}{col 14}{res}{space 2}-1.953755{col 26}{space 2} 11.12365{col 37}{space 1}   -0.18{col 46}{space 3}0.872{col 54}{space 4}-37.35417{col 67}{space 3} 33.44666
{txt}{space 6}lead67 {c |}{col 14}{res}{space 2}-1.785314{col 26}{space 2} 12.80499{col 37}{space 1}   -0.14{col 46}{space 3}0.898{col 54}{space 4}-42.53652{col 67}{space 3} 38.96589
{txt}{space 6}lead66 {c |}{col 14}{res}{space 2}-1.456768{col 26}{space 2}  12.1294{col 37}{space 1}   -0.12{col 46}{space 3}0.912{col 54}{space 4}-40.05794{col 67}{space 3} 37.14441
{txt}{space 6}lead65 {c |}{col 14}{res}{space 2}-.3742944{col 26}{space 2} 11.77711{col 37}{space 1}   -0.03{col 46}{space 3}0.977{col 54}{space 4}-37.85431{col 67}{space 3} 37.10573
{txt}{space 6}lead64 {c |}{col 14}{res}{space 2} 3.559763{col 26}{space 2} 7.521313{col 37}{space 1}    0.47{col 46}{space 3}0.668{col 54}{space 4}-20.37641{col 67}{space 3} 27.49594
{txt}{space 6}lead63 {c |}{col 14}{res}{space 2} 12.13564{col 26}{space 2} 5.962461{col 37}{space 1}    2.04{col 46}{space 3}0.135{col 54}{space 4}-6.839569{col 67}{space 3} 31.11085
{txt}{space 6}lead62 {c |}{col 14}{res}{space 2} 5.203352{col 26}{space 2}  3.68798{col 37}{space 1}    1.41{col 46}{space 3}0.253{col 54}{space 4}-6.533446{col 67}{space 3} 16.94015
{txt}{space 6}lead61 {c |}{col 14}{res}{space 2} 7.328015{col 26}{space 2} 7.301209{col 37}{space 1}    1.00{col 46}{space 3}0.389{col 54}{space 4}-15.90769{col 67}{space 3} 30.56372
{txt}{space 6}lead60 {c |}{col 14}{res}{space 2} 7.158505{col 26}{space 2} 9.153507{col 37}{space 1}    0.78{col 46}{space 3}0.491{col 54}{space 4}-21.97204{col 67}{space 3} 36.28905
{txt}{space 6}lead59 {c |}{col 14}{res}{space 2} 2.442206{col 26}{space 2} 10.95298{col 37}{space 1}    0.22{col 46}{space 3}0.838{col 54}{space 4}-32.41505{col 67}{space 3} 37.29946
{txt}{space 6}lead58 {c |}{col 14}{res}{space 2} 2.758556{col 26}{space 2} 12.67678{col 37}{space 1}    0.22{col 46}{space 3}0.842{col 54}{space 4}-37.58462{col 67}{space 3} 43.10174
{txt}{space 6}lead57 {c |}{col 14}{res}{space 2} 1.069826{col 26}{space 2} 8.779589{col 37}{space 1}    0.12{col 46}{space 3}0.911{col 54}{space 4}-26.87074{col 67}{space 3}  29.0104
{txt}{space 6}lead56 {c |}{col 14}{res}{space 2} 11.74168{col 26}{space 2} 5.629158{col 37}{space 1}    2.09{col 46}{space 3}0.128{col 54}{space 4}-6.172809{col 67}{space 3} 29.65617
{txt}{space 6}lead55 {c |}{col 14}{res}{space 2} 7.925995{col 26}{space 2} 6.500691{col 37}{space 1}    1.22{col 46}{space 3}0.310{col 54}{space 4} -12.7621{col 67}{space 3} 28.61409
{txt}{space 6}lead54 {c |}{col 14}{res}{space 2} 5.364982{col 26}{space 2} 8.864514{col 37}{space 1}    0.61{col 46}{space 3}0.588{col 54}{space 4}-22.84586{col 67}{space 3} 33.57582
{txt}{space 6}lead53 {c |}{col 14}{res}{space 2}-.5260311{col 26}{space 2} 8.803202{col 37}{space 1}   -0.06{col 46}{space 3}0.956{col 54}{space 4}-28.54175{col 67}{space 3} 27.48969
{txt}{space 6}lead52 {c |}{col 14}{res}{space 2}-2.942622{col 26}{space 2} 11.50831{col 37}{space 1}   -0.26{col 46}{space 3}0.815{col 54}{space 4}-39.56722{col 67}{space 3} 33.68197
{txt}{space 6}lead51 {c |}{col 14}{res}{space 2}-6.616972{col 26}{space 2} 9.952926{col 37}{space 1}   -0.66{col 46}{space 3}0.554{col 54}{space 4}-38.29162{col 67}{space 3} 25.05768
{txt}{space 6}lead50 {c |}{col 14}{res}{space 2}  3.40136{col 26}{space 2} 5.339517{col 37}{space 1}    0.64{col 46}{space 3}0.569{col 54}{space 4}-13.59137{col 67}{space 3} 20.39409
{txt}{space 6}lead49 {c |}{col 14}{res}{space 2}-3.038441{col 26}{space 2} 3.649629{col 37}{space 1}   -0.83{col 46}{space 3}0.466{col 54}{space 4}-14.65319{col 67}{space 3} 8.576308
{txt}{space 6}lead48 {c |}{col 14}{res}{space 2}-7.418222{col 26}{space 2}  4.66221{col 37}{space 1}   -1.59{col 46}{space 3}0.210{col 54}{space 4}-22.25545{col 67}{space 3} 7.419011
{txt}{space 6}lead47 {c |}{col 14}{res}{space 2}-9.506284{col 26}{space 2} 7.100711{col 37}{space 1}   -1.34{col 46}{space 3}0.273{col 54}{space 4}-32.10392{col 67}{space 3} 13.09135
{txt}{space 6}lead46 {c |}{col 14}{res}{space 2}  1.90741{col 26}{space 2} 9.492164{col 37}{space 1}    0.20{col 46}{space 3}0.854{col 54}{space 4}-28.30089{col 67}{space 3} 32.11571
{txt}{space 6}lead45 {c |}{col 14}{res}{space 2} .2223966{col 26}{space 2} 6.188785{col 37}{space 1}    0.04{col 46}{space 3}0.974{col 54}{space 4}-19.47308{col 67}{space 3} 19.91787
{txt}{space 6}lead44 {c |}{col 14}{res}{space 2}-3.440816{col 26}{space 2} 8.414976{col 37}{space 1}   -0.41{col 46}{space 3}0.710{col 54}{space 4}-30.22103{col 67}{space 3}  23.3394
{txt}{space 6}lead43 {c |}{col 14}{res}{space 2} -3.91164{col 26}{space 2} 5.785638{col 37}{space 1}   -0.68{col 46}{space 3}0.547{col 54}{space 4}-22.32412{col 67}{space 3} 14.50084
{txt}{space 6}lead42 {c |}{col 14}{res}{space 2}  4.41706{col 26}{space 2} 2.352841{col 37}{space 1}    1.88{col 46}{space 3}0.157{col 54}{space 4}-3.070732{col 67}{space 3} 11.90485
{txt}{space 6}lead41 {c |}{col 14}{res}{space 2} 2.266319{col 26}{space 2} 3.192106{col 37}{space 1}    0.71{col 46}{space 3}0.529{col 54}{space 4}-7.892386{col 67}{space 3} 12.42502
{txt}{space 6}lead40 {c |}{col 14}{res}{space 2} 1.945453{col 26}{space 2} 6.327615{col 37}{space 1}    0.31{col 46}{space 3}0.779{col 54}{space 4}-18.19184{col 67}{space 3} 22.08275
{txt}{space 6}lead39 {c |}{col 14}{res}{space 2}-5.955949{col 26}{space 2} 9.270969{col 37}{space 1}   -0.64{col 46}{space 3}0.566{col 54}{space 4}-35.46031{col 67}{space 3} 23.54841
{txt}{space 6}lead38 {c |}{col 14}{res}{space 2} 2.831873{col 26}{space 2}  7.81423{col 37}{space 1}    0.36{col 46}{space 3}0.741{col 54}{space 4}-22.03649{col 67}{space 3} 27.70024
{txt}{space 6}lead37 {c |}{col 14}{res}{space 2} 2.172088{col 26}{space 2} 6.386298{col 37}{space 1}    0.34{col 46}{space 3}0.756{col 54}{space 4}-18.15196{col 67}{space 3} 22.49614
{txt}{space 6}lead36 {c |}{col 14}{res}{space 2} .4136793{col 26}{space 2} 4.922883{col 37}{space 1}    0.08{col 46}{space 3}0.938{col 54}{space 4}-15.25313{col 67}{space 3} 16.08049
{txt}{space 6}lead35 {c |}{col 14}{res}{space 2} 10.74804{col 26}{space 2} 6.224514{col 37}{space 1}    1.73{col 46}{space 3}0.183{col 54}{space 4}-9.061139{col 67}{space 3} 30.55722
{txt}{space 6}lead34 {c |}{col 14}{res}{space 2}-.0341727{col 26}{space 2}  7.53277{col 37}{space 1}   -0.00{col 46}{space 3}0.997{col 54}{space 4}-24.00681{col 67}{space 3} 23.93846
{txt}{space 6}lead33 {c |}{col 14}{res}{space 2} -2.92019{col 26}{space 2} 8.470808{col 37}{space 1}   -0.34{col 46}{space 3}0.753{col 54}{space 4}-29.87808{col 67}{space 3}  24.0377
{txt}{space 6}lead32 {c |}{col 14}{res}{space 2} 1.415117{col 26}{space 2} 6.258758{col 37}{space 1}    0.23{col 46}{space 3}0.836{col 54}{space 4}-18.50304{col 67}{space 3} 21.33328
{txt}{space 6}lead31 {c |}{col 14}{res}{space 2}-.9569626{col 26}{space 2} 4.430539{col 37}{space 1}   -0.22{col 46}{space 3}0.843{col 54}{space 4}-15.05692{col 67}{space 3} 13.14299
{txt}{space 6}lead30 {c |}{col 14}{res}{space 2} 2.667984{col 26}{space 2} 4.701228{col 37}{space 1}    0.57{col 46}{space 3}0.610{col 54}{space 4}-12.29342{col 67}{space 3} 17.62939
{txt}{space 6}lead29 {c |}{col 14}{res}{space 2} 5.943471{col 26}{space 2} 4.172312{col 37}{space 1}    1.42{col 46}{space 3}0.250{col 54}{space 4} -7.33469{col 67}{space 3} 19.22163
{txt}{space 6}lead28 {c |}{col 14}{res}{space 2} 8.267643{col 26}{space 2} 2.643602{col 37}{space 1}    3.13{col 46}{space 3}0.052{col 54}{space 4}-.1454788{col 67}{space 3} 16.68076
{txt}{space 6}lead27 {c |}{col 14}{res}{space 2} 5.133016{col 26}{space 2} 3.300938{col 37}{space 1}    1.56{col 46}{space 3}0.218{col 54}{space 4} -5.37204{col 67}{space 3} 15.63807
{txt}{space 6}lead26 {c |}{col 14}{res}{space 2}  -.24365{col 26}{space 2} 6.069077{col 37}{space 1}   -0.04{col 46}{space 3}0.970{col 54}{space 4}-19.55816{col 67}{space 3} 19.07086
{txt}{space 6}lead25 {c |}{col 14}{res}{space 2}-3.974167{col 26}{space 2} 3.941426{col 37}{space 1}   -1.01{col 46}{space 3}0.388{col 54}{space 4}-16.51754{col 67}{space 3} 8.569209
{txt}{space 6}lead24 {c |}{col 14}{res}{space 2}-1.864693{col 26}{space 2} 4.696423{col 37}{space 1}   -0.40{col 46}{space 3}0.718{col 54}{space 4}-16.81081{col 67}{space 3} 13.08142
{txt}{space 6}lead23 {c |}{col 14}{res}{space 2} 1.879889{col 26}{space 2} 5.166254{col 37}{space 1}    0.36{col 46}{space 3}0.740{col 54}{space 4}-14.56144{col 67}{space 3} 18.32122
{txt}{space 6}lead22 {c |}{col 14}{res}{space 2}-2.964474{col 26}{space 2} 3.517927{col 37}{space 1}   -0.84{col 46}{space 3}0.461{col 54}{space 4}-14.16009{col 67}{space 3} 8.231141
{txt}{space 6}lead21 {c |}{col 14}{res}{space 2} 2.427805{col 26}{space 2} 3.017025{col 37}{space 1}    0.80{col 46}{space 3}0.480{col 54}{space 4}-7.173716{col 67}{space 3} 12.02933
{txt}{space 6}lead20 {c |}{col 14}{res}{space 2} 4.476242{col 26}{space 2} 3.382776{col 37}{space 1}    1.32{col 46}{space 3}0.278{col 54}{space 4}-6.289261{col 67}{space 3} 15.24175
{txt}{space 6}lead19 {c |}{col 14}{res}{space 2}-3.492262{col 26}{space 2} 1.621523{col 37}{space 1}   -2.15{col 46}{space 3}0.120{col 54}{space 4}-8.652672{col 67}{space 3} 1.668148
{txt}{space 6}lead18 {c |}{col 14}{res}{space 2} .3077134{col 26}{space 2} 2.505339{col 37}{space 1}    0.12{col 46}{space 3}0.910{col 54}{space 4}-7.665393{col 67}{space 3}  8.28082
{txt}{space 6}lead17 {c |}{col 14}{res}{space 2} -2.68387{col 26}{space 2} 2.629175{col 37}{space 1}   -1.02{col 46}{space 3}0.382{col 54}{space 4}-11.05108{col 67}{space 3} 5.683337
{txt}{space 6}lead16 {c |}{col 14}{res}{space 2}-3.883045{col 26}{space 2} 5.201191{col 37}{space 1}   -0.75{col 46}{space 3}0.510{col 54}{space 4}-20.43555{col 67}{space 3} 12.66947
{txt}{space 6}lead15 {c |}{col 14}{res}{space 2} -5.37989{col 26}{space 2} 3.352823{col 37}{space 1}   -1.60{col 46}{space 3}0.207{col 54}{space 4}-16.05007{col 67}{space 3} 5.290288
{txt}{space 6}lead14 {c |}{col 14}{res}{space 2}-4.965355{col 26}{space 2}  2.42249{col 37}{space 1}   -2.05{col 46}{space 3}0.133{col 54}{space 4} -12.6748{col 67}{space 3}  2.74409
{txt}{space 6}lead13 {c |}{col 14}{res}{space 2}-.0813181{col 26}{space 2} 2.502023{col 37}{space 1}   -0.03{col 46}{space 3}0.976{col 54}{space 4}-8.043873{col 67}{space 3} 7.881237
{txt}{space 6}lead12 {c |}{col 14}{res}{space 2}  -2.3383{col 26}{space 2} 2.896986{col 37}{space 1}   -0.81{col 46}{space 3}0.479{col 54}{space 4} -11.5578{col 67}{space 3} 6.881202
{txt}{space 6}lead11 {c |}{col 14}{res}{space 2}-4.772837{col 26}{space 2} 4.761834{col 37}{space 1}   -1.00{col 46}{space 3}0.390{col 54}{space 4}-19.92712{col 67}{space 3} 10.38144
{txt}{space 6}lead10 {c |}{col 14}{res}{space 2}-5.033851{col 26}{space 2} 2.409331{col 37}{space 1}   -2.09{col 46}{space 3}0.128{col 54}{space 4}-12.70142{col 67}{space 3} 2.633715
{txt}{space 7}lead9 {c |}{col 14}{res}{space 2}-.9796543{col 26}{space 2} 3.735964{col 37}{space 1}   -0.26{col 46}{space 3}0.810{col 54}{space 4}-12.86916{col 67}{space 3} 10.90985
{txt}{space 7}lead8 {c |}{col 14}{res}{space 2} 3.450736{col 26}{space 2} 3.365746{col 37}{space 1}    1.03{col 46}{space 3}0.381{col 54}{space 4} -7.26057{col 67}{space 3} 14.16204
{txt}{space 7}lead7 {c |}{col 14}{res}{space 2} 4.684739{col 26}{space 2} 1.733797{col 37}{space 1}    2.70{col 46}{space 3}0.074{col 54}{space 4}-.8329765{col 67}{space 3} 10.20245
{txt}{space 7}lead6 {c |}{col 14}{res}{space 2} -5.07853{col 26}{space 2}  1.43981{col 37}{space 1}   -3.53{col 46}{space 3}0.039{col 54}{space 4}-9.660649{col 67}{space 3}-.4964113
{txt}{space 7}lead5 {c |}{col 14}{res}{space 2}-9.958426{col 26}{space 2} 3.218334{col 37}{space 1}   -3.09{col 46}{space 3}0.054{col 54}{space 4} -20.2006{col 67}{space 3} .2837491
{txt}{space 7}lead4 {c |}{col 14}{res}{space 2}-9.075876{col 26}{space 2} 2.943274{col 37}{space 1}   -3.08{col 46}{space 3}0.054{col 54}{space 4}-18.44269{col 67}{space 3} .2909352
{txt}{space 7}lead3 {c |}{col 14}{res}{space 2}-5.994598{col 26}{space 2} 2.637583{col 37}{space 1}   -2.27{col 46}{space 3}0.108{col 54}{space 4}-14.38857{col 67}{space 3} 2.399369
{txt}{space 7}lead2 {c |}{col 14}{res}{space 2} .4894336{col 26}{space 2} 1.384192{col 37}{space 1}    0.35{col 46}{space 3}0.747{col 54}{space 4}-3.915683{col 67}{space 3}  4.89455
{txt}{space 8}lag0 {c |}{col 14}{res}{space 2}  1.03371{col 26}{space 2} 1.683657{col 37}{space 1}    0.61{col 46}{space 3}0.583{col 54}{space 4}-4.324438{col 67}{space 3} 6.391858
{txt}{space 8}lag1 {c |}{col 14}{res}{space 2}-2.543395{col 26}{space 2} 3.979942{col 37}{space 1}   -0.64{col 46}{space 3}0.568{col 54}{space 4}-15.20935{col 67}{space 3} 10.12256
{txt}{space 8}lag2 {c |}{col 14}{res}{space 2}-1.414133{col 26}{space 2} 4.291033{col 37}{space 1}   -0.33{col 46}{space 3}0.763{col 54}{space 4}-15.07012{col 67}{space 3} 12.24185
{txt}{space 8}lag3 {c |}{col 14}{res}{space 2}  -1.8913{col 26}{space 2} 1.475294{col 37}{space 1}   -1.28{col 46}{space 3}0.290{col 54}{space 4}-6.586344{col 67}{space 3} 2.803744
{txt}{space 8}lag4 {c |}{col 14}{res}{space 2}-.1267515{col 26}{space 2} 2.513094{col 37}{space 1}   -0.05{col 46}{space 3}0.963{col 54}{space 4}-8.124539{col 67}{space 3} 7.871037
{txt}{space 8}lag5 {c |}{col 14}{res}{space 2} 2.736938{col 26}{space 2} 2.008208{col 37}{space 1}    1.36{col 46}{space 3}0.266{col 54}{space 4}-3.654077{col 67}{space 3} 9.127954
{txt}{space 8}lag6 {c |}{col 14}{res}{space 2} 1.716082{col 26}{space 2} 1.178765{col 37}{space 1}    1.46{col 46}{space 3}0.241{col 54}{space 4}-2.035273{col 67}{space 3} 5.467438
{txt}{space 8}lag7 {c |}{col 14}{res}{space 2} 5.312627{col 26}{space 2}  .845516{col 37}{space 1}    6.28{col 46}{space 3}0.008{col 54}{space 4} 2.621818{col 67}{space 3} 8.003436
{txt}{space 8}lag8 {c |}{col 14}{res}{space 2} 6.936796{col 26}{space 2} 2.005254{col 37}{space 1}    3.46{col 46}{space 3}0.041{col 54}{space 4} .5551843{col 67}{space 3} 13.31841
{txt}{space 8}lag9 {c |}{col 14}{res}{space 2} 6.990949{col 26}{space 2} 1.485882{col 37}{space 1}    4.70{col 46}{space 3}0.018{col 54}{space 4} 2.262209{col 67}{space 3} 11.71969
{txt}{space 7}lag10 {c |}{col 14}{res}{space 2} 4.005386{col 26}{space 2}  1.24437{col 37}{space 1}    3.22{col 46}{space 3}0.049{col 54}{space 4} .0452453{col 67}{space 3} 7.965527
{txt}{space 7}lag11 {c |}{col 14}{res}{space 2}-1.018858{col 26}{space 2} 2.271645{col 37}{space 1}   -0.45{col 46}{space 3}0.684{col 54}{space 4}-8.248248{col 67}{space 3} 6.210531
{txt}{space 7}lag12 {c |}{col 14}{res}{space 2} .1762434{col 26}{space 2} 1.191444{col 37}{space 1}    0.15{col 46}{space 3}0.892{col 54}{space 4}-3.615463{col 67}{space 3}  3.96795
{txt}{space 7}lag13 {c |}{col 14}{res}{space 2} .6763465{col 26}{space 2} 2.149072{col 37}{space 1}    0.31{col 46}{space 3}0.774{col 54}{space 4}-6.162959{col 67}{space 3} 7.515652
{txt}{space 7}lag14 {c |}{col 14}{res}{space 2} 5.081789{col 26}{space 2} 1.924522{col 37}{space 1}    2.64{col 46}{space 3}0.078{col 54}{space 4}-1.042897{col 67}{space 3} 11.20648
{txt}{space 7}lag15 {c |}{col 14}{res}{space 2} 6.750337{col 26}{space 2}  2.59438{col 37}{space 1}    2.60{col 46}{space 3}0.080{col 54}{space 4}-1.506139{col 67}{space 3} 15.00681
{txt}{space 7}lag16 {c |}{col 14}{res}{space 2} 8.415447{col 26}{space 2} 2.711401{col 37}{space 1}    3.10{col 46}{space 3}0.053{col 54}{space 4}-.2134397{col 67}{space 3} 17.04433
{txt}{space 7}lag17 {c |}{col 14}{res}{space 2} 10.22654{col 26}{space 2} 3.051055{col 37}{space 1}    3.35{col 46}{space 3}0.044{col 54}{space 4}  .516719{col 67}{space 3} 19.93635
{txt}{space 7}lag18 {c |}{col 14}{res}{space 2} 1.780929{col 26}{space 2} 2.331594{col 37}{space 1}    0.76{col 46}{space 3}0.501{col 54}{space 4}-5.639244{col 67}{space 3} 9.201103
{txt}{space 7}lag19 {c |}{col 14}{res}{space 2} -1.13571{col 26}{space 2} 3.078193{col 37}{space 1}   -0.37{col 46}{space 3}0.737{col 54}{space 4}-10.93189{col 67}{space 3} 8.660473
{txt}{space 7}lag20 {c |}{col 14}{res}{space 2} 11.46951{col 26}{space 2} 4.102868{col 37}{space 1}    2.80{col 46}{space 3}0.068{col 54}{space 4}-1.587645{col 67}{space 3} 24.52667
{txt}{space 7}lag21 {c |}{col 14}{res}{space 2} 5.600002{col 26}{space 2} 1.182501{col 37}{space 1}    4.74{col 46}{space 3}0.018{col 54}{space 4} 1.836757{col 67}{space 3} 9.363248
{txt}{space 7}lag22 {c |}{col 14}{res}{space 2} 2.756251{col 26}{space 2} 1.175413{col 37}{space 1}    2.34{col 46}{space 3}0.101{col 54}{space 4}-.9844376{col 67}{space 3} 6.496939
{txt}{space 7}lag23 {c |}{col 14}{res}{space 2} 3.257192{col 26}{space 2} 4.327953{col 37}{space 1}    0.75{col 46}{space 3}0.506{col 54}{space 4}-10.51628{col 67}{space 3} 17.03067
{txt}{space 7}lag24 {c |}{col 14}{res}{space 2} 2.501554{col 26}{space 2} 2.323587{col 37}{space 1}    1.08{col 46}{space 3}0.361{col 54}{space 4}-4.893136{col 67}{space 3} 9.896245
{txt}{space 7}lag25 {c |}{col 14}{res}{space 2} 4.356859{col 26}{space 2} 2.135464{col 37}{space 1}    2.04{col 46}{space 3}0.134{col 54}{space 4}-2.439141{col 67}{space 3} 11.15286
{txt}{space 7}lag26 {c |}{col 14}{res}{space 2} 3.388733{col 26}{space 2} 1.254403{col 37}{space 1}    2.70{col 46}{space 3}0.074{col 54}{space 4}-.6033362{col 67}{space 3} 7.380803
{txt}{space 7}lag27 {c |}{col 14}{res}{space 2} 2.853697{col 26}{space 2}  2.09737{col 37}{space 1}    1.36{col 46}{space 3}0.267{col 54}{space 4} -3.82107{col 67}{space 3} 9.528464
{txt}{space 7}lag28 {c |}{col 14}{res}{space 2} .9628059{col 26}{space 2} 1.265739{col 37}{space 1}    0.76{col 46}{space 3}0.502{col 54}{space 4} -3.06534{col 67}{space 3} 4.990951
{txt}{space 7}lag29 {c |}{col 14}{res}{space 2} 5.032167{col 26}{space 2} 2.884397{col 37}{space 1}    1.74{col 46}{space 3}0.179{col 54}{space 4}-4.147271{col 67}{space 3}  14.2116
{txt}{space 7}lag30 {c |}{col 14}{res}{space 2} 5.098202{col 26}{space 2} 1.413924{col 37}{space 1}    3.61{col 46}{space 3}0.037{col 54}{space 4} .5984657{col 67}{space 3} 9.597938
{txt}{space 7}lag31 {c |}{col 14}{res}{space 2} 5.727136{col 26}{space 2} 4.797592{col 37}{space 1}    1.19{col 46}{space 3}0.318{col 54}{space 4}-9.540943{col 67}{space 3} 20.99521
{txt}{space 7}lag32 {c |}{col 14}{res}{space 2} 4.584803{col 26}{space 2} 2.987455{col 37}{space 1}    1.53{col 46}{space 3}0.222{col 54}{space 4}-4.922611{col 67}{space 3} 14.09222
{txt}{space 7}lag33 {c |}{col 14}{res}{space 2} 3.699549{col 26}{space 2} 2.425223{col 37}{space 1}    1.53{col 46}{space 3}0.225{col 54}{space 4}-4.018592{col 67}{space 3} 11.41769
{txt}{space 7}lag34 {c |}{col 14}{res}{space 2} 1.377675{col 26}{space 2} 2.970088{col 37}{space 1}    0.46{col 46}{space 3}0.674{col 54}{space 4} -8.07447{col 67}{space 3} 10.82982
{txt}{space 7}lag35 {c |}{col 14}{res}{space 2} 3.575497{col 26}{space 2} 3.045267{col 37}{space 1}    1.17{col 46}{space 3}0.325{col 54}{space 4}-6.115903{col 67}{space 3}  13.2669
{txt}{space 7}lag36 {c |}{col 14}{res}{space 2} 5.807331{col 26}{space 2} 2.295623{col 37}{space 1}    2.53{col 46}{space 3}0.085{col 54}{space 4}-1.498366{col 67}{space 3} 13.11303
{txt}{space 7}lag37 {c |}{col 14}{res}{space 2} 10.11771{col 26}{space 2} .9450579{col 37}{space 1}   10.71{col 46}{space 3}0.002{col 54}{space 4} 7.110117{col 67}{space 3} 13.12531
{txt}{space 7}lag38 {c |}{col 14}{res}{space 2}-2.233533{col 26}{space 2} 2.719031{col 37}{space 1}   -0.82{col 46}{space 3}0.472{col 54}{space 4} -10.8867{col 67}{space 3} 6.419637
{txt}{space 7}lag39 {c |}{col 14}{res}{space 2}-.7523318{col 26}{space 2} 2.416297{col 37}{space 1}   -0.31{col 46}{space 3}0.776{col 54}{space 4}-8.442068{col 67}{space 3} 6.937405
{txt}{space 7}lag40 {c |}{col 14}{res}{space 2} -1.93724{col 26}{space 2} 1.990219{col 37}{space 1}   -0.97{col 46}{space 3}0.402{col 54}{space 4}-8.271004{col 67}{space 3} 4.396525
{txt}{space 7}lag41 {c |}{col 14}{res}{space 2} 2.972869{col 26}{space 2} 2.949531{col 37}{space 1}    1.01{col 46}{space 3}0.388{col 54}{space 4}-6.413857{col 67}{space 3} 12.35959
{txt}{space 7}lag42 {c |}{col 14}{res}{space 2} 1.329739{col 26}{space 2} 3.307205{col 37}{space 1}    0.40{col 46}{space 3}0.715{col 54}{space 4}-9.195265{col 67}{space 3} 11.85474
{txt}{space 7}lag43 {c |}{col 14}{res}{space 2}-2.410136{col 26}{space 2} 2.197927{col 37}{space 1}   -1.10{col 46}{space 3}0.353{col 54}{space 4} -9.40492{col 67}{space 3} 4.584648
{txt}{space 7}lag44 {c |}{col 14}{res}{space 2}-.5120329{col 26}{space 2} 1.864079{col 37}{space 1}   -0.27{col 46}{space 3}0.801{col 54}{space 4}-6.444364{col 67}{space 3} 5.420298
{txt}{space 7}lag45 {c |}{col 14}{res}{space 2} 5.287873{col 26}{space 2} 2.926363{col 37}{space 1}    1.81{col 46}{space 3}0.168{col 54}{space 4}-4.025119{col 67}{space 3} 14.60086
{txt}{space 7}lag46 {c |}{col 14}{res}{space 2}-1.890534{col 26}{space 2} 3.967295{col 37}{space 1}   -0.48{col 46}{space 3}0.666{col 54}{space 4}-14.51624{col 67}{space 3} 10.73517
{txt}{space 7}lag47 {c |}{col 14}{res}{space 2} 8.428739{col 26}{space 2} 1.989415{col 37}{space 1}    4.24{col 46}{space 3}0.024{col 54}{space 4} 2.097534{col 67}{space 3} 14.75994
{txt}{space 7}lag48 {c |}{col 14}{res}{space 2} 2.919797{col 26}{space 2} 2.852353{col 37}{space 1}    1.02{col 46}{space 3}0.381{col 54}{space 4}-6.157662{col 67}{space 3} 11.99726
{txt}{space 7}lag49 {c |}{col 14}{res}{space 2} 1.986815{col 26}{space 2} 5.348228{col 37}{space 1}    0.37{col 46}{space 3}0.735{col 54}{space 4}-15.03363{col 67}{space 3} 19.00727
{txt}{space 7}lag50 {c |}{col 14}{res}{space 2}-5.700651{col 26}{space 2} 2.842086{col 37}{space 1}   -2.01{col 46}{space 3}0.139{col 54}{space 4}-14.74544{col 67}{space 3} 3.344135
{txt}{space 7}lag51 {c |}{col 14}{res}{space 2}-.9634861{col 26}{space 2}  1.59046{col 37}{space 1}   -0.61{col 46}{space 3}0.587{col 54}{space 4} -6.02504{col 67}{space 3} 4.098068
{txt}{space 7}lag52 {c |}{col 14}{res}{space 2} 2.341871{col 26}{space 2} 4.614727{col 37}{space 1}    0.51{col 46}{space 3}0.647{col 54}{space 4}-12.34425{col 67}{space 3} 17.02799
{txt}{space 7}lag53 {c |}{col 14}{res}{space 2}-5.943359{col 26}{space 2} 1.087623{col 37}{space 1}   -5.46{col 46}{space 3}0.012{col 54}{space 4}-9.404662{col 67}{space 3}-2.482056
{txt}{space 7}lag54 {c |}{col 14}{res}{space 2} 1.568981{col 26}{space 2} 1.688359{col 37}{space 1}    0.93{col 46}{space 3}0.421{col 54}{space 4}-3.804131{col 67}{space 3} 6.942093
{txt}{space 7}lag55 {c |}{col 14}{res}{space 2}-2.898259{col 26}{space 2} 2.957576{col 37}{space 1}   -0.98{col 46}{space 3}0.399{col 54}{space 4}-12.31059{col 67}{space 3} 6.514068
{txt}{space 7}lag56 {c |}{col 14}{res}{space 2} 7.125071{col 26}{space 2} 3.058179{col 37}{space 1}    2.33{col 46}{space 3}0.102{col 54}{space 4}-2.607421{col 67}{space 3} 16.85756
{txt}{space 7}lag57 {c |}{col 14}{res}{space 2} 4.597818{col 26}{space 2} 2.728287{col 37}{space 1}    1.69{col 46}{space 3}0.191{col 54}{space 4}-4.084808{col 67}{space 3} 13.28044
{txt}{space 7}lag58 {c |}{col 14}{res}{space 2} 2.848913{col 26}{space 2} 1.969259{col 37}{space 1}    1.45{col 46}{space 3}0.244{col 54}{space 4}-3.418148{col 67}{space 3} 9.115973
{txt}{space 7}lag59 {c |}{col 14}{res}{space 2} 8.638213{col 26}{space 2}  2.79181{col 37}{space 1}    3.09{col 46}{space 3}0.054{col 54}{space 4}-.2465714{col 67}{space 3}   17.523
{txt}{space 7}lag60 {c |}{col 14}{res}{space 2} 8.458449{col 26}{space 2} 2.207874{col 37}{space 1}    3.83{col 46}{space 3}0.031{col 54}{space 4} 1.432008{col 67}{space 3} 15.48489
{txt}{space 7}lag61 {c |}{col 14}{res}{space 2}-.9672325{col 26}{space 2} 4.716235{col 37}{space 1}   -0.21{col 46}{space 3}0.851{col 54}{space 4} -15.9764{col 67}{space 3} 14.04193
{txt}{space 7}lag62 {c |}{col 14}{res}{space 2}-4.971504{col 26}{space 2} 1.393378{col 37}{space 1}   -3.57{col 46}{space 3}0.038{col 54}{space 4}-9.405854{col 67}{space 3}-.5371542
{txt}{space 7}lag63 {c |}{col 14}{res}{space 2}-5.345172{col 26}{space 2} 4.623363{col 37}{space 1}   -1.16{col 46}{space 3}0.331{col 54}{space 4}-20.05878{col 67}{space 3} 9.368433
{txt}{space 7}lag64 {c |}{col 14}{res}{space 2}-5.591454{col 26}{space 2} 2.092548{col 37}{space 1}   -2.67{col 46}{space 3}0.076{col 54}{space 4}-12.25088{col 67}{space 3} 1.067969
{txt}{space 7}lag65 {c |}{col 14}{res}{space 2}-13.43821{col 26}{space 2} 4.472276{col 37}{space 1}   -3.00{col 46}{space 3}0.057{col 54}{space 4}-27.67099{col 67}{space 3} .7945675
{txt}{space 7}lag66 {c |}{col 14}{res}{space 2} 3.692471{col 26}{space 2} 1.297265{col 37}{space 1}    2.85{col 46}{space 3}0.065{col 54}{space 4}-.4360056{col 67}{space 3} 7.820948
{txt}{space 7}lag67 {c |}{col 14}{res}{space 2} 4.380723{col 26}{space 2} 2.350333{col 37}{space 1}    1.86{col 46}{space 3}0.159{col 54}{space 4}-3.099086{col 67}{space 3} 11.86053
{txt}{space 7}lag68 {c |}{col 14}{res}{space 2} 4.043288{col 26}{space 2} 3.804921{col 37}{space 1}    1.06{col 46}{space 3}0.366{col 54}{space 4} -8.06567{col 67}{space 3} 16.15225
{txt}{space 7}lag69 {c |}{col 14}{res}{space 2}-9.515031{col 26}{space 2} 2.235941{col 37}{space 1}   -4.26{col 46}{space 3}0.024{col 54}{space 4}-16.63079{col 67}{space 3}-2.399271
{txt}{space 7}lag70 {c |}{col 14}{res}{space 2}-4.910853{col 26}{space 2} 4.942884{col 37}{space 1}   -0.99{col 46}{space 3}0.394{col 54}{space 4}-20.64131{col 67}{space 3} 10.81961
{txt}{space 7}lag71 {c |}{col 14}{res}{space 2}-4.728487{col 26}{space 2} 3.841781{col 37}{space 1}   -1.23{col 46}{space 3}0.306{col 54}{space 4}-16.95475{col 67}{space 3} 7.497774
{txt}{space 7}lag72 {c |}{col 14}{res}{space 2}-4.070374{col 26}{space 2} 2.033371{col 37}{space 1}   -2.00{col 46}{space 3}0.139{col 54}{space 4}-10.54147{col 67}{space 3}  2.40072
{txt}{space 7}lag73 {c |}{col 14}{res}{space 2} 4.778245{col 26}{space 2} 5.819969{col 37}{space 1}    0.82{col 46}{space 3}0.472{col 54}{space 4}-13.74349{col 67}{space 3} 23.29998
{txt}{space 7}lag74 {c |}{col 14}{res}{space 2} 2.259755{col 26}{space 2} 3.399001{col 37}{space 1}    0.66{col 46}{space 3}0.554{col 54}{space 4}-8.557385{col 67}{space 3} 13.07689
{txt}{space 7}lag75 {c |}{col 14}{res}{space 2} 4.373783{col 26}{space 2} 3.821074{col 37}{space 1}    1.14{col 46}{space 3}0.335{col 54}{space 4} -7.78658{col 67}{space 3} 16.53415
{txt}{space 7}lag76 {c |}{col 14}{res}{space 2} 2.058201{col 26}{space 2} 5.865084{col 37}{space 1}    0.35{col 46}{space 3}0.749{col 54}{space 4}-16.60711{col 67}{space 3} 20.72352
{txt}{space 7}lag77 {c |}{col 14}{res}{space 2}-3.837466{col 26}{space 2} 4.787488{col 37}{space 1}   -0.80{col 46}{space 3}0.481{col 54}{space 4}-19.07339{col 67}{space 3} 11.39846
{txt}{space 7}lag78 {c |}{col 14}{res}{space 2}-3.258893{col 26}{space 2} 4.180356{col 37}{space 1}   -0.78{col 46}{space 3}0.492{col 54}{space 4}-16.56265{col 67}{space 3} 10.04487
{txt}{space 7}lag79 {c |}{col 14}{res}{space 2}-4.970218{col 26}{space 2} 2.490433{col 37}{space 1}   -2.00{col 46}{space 3}0.140{col 54}{space 4}-12.89589{col 67}{space 3}  2.95545
{txt}{space 7}lag80 {c |}{col 14}{res}{space 2} 1.261986{col 26}{space 2} 5.254318{col 37}{space 1}    0.24{col 46}{space 3}0.826{col 54}{space 4} -15.4596{col 67}{space 3} 17.98357
{txt}{space 7}lag81 {c |}{col 14}{res}{space 2}-3.781722{col 26}{space 2} 3.497094{col 37}{space 1}   -1.08{col 46}{space 3}0.359{col 54}{space 4}-14.91104{col 67}{space 3} 7.347592
{txt}{space 7}lag82 {c |}{col 14}{res}{space 2}-6.396738{col 26}{space 2} 1.329476{col 37}{space 1}   -4.81{col 46}{space 3}0.017{col 54}{space 4}-10.62773{col 67}{space 3}-2.165751
{txt}{space 7}lag83 {c |}{col 14}{res}{space 2}  8.97092{col 26}{space 2} 1.312811{col 37}{space 1}    6.83{col 46}{space 3}0.006{col 54}{space 4} 4.792971{col 67}{space 3} 13.14887
{txt}{space 7}lag84 {c |}{col 14}{res}{space 2}   5.1946{col 26}{space 2} 4.655543{col 37}{space 1}    1.12{col 46}{space 3}0.346{col 54}{space 4}-9.621415{col 67}{space 3} 20.01061
{txt}{space 7}lag85 {c |}{col 14}{res}{space 2}-2.531912{col 26}{space 2} 3.892279{col 37}{space 1}   -0.65{col 46}{space 3}0.562{col 54}{space 4}-14.91888{col 67}{space 3} 9.855057
{txt}{space 7}lag86 {c |}{col 14}{res}{space 2}-.6110282{col 26}{space 2} 4.195438{col 37}{space 1}   -0.15{col 46}{space 3}0.893{col 54}{space 4}-13.96279{col 67}{space 3} 12.74073
{txt}{space 7}lag87 {c |}{col 14}{res}{space 2} .3844426{col 26}{space 2} 4.143497{col 37}{space 1}    0.09{col 46}{space 3}0.932{col 54}{space 4}-12.80201{col 67}{space 3}  13.5709
{txt}{space 7}lag88 {c |}{col 14}{res}{space 2} 1.078763{col 26}{space 2} 3.725824{col 37}{space 1}    0.29{col 46}{space 3}0.791{col 54}{space 4}-10.77847{col 67}{space 3}   12.936
{txt}{space 7}lag89 {c |}{col 14}{res}{space 2} 6.217627{col 26}{space 2} 2.427872{col 37}{space 1}    2.56{col 46}{space 3}0.083{col 54}{space 4}-1.508945{col 67}{space 3}  13.9442
{txt}{space 7}lag90 {c |}{col 14}{res}{space 2} 4.923638{col 26}{space 2}    2.152{col 37}{space 1}    2.29{col 46}{space 3}0.106{col 54}{space 4}-1.924986{col 67}{space 3} 11.77226
{txt}{space 7}lag91 {c |}{col 14}{res}{space 2}-1.954856{col 26}{space 2} 5.044556{col 37}{space 1}   -0.39{col 46}{space 3}0.724{col 54}{space 4}-18.00888{col 67}{space 3} 14.09917
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-182.1129{col 26}{space 2} 19.41558{col 37}{space 1}   -9.38{col 46}{space 3}0.003{col 54}{space 4}-243.9019{col 67}{space 3}-120.3238
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}   regionid1{col 14}{c |}{space 1}        4{col 27}{space 1}        4{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}        date{col 14}{c |}{space 1}     5267{col 27}{space 1}        1{col 39}{result}{space 1}     5266{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. graph export "results/EventStudy-MiddayElec-Dropping-Tasmania.png", replace
{txt}{p 0 4 2}
file {bf}
results/EventStudy-MiddayElec-Dropping-Tasmania.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. /******* 7. **Event Study with ln(CO2) for Interpretation:**********************
> - Event study for ln(CO2) after dropping data related to Tasmania.
> - Result is exported to a file.*/
. 
. // DDD dropping Tasmania and using ln(co2) for interpretation
. gen ln_co2 = ln(co2_g_per_capita_vs_midday)
{txt}(471,355 missing values generated)

{com}. eventdd ln_co2 public_holiday c.temperature##c.temperature solar_exposure ///
>  wind_3  [aweight = population], timevar(timevar) /// 
>  method(hdfe, absorb(regionid1 date) cluster(regionid1)) ///
>  graph_op(ytitle("ln(Co2) g per capita") xtitle("Days until DST transition") ///
>  title("Event Study - lnCO2 - Midday - w/o Tasmania"))
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}{txt}warning: missing F statistic; dropped variables due to collinearity or too few clusters
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}   539,903
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F( 190,      3)}{col 67}=          {res}.
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.2207
{txt}{col 51}Adj R-squared{col 67}= {res}    0.2127
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0091
{txt}{col 1}Number of clusters ({res}regionid1{txt}) {col 30}= {res}         4{txt}{col 51}Root MSE{col 67}= {res}    1.2720

{txt}{ralign 78:(Std. err. adjusted for {res:4} clusters in {res:regionid1})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      ln_co2{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
public_hol~y {c |}{col 14}{res}{space 2} .1942683{col 26}{space 2} .0759941{col 37}{space 1}    2.56{col 46}{space 3}0.083{col 54}{space 4}-.0475788{col 67}{space 3} .4361153
{txt}{space 1}temperature {c |}{col 14}{res}{space 2} .1224875{col 26}{space 2} .0544869{col 37}{space 1}    2.25{col 46}{space 3}0.110{col 54}{space 4} -.050914{col 67}{space 3} .2958891
{txt}{space 12} {c |}
{space 10}c. {c |}
{space 1}temperature#{c |}
{space 10}c. {c |}
{space 1}temperature {c |}{col 14}{res}{space 2}-.0021712{col 26}{space 2} .0011131{col 37}{space 1}   -1.95{col 46}{space 3}0.146{col 54}{space 4}-.0057137{col 67}{space 3} .0013713
{txt}{space 12} {c |}
solar_expo~e {c |}{col 14}{res}{space 2} .0788763{col 26}{space 2} .0243108{col 37}{space 1}    3.24{col 46}{space 3}0.048{col 54}{space 4} .0015085{col 67}{space 3}  .156244
{txt}{space 6}wind_3 {c |}{col 14}{res}{space 2}-.0695053{col 26}{space 2} .0435828{col 37}{space 1}   -1.59{col 46}{space 3}0.209{col 54}{space 4}-.2082051{col 67}{space 3} .0691946
{txt}{space 6}lead94 {c |}{col 14}{res}{space 2} .1610773{col 26}{space 2} .4312196{col 37}{space 1}    0.37{col 46}{space 3}0.734{col 54}{space 4}-1.211256{col 67}{space 3}  1.53341
{txt}{space 6}lead93 {c |}{col 14}{res}{space 2}-.0508085{col 26}{space 2} .0722787{col 37}{space 1}   -0.70{col 46}{space 3}0.533{col 54}{space 4}-.2808316{col 67}{space 3} .1792147
{txt}{space 6}lead92 {c |}{col 14}{res}{space 2} .2965274{col 26}{space 2} .1406131{col 37}{space 1}    2.11{col 46}{space 3}0.126{col 54}{space 4}-.1509661{col 67}{space 3} .7440209
{txt}{space 6}lead91 {c |}{col 14}{res}{space 2} .2089961{col 26}{space 2}  .270772{col 37}{space 1}    0.77{col 46}{space 3}0.496{col 54}{space 4}-.6527212{col 67}{space 3} 1.070713
{txt}{space 6}lead90 {c |}{col 14}{res}{space 2} .1612002{col 26}{space 2}  .247171{col 37}{space 1}    0.65{col 46}{space 3}0.561{col 54}{space 4}-.6254082{col 67}{space 3} .9478086
{txt}{space 6}lead89 {c |}{col 14}{res}{space 2} .0475847{col 26}{space 2} .1983883{col 37}{space 1}    0.24{col 46}{space 3}0.826{col 54}{space 4}-.5837753{col 67}{space 3} .6789447
{txt}{space 6}lead88 {c |}{col 14}{res}{space 2} .1396133{col 26}{space 2} .1865961{col 37}{space 1}    0.75{col 46}{space 3}0.509{col 54}{space 4}-.4542188{col 67}{space 3} .7334453
{txt}{space 6}lead87 {c |}{col 14}{res}{space 2}-.0016141{col 26}{space 2} .1743715{col 37}{space 1}   -0.01{col 46}{space 3}0.993{col 54}{space 4} -.556542{col 67}{space 3} .5533137
{txt}{space 6}lead86 {c |}{col 14}{res}{space 2}-.1182902{col 26}{space 2} .2379363{col 37}{space 1}   -0.50{col 46}{space 3}0.653{col 54}{space 4}-.8755097{col 67}{space 3} .6389293
{txt}{space 6}lead85 {c |}{col 14}{res}{space 2}-.0716838{col 26}{space 2} .2876851{col 37}{space 1}   -0.25{col 46}{space 3}0.819{col 54}{space 4}-.9872262{col 67}{space 3} .8438587
{txt}{space 6}lead84 {c |}{col 14}{res}{space 2}   .25941{col 26}{space 2} .2508115{col 37}{space 1}    1.03{col 46}{space 3}0.377{col 54}{space 4}-.5387841{col 67}{space 3} 1.057604
{txt}{space 6}lead83 {c |}{col 14}{res}{space 2} .1325198{col 26}{space 2} .2317282{col 37}{space 1}    0.57{col 46}{space 3}0.607{col 54}{space 4}-.6049427{col 67}{space 3} .8699822
{txt}{space 6}lead82 {c |}{col 14}{res}{space 2} .0627149{col 26}{space 2}  .198985{col 37}{space 1}    0.32{col 46}{space 3}0.773{col 54}{space 4}-.5705441{col 67}{space 3} .6959739
{txt}{space 6}lead81 {c |}{col 14}{res}{space 2}-.0249297{col 26}{space 2} .1469223{col 37}{space 1}   -0.17{col 46}{space 3}0.876{col 54}{space 4}-.4925021{col 67}{space 3} .4426427
{txt}{space 6}lead80 {c |}{col 14}{res}{space 2}-.2020707{col 26}{space 2} .2638304{col 37}{space 1}   -0.77{col 46}{space 3}0.499{col 54}{space 4}-1.041697{col 67}{space 3} .6375552
{txt}{space 6}lead79 {c |}{col 14}{res}{space 2}-.2313919{col 26}{space 2} .2584279{col 37}{space 1}   -0.90{col 46}{space 3}0.437{col 54}{space 4}-1.053825{col 67}{space 3} .5910409
{txt}{space 6}lead78 {c |}{col 14}{res}{space 2} .0107345{col 26}{space 2} .2790827{col 37}{space 1}    0.04{col 46}{space 3}0.972{col 54}{space 4}-.8774313{col 67}{space 3} .8989002
{txt}{space 6}lead77 {c |}{col 14}{res}{space 2} .1554412{col 26}{space 2} .1630644{col 37}{space 1}    0.95{col 46}{space 3}0.411{col 54}{space 4}-.3635023{col 67}{space 3} .6743848
{txt}{space 6}lead76 {c |}{col 14}{res}{space 2}-.0208876{col 26}{space 2}   .19077{col 37}{space 1}   -0.11{col 46}{space 3}0.920{col 54}{space 4}-.6280029{col 67}{space 3} .5862276
{txt}{space 6}lead75 {c |}{col 14}{res}{space 2} .0625802{col 26}{space 2} .3372753{col 37}{space 1}    0.19{col 46}{space 3}0.865{col 54}{space 4} -1.01078{col 67}{space 3} 1.135941
{txt}{space 6}lead74 {c |}{col 14}{res}{space 2} .0888041{col 26}{space 2} .2577552{col 37}{space 1}    0.34{col 46}{space 3}0.753{col 54}{space 4} -.731488{col 67}{space 3} .9090962
{txt}{space 6}lead73 {c |}{col 14}{res}{space 2}  .132547{col 26}{space 2} .2169718{col 37}{space 1}    0.61{col 46}{space 3}0.584{col 54}{space 4}-.5579541{col 67}{space 3}  .823048
{txt}{space 6}lead72 {c |}{col 14}{res}{space 2} .2155059{col 26}{space 2} .2258176{col 37}{space 1}    0.95{col 46}{space 3}0.410{col 54}{space 4}-.5031464{col 67}{space 3} .9341581
{txt}{space 6}lead71 {c |}{col 14}{res}{space 2} .2903295{col 26}{space 2} .2477229{col 37}{space 1}    1.17{col 46}{space 3}0.326{col 54}{space 4}-.4980354{col 67}{space 3} 1.078694
{txt}{space 6}lead70 {c |}{col 14}{res}{space 2} .3167896{col 26}{space 2} .1936561{col 37}{space 1}    1.64{col 46}{space 3}0.200{col 54}{space 4}-.2995104{col 67}{space 3} .9330896
{txt}{space 6}lead69 {c |}{col 14}{res}{space 2} .1007649{col 26}{space 2} .2493233{col 37}{space 1}    0.40{col 46}{space 3}0.713{col 54}{space 4} -.692693{col 67}{space 3} .8942229
{txt}{space 6}lead68 {c |}{col 14}{res}{space 2}-.0463133{col 26}{space 2} .2632557{col 37}{space 1}   -0.18{col 46}{space 3}0.872{col 54}{space 4}-.8841103{col 67}{space 3} .7914837
{txt}{space 6}lead67 {c |}{col 14}{res}{space 2} .0067707{col 26}{space 2} .2653077{col 37}{space 1}    0.03{col 46}{space 3}0.981{col 54}{space 4}-.8375567{col 67}{space 3} .8510981
{txt}{space 6}lead66 {c |}{col 14}{res}{space 2} .0729431{col 26}{space 2}  .203247{col 37}{space 1}    0.36{col 46}{space 3}0.743{col 54}{space 4}-.5738795{col 67}{space 3} .7197657
{txt}{space 6}lead65 {c |}{col 14}{res}{space 2} .0181199{col 26}{space 2} .2500911{col 37}{space 1}    0.07{col 46}{space 3}0.947{col 54}{space 4}-.7777816{col 67}{space 3} .8140214
{txt}{space 6}lead64 {c |}{col 14}{res}{space 2} .0769328{col 26}{space 2} .1283879{col 37}{space 1}    0.60{col 46}{space 3}0.591{col 54}{space 4}-.3316548{col 67}{space 3} .4855203
{txt}{space 6}lead63 {c |}{col 14}{res}{space 2} .2527824{col 26}{space 2} .1347363{col 37}{space 1}    1.88{col 46}{space 3}0.157{col 54}{space 4}-.1760085{col 67}{space 3} .6815733
{txt}{space 6}lead62 {c |}{col 14}{res}{space 2} .0925551{col 26}{space 2} .1657033{col 37}{space 1}    0.56{col 46}{space 3}0.615{col 54}{space 4}-.4347868{col 67}{space 3}  .619897
{txt}{space 6}lead61 {c |}{col 14}{res}{space 2} .1190078{col 26}{space 2} .1800443{col 37}{space 1}    0.66{col 46}{space 3}0.556{col 54}{space 4}-.4539735{col 67}{space 3}  .691989
{txt}{space 6}lead60 {c |}{col 14}{res}{space 2} .0620761{col 26}{space 2} .2071242{col 37}{space 1}    0.30{col 46}{space 3}0.784{col 54}{space 4}-.5970855{col 67}{space 3} .7212376
{txt}{space 6}lead59 {c |}{col 14}{res}{space 2}-.0678021{col 26}{space 2} .3000634{col 37}{space 1}   -0.23{col 46}{space 3}0.836{col 54}{space 4}-1.022738{col 67}{space 3} .8871336
{txt}{space 6}lead58 {c |}{col 14}{res}{space 2} .1373749{col 26}{space 2} .2549282{col 37}{space 1}    0.54{col 46}{space 3}0.627{col 54}{space 4}-.6739206{col 67}{space 3} .9486703
{txt}{space 6}lead57 {c |}{col 14}{res}{space 2} .0052472{col 26}{space 2}   .17655{col 37}{space 1}    0.03{col 46}{space 3}0.978{col 54}{space 4}-.5566137{col 67}{space 3}  .567108
{txt}{space 6}lead56 {c |}{col 14}{res}{space 2} .2942302{col 26}{space 2} .1461169{col 37}{space 1}    2.01{col 46}{space 3}0.137{col 54}{space 4} -.170779{col 67}{space 3} .7592393
{txt}{space 6}lead55 {c |}{col 14}{res}{space 2} .1179369{col 26}{space 2} .2087049{col 37}{space 1}    0.57{col 46}{space 3}0.612{col 54}{space 4}-.5462553{col 67}{space 3} .7821291
{txt}{space 6}lead54 {c |}{col 14}{res}{space 2} .0471942{col 26}{space 2} .2143866{col 37}{space 1}    0.22{col 46}{space 3}0.840{col 54}{space 4}-.6350797{col 67}{space 3} .7294682
{txt}{space 6}lead53 {c |}{col 14}{res}{space 2} .1209578{col 26}{space 2} .1950346{col 37}{space 1}    0.62{col 46}{space 3}0.579{col 54}{space 4}-.4997293{col 67}{space 3} .7416449
{txt}{space 6}lead52 {c |}{col 14}{res}{space 2}-.0033131{col 26}{space 2} .2803539{col 37}{space 1}   -0.01{col 46}{space 3}0.991{col 54}{space 4}-.8955243{col 67}{space 3}  .888898
{txt}{space 6}lead51 {c |}{col 14}{res}{space 2} .0873762{col 26}{space 2} .2048212{col 37}{space 1}    0.43{col 46}{space 3}0.698{col 54}{space 4}-.5644562{col 67}{space 3} .7392086
{txt}{space 6}lead50 {c |}{col 14}{res}{space 2} .1371411{col 26}{space 2} .1553327{col 37}{space 1}    0.88{col 46}{space 3}0.442{col 54}{space 4}-.3571967{col 67}{space 3}  .631479
{txt}{space 6}lead49 {c |}{col 14}{res}{space 2} .1509475{col 26}{space 2} .0929064{col 37}{space 1}    1.62{col 46}{space 3}0.203{col 54}{space 4}-.1447222{col 67}{space 3} .4466173
{txt}{space 6}lead48 {c |}{col 14}{res}{space 2}-.0594526{col 26}{space 2} .1251718{col 37}{space 1}   -0.47{col 46}{space 3}0.667{col 54}{space 4}-.4578053{col 67}{space 3} .3389001
{txt}{space 6}lead47 {c |}{col 14}{res}{space 2} -.067524{col 26}{space 2}  .165947{col 37}{space 1}   -0.41{col 46}{space 3}0.711{col 54}{space 4}-.5956416{col 67}{space 3} .4605935
{txt}{space 6}lead46 {c |}{col 14}{res}{space 2} .0512424{col 26}{space 2} .1874224{col 37}{space 1}    0.27{col 46}{space 3}0.802{col 54}{space 4}-.5452194{col 67}{space 3} .6477041
{txt}{space 6}lead45 {c |}{col 14}{res}{space 2} .1241666{col 26}{space 2}  .139817{col 37}{space 1}    0.89{col 46}{space 3}0.440{col 54}{space 4}-.3207934{col 67}{space 3} .5691266
{txt}{space 6}lead44 {c |}{col 14}{res}{space 2}-.0289939{col 26}{space 2} .2305811{col 37}{space 1}   -0.13{col 46}{space 3}0.908{col 54}{space 4}-.7628059{col 67}{space 3}  .704818
{txt}{space 6}lead43 {c |}{col 14}{res}{space 2} .0348591{col 26}{space 2} .1263918{col 37}{space 1}    0.28{col 46}{space 3}0.801{col 54}{space 4}-.3673762{col 67}{space 3} .4370943
{txt}{space 6}lead42 {c |}{col 14}{res}{space 2} .0996328{col 26}{space 2} .0621388{col 37}{space 1}    1.60{col 46}{space 3}0.207{col 54}{space 4}-.0981208{col 67}{space 3} .2973863
{txt}{space 6}lead41 {c |}{col 14}{res}{space 2}-.0260599{col 26}{space 2} .1619152{col 37}{space 1}   -0.16{col 46}{space 3}0.882{col 54}{space 4}-.5413464{col 67}{space 3} .4892266
{txt}{space 6}lead40 {c |}{col 14}{res}{space 2}-.0477672{col 26}{space 2} .2069865{col 37}{space 1}   -0.23{col 46}{space 3}0.832{col 54}{space 4}-.7064906{col 67}{space 3} .6109562
{txt}{space 6}lead39 {c |}{col 14}{res}{space 2}-.0213301{col 26}{space 2} .2286851{col 37}{space 1}   -0.09{col 46}{space 3}0.932{col 54}{space 4}-.7491081{col 67}{space 3} .7064479
{txt}{space 6}lead38 {c |}{col 14}{res}{space 2} .0702579{col 26}{space 2} .1724102{col 37}{space 1}    0.41{col 46}{space 3}0.711{col 54}{space 4}-.4784282{col 67}{space 3} .6189441
{txt}{space 6}lead37 {c |}{col 14}{res}{space 2} .0389334{col 26}{space 2} .1669791{col 37}{space 1}    0.23{col 46}{space 3}0.831{col 54}{space 4}-.4924686{col 67}{space 3} .5703353
{txt}{space 6}lead36 {c |}{col 14}{res}{space 2} .0699548{col 26}{space 2} .1409951{col 37}{space 1}    0.50{col 46}{space 3}0.654{col 54}{space 4}-.3787544{col 67}{space 3}  .518664
{txt}{space 6}lead35 {c |}{col 14}{res}{space 2}  .362926{col 26}{space 2} .0951687{col 37}{space 1}    3.81{col 46}{space 3}0.032{col 54}{space 4} .0600566{col 67}{space 3} .6657954
{txt}{space 6}lead34 {c |}{col 14}{res}{space 2} .1290762{col 26}{space 2} .1500205{col 37}{space 1}    0.86{col 46}{space 3}0.453{col 54}{space 4}-.3483559{col 67}{space 3} .6065082
{txt}{space 6}lead33 {c |}{col 14}{res}{space 2}-.0963112{col 26}{space 2} .1342307{col 37}{space 1}   -0.72{col 46}{space 3}0.525{col 54}{space 4}-.5234933{col 67}{space 3}  .330871
{txt}{space 6}lead32 {c |}{col 14}{res}{space 2}-.0565844{col 26}{space 2} .1419251{col 37}{space 1}   -0.40{col 46}{space 3}0.717{col 54}{space 4}-.5082534{col 67}{space 3} .3950846
{txt}{space 6}lead31 {c |}{col 14}{res}{space 2}-.0536259{col 26}{space 2} .0632028{col 37}{space 1}   -0.85{col 46}{space 3}0.459{col 54}{space 4}-.2547655{col 67}{space 3} .1475137
{txt}{space 6}lead30 {c |}{col 14}{res}{space 2} .0998368{col 26}{space 2} .0712332{col 37}{space 1}    1.40{col 46}{space 3}0.256{col 54}{space 4}-.1268591{col 67}{space 3} .3265327
{txt}{space 6}lead29 {c |}{col 14}{res}{space 2} .1728207{col 26}{space 2} .1395279{col 37}{space 1}    1.24{col 46}{space 3}0.304{col 54}{space 4}-.2712192{col 67}{space 3} .6168606
{txt}{space 6}lead28 {c |}{col 14}{res}{space 2} .2803693{col 26}{space 2} .1276103{col 37}{space 1}    2.20{col 46}{space 3}0.115{col 54}{space 4}-.1257435{col 67}{space 3} .6864821
{txt}{space 6}lead27 {c |}{col 14}{res}{space 2} .2714338{col 26}{space 2} .0916949{col 37}{space 1}    2.96{col 46}{space 3}0.060{col 54}{space 4}-.0203804{col 67}{space 3}  .563248
{txt}{space 6}lead26 {c |}{col 14}{res}{space 2} .0482853{col 26}{space 2} .1200825{col 37}{space 1}    0.40{col 46}{space 3}0.715{col 54}{space 4}-.3338707{col 67}{space 3} .4304413
{txt}{space 6}lead25 {c |}{col 14}{res}{space 2}-.2210911{col 26}{space 2} .1807234{col 37}{space 1}   -1.22{col 46}{space 3}0.309{col 54}{space 4}-.7962335{col 67}{space 3} .3540514
{txt}{space 6}lead24 {c |}{col 14}{res}{space 2}-.0416436{col 26}{space 2} .1243866{col 37}{space 1}   -0.33{col 46}{space 3}0.760{col 54}{space 4}-.4374973{col 67}{space 3}   .35421
{txt}{space 6}lead23 {c |}{col 14}{res}{space 2}-.0111385{col 26}{space 2} .0824319{col 37}{space 1}   -0.14{col 46}{space 3}0.901{col 54}{space 4}-.2734735{col 67}{space 3} .2511966
{txt}{space 6}lead22 {c |}{col 14}{res}{space 2} .0529492{col 26}{space 2} .0860657{col 37}{space 1}    0.62{col 46}{space 3}0.582{col 54}{space 4}-.2209501{col 67}{space 3} .3268485
{txt}{space 6}lead21 {c |}{col 14}{res}{space 2}  .169675{col 26}{space 2} .0608478{col 37}{space 1}    2.79{col 46}{space 3}0.069{col 54}{space 4}-.0239697{col 67}{space 3} .3633197
{txt}{space 6}lead20 {c |}{col 14}{res}{space 2} .0377943{col 26}{space 2} .0499138{col 37}{space 1}    0.76{col 46}{space 3}0.504{col 54}{space 4}-.1210539{col 67}{space 3} .1966424
{txt}{space 6}lead19 {c |}{col 14}{res}{space 2}-.0477319{col 26}{space 2} .0839162{col 37}{space 1}   -0.57{col 46}{space 3}0.609{col 54}{space 4}-.3147906{col 67}{space 3} .2193269
{txt}{space 6}lead18 {c |}{col 14}{res}{space 2} .0733311{col 26}{space 2} .0345202{col 37}{space 1}    2.12{col 46}{space 3}0.124{col 54}{space 4}-.0365276{col 67}{space 3} .1831898
{txt}{space 6}lead17 {c |}{col 14}{res}{space 2} .0256013{col 26}{space 2} .1389773{col 37}{space 1}    0.18{col 46}{space 3}0.866{col 54}{space 4}-.4166866{col 67}{space 3} .4678892
{txt}{space 6}lead16 {c |}{col 14}{res}{space 2}-.0919176{col 26}{space 2}   .07659{col 37}{space 1}   -1.20{col 46}{space 3}0.316{col 54}{space 4}-.3356611{col 67}{space 3} .1518259
{txt}{space 6}lead15 {c |}{col 14}{res}{space 2}-.0980228{col 26}{space 2} .0671646{col 37}{space 1}   -1.46{col 46}{space 3}0.241{col 54}{space 4}-.3117706{col 67}{space 3} .1157249
{txt}{space 6}lead14 {c |}{col 14}{res}{space 2} .0213785{col 26}{space 2} .0378951{col 37}{space 1}    0.56{col 46}{space 3}0.612{col 54}{space 4}-.0992208{col 67}{space 3} .1419778
{txt}{space 6}lead13 {c |}{col 14}{res}{space 2} .1760159{col 26}{space 2}  .040869{col 37}{space 1}    4.31{col 46}{space 3}0.023{col 54}{space 4} .0459525{col 67}{space 3} .3060794
{txt}{space 6}lead12 {c |}{col 14}{res}{space 2}-.0423376{col 26}{space 2} .0490158{col 37}{space 1}   -0.86{col 46}{space 3}0.451{col 54}{space 4}-.1983277{col 67}{space 3} .1136524
{txt}{space 6}lead11 {c |}{col 14}{res}{space 2}-.2309949{col 26}{space 2} .1342903{col 37}{space 1}   -1.72{col 46}{space 3}0.184{col 54}{space 4}-.6583666{col 67}{space 3} .1963768
{txt}{space 6}lead10 {c |}{col 14}{res}{space 2}-.2078396{col 26}{space 2} .1573472{col 37}{space 1}   -1.32{col 46}{space 3}0.278{col 54}{space 4}-.7085884{col 67}{space 3} .2929093
{txt}{space 7}lead9 {c |}{col 14}{res}{space 2} -.145703{col 26}{space 2} .1369941{col 37}{space 1}   -1.06{col 46}{space 3}0.366{col 54}{space 4}-.5816793{col 67}{space 3} .2902732
{txt}{space 7}lead8 {c |}{col 14}{res}{space 2} .0828358{col 26}{space 2} .0792877{col 37}{space 1}    1.04{col 46}{space 3}0.373{col 54}{space 4}-.1694932{col 67}{space 3} .3351648
{txt}{space 7}lead7 {c |}{col 14}{res}{space 2} .1574797{col 26}{space 2} .0919993{col 37}{space 1}    1.71{col 46}{space 3}0.185{col 54}{space 4}-.1353032{col 67}{space 3} .4502625
{txt}{space 7}lead6 {c |}{col 14}{res}{space 2}-.0942303{col 26}{space 2} .0803879{col 37}{space 1}   -1.17{col 46}{space 3}0.326{col 54}{space 4}-.3500604{col 67}{space 3} .1615997
{txt}{space 7}lead5 {c |}{col 14}{res}{space 2}-.2118253{col 26}{space 2} .1603963{col 37}{space 1}   -1.32{col 46}{space 3}0.278{col 54}{space 4} -.722278{col 67}{space 3} .2986275
{txt}{space 7}lead4 {c |}{col 14}{res}{space 2}-.2502409{col 26}{space 2} .0119224{col 37}{space 1}  -20.99{col 46}{space 3}0.000{col 54}{space 4}-.2881833{col 67}{space 3}-.2122985
{txt}{space 7}lead3 {c |}{col 14}{res}{space 2}-.2779343{col 26}{space 2} .0256114{col 37}{space 1}  -10.85{col 46}{space 3}0.002{col 54}{space 4}-.3594413{col 67}{space 3}-.1964273
{txt}{space 7}lead2 {c |}{col 14}{res}{space 2}-.1317741{col 26}{space 2}  .110735{col 37}{space 1}   -1.19{col 46}{space 3}0.320{col 54}{space 4}-.4841822{col 67}{space 3} .2206341
{txt}{space 8}lag0 {c |}{col 14}{res}{space 2}-.1241816{col 26}{space 2} .0823373{col 37}{space 1}   -1.51{col 46}{space 3}0.229{col 54}{space 4}-.3862155{col 67}{space 3} .1378523
{txt}{space 8}lag1 {c |}{col 14}{res}{space 2} -.274705{col 26}{space 2} .1170116{col 37}{space 1}   -2.35{col 46}{space 3}0.101{col 54}{space 4}-.6470881{col 67}{space 3} .0976782
{txt}{space 8}lag2 {c |}{col 14}{res}{space 2}-.0370591{col 26}{space 2} .0626896{col 37}{space 1}   -0.59{col 46}{space 3}0.596{col 54}{space 4}-.2365653{col 67}{space 3} .1624471
{txt}{space 8}lag3 {c |}{col 14}{res}{space 2}-.2766024{col 26}{space 2} .0814368{col 37}{space 1}   -3.40{col 46}{space 3}0.043{col 54}{space 4}-.5357707{col 67}{space 3}-.0174342
{txt}{space 8}lag4 {c |}{col 14}{res}{space 2}-.1734408{col 26}{space 2} .0600121{col 37}{space 1}   -2.89{col 46}{space 3}0.063{col 54}{space 4}-.3644261{col 67}{space 3} .0175444
{txt}{space 8}lag5 {c |}{col 14}{res}{space 2} -.167155{col 26}{space 2} .0548545{col 37}{space 1}   -3.05{col 46}{space 3}0.056{col 54}{space 4}-.3417266{col 67}{space 3} .0074167
{txt}{space 8}lag6 {c |}{col 14}{res}{space 2}-.1111551{col 26}{space 2} .0344369{col 37}{space 1}   -3.23{col 46}{space 3}0.048{col 54}{space 4}-.2207486{col 67}{space 3}-.0015615
{txt}{space 8}lag7 {c |}{col 14}{res}{space 2}-.0216899{col 26}{space 2} .0722678{col 37}{space 1}   -0.30{col 46}{space 3}0.784{col 54}{space 4}-.2516782{col 67}{space 3} .2082985
{txt}{space 8}lag8 {c |}{col 14}{res}{space 2} .0263801{col 26}{space 2} .0307502{col 37}{space 1}    0.86{col 46}{space 3}0.454{col 54}{space 4}-.0714808{col 67}{space 3}  .124241
{txt}{space 8}lag9 {c |}{col 14}{res}{space 2}-.0382433{col 26}{space 2} .0580556{col 37}{space 1}   -0.66{col 46}{space 3}0.557{col 54}{space 4} -.223002{col 67}{space 3} .1465154
{txt}{space 7}lag10 {c |}{col 14}{res}{space 2}-.2997679{col 26}{space 2} .0418109{col 37}{space 1}   -7.17{col 46}{space 3}0.006{col 54}{space 4}-.4328287{col 67}{space 3} -.166707
{txt}{space 7}lag11 {c |}{col 14}{res}{space 2}-.1650081{col 26}{space 2}  .082302{col 37}{space 1}   -2.00{col 46}{space 3}0.139{col 54}{space 4}-.4269296{col 67}{space 3} .0969135
{txt}{space 7}lag12 {c |}{col 14}{res}{space 2}-.0971425{col 26}{space 2}   .05008{col 37}{space 1}   -1.94{col 46}{space 3}0.148{col 54}{space 4}-.2565194{col 67}{space 3} .0622344
{txt}{space 7}lag13 {c |}{col 14}{res}{space 2}-.1032501{col 26}{space 2} .0213254{col 37}{space 1}   -4.84{col 46}{space 3}0.017{col 54}{space 4} -.171117{col 67}{space 3}-.0353832
{txt}{space 7}lag14 {c |}{col 14}{res}{space 2}-.0543291{col 26}{space 2} .0829609{col 37}{space 1}   -0.65{col 46}{space 3}0.559{col 54}{space 4}-.3183479{col 67}{space 3} .2096896
{txt}{space 7}lag15 {c |}{col 14}{res}{space 2}-.0713168{col 26}{space 2} .0325449{col 37}{space 1}   -2.19{col 46}{space 3}0.116{col 54}{space 4}-.1748894{col 67}{space 3} .0322557
{txt}{space 7}lag16 {c |}{col 14}{res}{space 2} .0398492{col 26}{space 2} .1590552{col 37}{space 1}    0.25{col 46}{space 3}0.818{col 54}{space 4}-.4663354{col 67}{space 3} .5460339
{txt}{space 7}lag17 {c |}{col 14}{res}{space 2}  .101664{col 26}{space 2} .1224695{col 37}{space 1}    0.83{col 46}{space 3}0.467{col 54}{space 4}-.2880886{col 67}{space 3} .4914166
{txt}{space 7}lag18 {c |}{col 14}{res}{space 2}-.1075733{col 26}{space 2} .2059009{col 37}{space 1}   -0.52{col 46}{space 3}0.637{col 54}{space 4}-.7628417{col 67}{space 3} .5476952
{txt}{space 7}lag19 {c |}{col 14}{res}{space 2}-.0463357{col 26}{space 2} .0907731{col 37}{space 1}   -0.51{col 46}{space 3}0.645{col 54}{space 4}-.3352161{col 67}{space 3} .2425447
{txt}{space 7}lag20 {c |}{col 14}{res}{space 2} -.016839{col 26}{space 2}  .031741{col 37}{space 1}   -0.53{col 46}{space 3}0.633{col 54}{space 4}-.1178529{col 67}{space 3} .0841749
{txt}{space 7}lag21 {c |}{col 14}{res}{space 2} .0172682{col 26}{space 2} .1268032{col 37}{space 1}    0.14{col 46}{space 3}0.900{col 54}{space 4}-.3862762{col 67}{space 3} .4208126
{txt}{space 7}lag22 {c |}{col 14}{res}{space 2}-.0186246{col 26}{space 2} .0686934{col 37}{space 1}   -0.27{col 46}{space 3}0.804{col 54}{space 4}-.2372378{col 67}{space 3} .1999886
{txt}{space 7}lag23 {c |}{col 14}{res}{space 2}-.0799002{col 26}{space 2} .1331994{col 37}{space 1}   -0.60{col 46}{space 3}0.591{col 54}{space 4}-.5038002{col 67}{space 3} .3439998
{txt}{space 7}lag24 {c |}{col 14}{res}{space 2}-.0208168{col 26}{space 2} .0734989{col 37}{space 1}   -0.28{col 46}{space 3}0.795{col 54}{space 4}-.2547232{col 67}{space 3} .2130896
{txt}{space 7}lag25 {c |}{col 14}{res}{space 2}-.0702218{col 26}{space 2} .0959594{col 37}{space 1}   -0.73{col 46}{space 3}0.517{col 54}{space 4}-.3756073{col 67}{space 3} .2351637
{txt}{space 7}lag26 {c |}{col 14}{res}{space 2} -.054247{col 26}{space 2} .0857621{col 37}{space 1}   -0.63{col 46}{space 3}0.572{col 54}{space 4}-.3271804{col 67}{space 3} .2186865
{txt}{space 7}lag27 {c |}{col 14}{res}{space 2}-.0936309{col 26}{space 2}  .012695{col 37}{space 1}   -7.38{col 46}{space 3}0.005{col 54}{space 4}-.1340319{col 67}{space 3}-.0532298
{txt}{space 7}lag28 {c |}{col 14}{res}{space 2}-.0333131{col 26}{space 2} .0827384{col 37}{space 1}   -0.40{col 46}{space 3}0.714{col 54}{space 4}-.2966237{col 67}{space 3} .2299976
{txt}{space 7}lag29 {c |}{col 14}{res}{space 2} .0360039{col 26}{space 2} .0400909{col 37}{space 1}    0.90{col 46}{space 3}0.435{col 54}{space 4}-.0915832{col 67}{space 3}  .163591
{txt}{space 7}lag30 {c |}{col 14}{res}{space 2}-.0625941{col 26}{space 2} .0631238{col 37}{space 1}   -0.99{col 46}{space 3}0.394{col 54}{space 4}-.2634823{col 67}{space 3}  .138294
{txt}{space 7}lag31 {c |}{col 14}{res}{space 2}-.3894054{col 26}{space 2} .2210596{col 37}{space 1}   -1.76{col 46}{space 3}0.176{col 54}{space 4}-1.092916{col 67}{space 3} .3141048
{txt}{space 7}lag32 {c |}{col 14}{res}{space 2}-.1240266{col 26}{space 2} .0436627{col 37}{space 1}   -2.84{col 46}{space 3}0.066{col 54}{space 4}-.2629808{col 67}{space 3} .0149275
{txt}{space 7}lag33 {c |}{col 14}{res}{space 2}-.1062773{col 26}{space 2} .0952288{col 37}{space 1}   -1.12{col 46}{space 3}0.346{col 54}{space 4}-.4093377{col 67}{space 3} .1967831
{txt}{space 7}lag34 {c |}{col 14}{res}{space 2}-.2112128{col 26}{space 2} .1231743{col 37}{space 1}   -1.71{col 46}{space 3}0.185{col 54}{space 4}-.6032085{col 67}{space 3} .1807829
{txt}{space 7}lag35 {c |}{col 14}{res}{space 2}-.1637465{col 26}{space 2} .0277224{col 37}{space 1}   -5.91{col 46}{space 3}0.010{col 54}{space 4}-.2519716{col 67}{space 3}-.0755214
{txt}{space 7}lag36 {c |}{col 14}{res}{space 2} -.147041{col 26}{space 2} .0879232{col 37}{space 1}   -1.67{col 46}{space 3}0.193{col 54}{space 4}-.4268518{col 67}{space 3} .1327698
{txt}{space 7}lag37 {c |}{col 14}{res}{space 2} .0033852{col 26}{space 2} .0262953{col 37}{space 1}    0.13{col 46}{space 3}0.906{col 54}{space 4} -.080298{col 67}{space 3} .0870685
{txt}{space 7}lag38 {c |}{col 14}{res}{space 2} -.187378{col 26}{space 2} .1242874{col 37}{space 1}   -1.51{col 46}{space 3}0.229{col 54}{space 4}-.5829158{col 67}{space 3} .2081599
{txt}{space 7}lag39 {c |}{col 14}{res}{space 2}-.2544313{col 26}{space 2} .0704977{col 37}{space 1}   -3.61{col 46}{space 3}0.037{col 54}{space 4}-.4787864{col 67}{space 3}-.0300762
{txt}{space 7}lag40 {c |}{col 14}{res}{space 2} .0285469{col 26}{space 2} .0253507{col 37}{space 1}    1.13{col 46}{space 3}0.342{col 54}{space 4}-.0521305{col 67}{space 3} .1092243
{txt}{space 7}lag41 {c |}{col 14}{res}{space 2}-.0565405{col 26}{space 2} .0311899{col 37}{space 1}   -1.81{col 46}{space 3}0.168{col 54}{space 4}-.1558006{col 67}{space 3} .0427195
{txt}{space 7}lag42 {c |}{col 14}{res}{space 2}-.0501015{col 26}{space 2} .0277659{col 37}{space 1}   -1.80{col 46}{space 3}0.169{col 54}{space 4}-.1384649{col 67}{space 3} .0382619
{txt}{space 7}lag43 {c |}{col 14}{res}{space 2}-.3497647{col 26}{space 2} .0547696{col 37}{space 1}   -6.39{col 46}{space 3}0.008{col 54}{space 4} -.524066{col 67}{space 3}-.1754634
{txt}{space 7}lag44 {c |}{col 14}{res}{space 2}-.2006704{col 26}{space 2} .1387136{col 37}{space 1}   -1.45{col 46}{space 3}0.244{col 54}{space 4}-.6421191{col 67}{space 3} .2407782
{txt}{space 7}lag45 {c |}{col 14}{res}{space 2}-.4006293{col 26}{space 2} .1713674{col 37}{space 1}   -2.34{col 46}{space 3}0.101{col 54}{space 4}-.9459967{col 67}{space 3} .1447382
{txt}{space 7}lag46 {c |}{col 14}{res}{space 2}-.2681226{col 26}{space 2} .1834533{col 37}{space 1}   -1.46{col 46}{space 3}0.240{col 54}{space 4}-.8519529{col 67}{space 3} .3157076
{txt}{space 7}lag47 {c |}{col 14}{res}{space 2}-.2435329{col 26}{space 2} .0786113{col 37}{space 1}   -3.10{col 46}{space 3}0.053{col 54}{space 4}-.4937091{col 67}{space 3} .0066432
{txt}{space 7}lag48 {c |}{col 14}{res}{space 2}-.0705283{col 26}{space 2} .0398117{col 37}{space 1}   -1.77{col 46}{space 3}0.175{col 54}{space 4} -.197227{col 67}{space 3} .0561704
{txt}{space 7}lag49 {c |}{col 14}{res}{space 2}-.2048305{col 26}{space 2} .1387766{col 37}{space 1}   -1.48{col 46}{space 3}0.236{col 54}{space 4}-.6464795{col 67}{space 3} .2368185
{txt}{space 7}lag50 {c |}{col 14}{res}{space 2}-.2013817{col 26}{space 2} .0527999{col 37}{space 1}   -3.81{col 46}{space 3}0.032{col 54}{space 4}-.3694146{col 67}{space 3}-.0333487
{txt}{space 7}lag51 {c |}{col 14}{res}{space 2}-.2248902{col 26}{space 2} .0564714{col 37}{space 1}   -3.98{col 46}{space 3}0.028{col 54}{space 4}-.4046074{col 67}{space 3} -.045173
{txt}{space 7}lag52 {c |}{col 14}{res}{space 2} -.057037{col 26}{space 2} .1202744{col 37}{space 1}   -0.47{col 46}{space 3}0.668{col 54}{space 4}-.4398039{col 67}{space 3} .3257299
{txt}{space 7}lag53 {c |}{col 14}{res}{space 2}-.2375465{col 26}{space 2} .0924667{col 37}{space 1}   -2.57{col 46}{space 3}0.083{col 54}{space 4}-.5318167{col 67}{space 3} .0567237
{txt}{space 7}lag54 {c |}{col 14}{res}{space 2}-.2125871{col 26}{space 2} .1248351{col 37}{space 1}   -1.70{col 46}{space 3}0.187{col 54}{space 4} -.609868{col 67}{space 3} .1846939
{txt}{space 7}lag55 {c |}{col 14}{res}{space 2}-.2602174{col 26}{space 2} .0951156{col 37}{space 1}   -2.74{col 46}{space 3}0.072{col 54}{space 4}-.5629177{col 67}{space 3} .0424829
{txt}{space 7}lag56 {c |}{col 14}{res}{space 2}-.1213185{col 26}{space 2} .1072493{col 37}{space 1}   -1.13{col 46}{space 3}0.340{col 54}{space 4}-.4626337{col 67}{space 3} .2199967
{txt}{space 7}lag57 {c |}{col 14}{res}{space 2}-.1294644{col 26}{space 2} .0402248{col 37}{space 1}   -3.22{col 46}{space 3}0.049{col 54}{space 4}-.2574776{col 67}{space 3}-.0014511
{txt}{space 7}lag58 {c |}{col 14}{res}{space 2}-.0002799{col 26}{space 2} .1686549{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4}-.5370152{col 67}{space 3} .5364554
{txt}{space 7}lag59 {c |}{col 14}{res}{space 2}-.0893349{col 26}{space 2}  .069587{col 37}{space 1}   -1.28{col 46}{space 3}0.289{col 54}{space 4}-.3107918{col 67}{space 3} .1321219
{txt}{space 7}lag60 {c |}{col 14}{res}{space 2}-.0611744{col 26}{space 2} .1164312{col 37}{space 1}   -0.53{col 46}{space 3}0.636{col 54}{space 4}-.4317103{col 67}{space 3} .3093615
{txt}{space 7}lag61 {c |}{col 14}{res}{space 2}-.1773055{col 26}{space 2}  .064745{col 37}{space 1}   -2.74{col 46}{space 3}0.071{col 54}{space 4} -.383353{col 67}{space 3}  .028742
{txt}{space 7}lag62 {c |}{col 14}{res}{space 2}-.0054828{col 26}{space 2} .0657776{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4}-.2148166{col 67}{space 3}  .203851
{txt}{space 7}lag63 {c |}{col 14}{res}{space 2}-.1992782{col 26}{space 2} .0363813{col 37}{space 1}   -5.48{col 46}{space 3}0.012{col 54}{space 4}-.3150599{col 67}{space 3}-.0834966
{txt}{space 7}lag64 {c |}{col 14}{res}{space 2} .0685109{col 26}{space 2} .0520215{col 37}{space 1}    1.32{col 46}{space 3}0.279{col 54}{space 4}-.0970447{col 67}{space 3} .2340666
{txt}{space 7}lag65 {c |}{col 14}{res}{space 2}-.3870632{col 26}{space 2} .1994645{col 37}{space 1}   -1.94{col 46}{space 3}0.148{col 54}{space 4}-1.021848{col 67}{space 3}  .247722
{txt}{space 7}lag66 {c |}{col 14}{res}{space 2}-.0396845{col 26}{space 2} .0634823{col 37}{space 1}   -0.63{col 46}{space 3}0.576{col 54}{space 4}-.2417136{col 67}{space 3} .1623446
{txt}{space 7}lag67 {c |}{col 14}{res}{space 2} .0153342{col 26}{space 2} .0587763{col 37}{space 1}    0.26{col 46}{space 3}0.811{col 54}{space 4}-.1717183{col 67}{space 3} .2023867
{txt}{space 7}lag68 {c |}{col 14}{res}{space 2} .0807624{col 26}{space 2} .0396876{col 37}{space 1}    2.03{col 46}{space 3}0.135{col 54}{space 4}-.0455412{col 67}{space 3}  .207066
{txt}{space 7}lag69 {c |}{col 14}{res}{space 2}-.1048575{col 26}{space 2} .1014584{col 37}{space 1}   -1.03{col 46}{space 3}0.377{col 54}{space 4}-.4277433{col 67}{space 3} .2180283
{txt}{space 7}lag70 {c |}{col 14}{res}{space 2}-.1255516{col 26}{space 2} .0527642{col 37}{space 1}   -2.38{col 46}{space 3}0.098{col 54}{space 4}-.2934708{col 67}{space 3} .0423676
{txt}{space 7}lag71 {c |}{col 14}{res}{space 2} -.116789{col 26}{space 2} .1161172{col 37}{space 1}   -1.01{col 46}{space 3}0.389{col 54}{space 4}-.4863258{col 67}{space 3} .2527478
{txt}{space 7}lag72 {c |}{col 14}{res}{space 2}-.0018813{col 26}{space 2} .1989543{col 37}{space 1}   -0.01{col 46}{space 3}0.993{col 54}{space 4}-.6350428{col 67}{space 3} .6312802
{txt}{space 7}lag73 {c |}{col 14}{res}{space 2} .0357697{col 26}{space 2} .0602064{col 37}{space 1}    0.59{col 46}{space 3}0.594{col 54}{space 4} -.155834{col 67}{space 3} .2273735
{txt}{space 7}lag74 {c |}{col 14}{res}{space 2}-.3169168{col 26}{space 2} .0473855{col 37}{space 1}   -6.69{col 46}{space 3}0.007{col 54}{space 4}-.4677187{col 67}{space 3}-.1661149
{txt}{space 7}lag75 {c |}{col 14}{res}{space 2}-.0076007{col 26}{space 2} .0662669{col 37}{space 1}   -0.11{col 46}{space 3}0.916{col 54}{space 4}-.2184916{col 67}{space 3} .2032902
{txt}{space 7}lag76 {c |}{col 14}{res}{space 2} -.246916{col 26}{space 2} .0981503{col 37}{space 1}   -2.52{col 46}{space 3}0.087{col 54}{space 4} -.559274{col 67}{space 3} .0654419
{txt}{space 7}lag77 {c |}{col 14}{res}{space 2}-.1381569{col 26}{space 2}  .071884{col 37}{space 1}   -1.92{col 46}{space 3}0.150{col 54}{space 4} -.366924{col 67}{space 3} .0906102
{txt}{space 7}lag78 {c |}{col 14}{res}{space 2}-.0273083{col 26}{space 2} .0318239{col 37}{space 1}   -0.86{col 46}{space 3}0.454{col 54}{space 4}-.1285862{col 67}{space 3} .0739697
{txt}{space 7}lag79 {c |}{col 14}{res}{space 2} -.060549{col 26}{space 2} .0679357{col 37}{space 1}   -0.89{col 46}{space 3}0.438{col 54}{space 4}-.2767508{col 67}{space 3} .1556527
{txt}{space 7}lag80 {c |}{col 14}{res}{space 2} .0071732{col 26}{space 2} .0579572{col 37}{space 1}    0.12{col 46}{space 3}0.909{col 54}{space 4}-.1772725{col 67}{space 3}  .191619
{txt}{space 7}lag81 {c |}{col 14}{res}{space 2}-.0690881{col 26}{space 2} .0728252{col 37}{space 1}   -0.95{col 46}{space 3}0.413{col 54}{space 4}-.3008505{col 67}{space 3} .1626743
{txt}{space 7}lag82 {c |}{col 14}{res}{space 2}-.2370061{col 26}{space 2} .0696386{col 37}{space 1}   -3.40{col 46}{space 3}0.042{col 54}{space 4}-.4586271{col 67}{space 3}-.0153852
{txt}{space 7}lag83 {c |}{col 14}{res}{space 2} .1128412{col 26}{space 2} .0940979{col 37}{space 1}    1.20{col 46}{space 3}0.317{col 54}{space 4}-.1866204{col 67}{space 3} .4123027
{txt}{space 7}lag84 {c |}{col 14}{res}{space 2}  .022887{col 26}{space 2} .0372426{col 37}{space 1}    0.61{col 46}{space 3}0.582{col 54}{space 4}-.0956354{col 67}{space 3} .1414095
{txt}{space 7}lag85 {c |}{col 14}{res}{space 2}-.2212675{col 26}{space 2}  .100099{col 37}{space 1}   -2.21{col 46}{space 3}0.114{col 54}{space 4}-.5398274{col 67}{space 3} .0972923
{txt}{space 7}lag86 {c |}{col 14}{res}{space 2}-.0476507{col 26}{space 2} .1040614{col 37}{space 1}   -0.46{col 46}{space 3}0.678{col 54}{space 4}-.3788204{col 67}{space 3}  .283519
{txt}{space 7}lag87 {c |}{col 14}{res}{space 2}-.0585932{col 26}{space 2} .0554721{col 37}{space 1}   -1.06{col 46}{space 3}0.368{col 54}{space 4}-.2351301{col 67}{space 3} .1179437
{txt}{space 7}lag88 {c |}{col 14}{res}{space 2}-.2564615{col 26}{space 2} .0328125{col 37}{space 1}   -7.82{col 46}{space 3}0.004{col 54}{space 4}-.3608855{col 67}{space 3}-.1520374
{txt}{space 7}lag89 {c |}{col 14}{res}{space 2}-.0215971{col 26}{space 2} .0516593{col 37}{space 1}   -0.42{col 46}{space 3}0.704{col 54}{space 4}-.1860001{col 67}{space 3} .1428058
{txt}{space 7}lag90 {c |}{col 14}{res}{space 2}-.1617387{col 26}{space 2} .0361762{col 37}{space 1}   -4.47{col 46}{space 3}0.021{col 54}{space 4}-.2768675{col 67}{space 3}  -.04661
{txt}{space 7}lag91 {c |}{col 14}{res}{space 2}-.1392027{col 26}{space 2} .0424693{col 37}{space 1}   -3.28{col 46}{space 3}0.047{col 54}{space 4}-.2743589{col 67}{space 3}-.0040465
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.284236{col 26}{space 2} .7589475{col 37}{space 1}    1.69{col 46}{space 3}0.189{col 54}{space 4}-1.131074{col 67}{space 3} 3.699545
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}   regionid1{col 14}{c |}{space 1}        4{col 27}{space 1}        4{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}        date{col 14}{c |}{space 1}     5267{col 27}{space 1}        1{col 39}{result}{space 1}     5266{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. graph export "results/EventStudy-ln(MiddayCo2)-Dropping-Tasmania.png", replace
{txt}{p 0 4 2}
file {bf}
results/EventStudy-ln(MiddayCo2)-Dropping-Tasmania.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. /********** 8. **Tables with lnCO2 and ln Electricity Consumption:*************
>    - DiD regressions for ln(CO2) and ln(electricity consumption) with additional controls.
>    - Results are stored in `eststo ln_CO2_DDD` and `eststo ln_Elec_DDD`.
>    - Tables are generated and exported. */
. 
. use "data/05-half-hourly.dta", clear
{txt}
{com}. gen ln_CO2 = ln(co2_kg_per_capita)
{txt}(132,208 missing values generated)

{com}. gen ln_Elec = ln(energy_kwh_per_capita)
{txt}
{com}. /// DDD regression - adjusting for midday emissions
> reg ln_CO2 c.dst_here_anytime##c.dst_now_anywhere##c.not_midday ///
> weekend_local public_holiday temperature c.temperature#c.temperature ///
> solar_exposure wind_3 [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5333803746322.688)

Linear regression                               Number of obs     = {res} 1,131,864
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1714
                                                {txt}Root MSE          =    {res} .42905

{txt}{ralign 78:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      ln_CO2{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_a~e {c |}{col 14}{res}{space 2}-.3513996{col 26}{space 2} .1241157{col 37}{space 1}   -2.83{col 46}{space 3}0.047{col 54}{space 4}-.6960002{col 67}{space 3}-.0067991
{txt}dst_now_an~e {c |}{col 14}{res}{space 2} .1301432{col 26}{space 2} .0509293{col 37}{space 1}    2.56{col 46}{space 3}0.063{col 54}{space 4}-.0112591{col 67}{space 3} .2715454
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_here_a~e#{c |}
{space 10}c. {c |}
dst_now_an~e {c |}{col 14}{res}{space 2}-.0490121{col 26}{space 2} .0523942{col 37}{space 1}   -0.94{col 46}{space 3}0.403{col 54}{space 4}-.1944817{col 67}{space 3} .0964575
{txt}{space 12} {c |}
{space 2}not_midday {c |}{col 14}{res}{space 2} .0568967{col 26}{space 2} 3.57e-12{col 37}{space 1} 1.6e+10{col 46}{space 3}0.000{col 54}{space 4} .0568967{col 67}{space 3} .0568967
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_here_a~e#{c |}
c.not_midday {c |}{col 14}{res}{space 2} .0015695{col 26}{space 2} .0290559{col 37}{space 1}    0.05{col 46}{space 3}0.960{col 54}{space 4}-.0791025{col 67}{space 3} .0822415
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_now_an~e#{c |}
c.not_midday {c |}{col 14}{res}{space 2}-.0670828{col 26}{space 2} 6.78e-12{col 37}{space 1}-9.9e+09{col 46}{space 3}0.000{col 54}{space 4}-.0670828{col 67}{space 3}-.0670828
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_here_a~e#{c |}
{space 10}c. {c |}
dst_now_an~e#{c |}
c.not_midday {c |}{col 14}{res}{space 2} .0185648{col 26}{space 2} .0311386{col 37}{space 1}    0.60{col 46}{space 3}0.583{col 54}{space 4}-.0678899{col 67}{space 3} .1050194
{txt}{space 12} {c |}
weekend_lo~l {c |}{col 14}{res}{space 2}-.0774456{col 26}{space 2} .0123538{col 37}{space 1}   -6.27{col 46}{space 3}0.003{col 54}{space 4}-.1117454{col 67}{space 3}-.0431459
{txt}public_hol~y {c |}{col 14}{res}{space 2}-.0900296{col 26}{space 2} .0225829{col 37}{space 1}   -3.99{col 46}{space 3}0.016{col 54}{space 4}-.1527297{col 67}{space 3}-.0273294
{txt}{space 1}temperature {c |}{col 14}{res}{space 2}-.0178311{col 26}{space 2} .0351841{col 37}{space 1}   -0.51{col 46}{space 3}0.639{col 54}{space 4}-.1155177{col 67}{space 3} .0798556
{txt}{space 12} {c |}
{space 10}c. {c |}
{space 1}temperature#{c |}
{space 10}c. {c |}
{space 1}temperature {c |}{col 14}{res}{space 2} .0005005{col 26}{space 2} .0005778{col 37}{space 1}    0.87{col 46}{space 3}0.435{col 54}{space 4}-.0011037{col 67}{space 3} .0021047
{txt}{space 12} {c |}
solar_expo~e {c |}{col 14}{res}{space 2}-.0171219{col 26}{space 2}  .020374{col 37}{space 1}   -0.84{col 46}{space 3}0.448{col 54}{space 4}-.0736892{col 67}{space 3} .0394454
{txt}{space 6}wind_3 {c |}{col 14}{res}{space 2}-.2051848{col 26}{space 2} .1020477{col 37}{space 1}   -2.01{col 46}{space 3}0.115{col 54}{space 4}-.4885146{col 67}{space 3}  .078145
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.2776216{col 26}{space 2} .5250456{col 37}{space 1}   -0.53{col 46}{space 3}0.625{col 54}{space 4}-1.735382{col 67}{space 3} 1.180139
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo ln_CO2_DDD
{txt}
{com}. 
. reg ln_Elec c.dst_here_anytime##c.dst_now_anywhere##c.not_midday weekend_local ///
> public_holiday c.temperature##c.temperature solar_exposure wind_3 ///
> [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.3999
                                                {txt}Root MSE          =    {res} .22068

{txt}{ralign 78:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     ln_Elec{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_a~e {c |}{col 14}{res}{space 2}-.4093193{col 26}{space 2} .0464085{col 37}{space 1}   -8.82{col 46}{space 3}0.001{col 54}{space 4}-.5381699{col 67}{space 3}-.2804687
{txt}dst_now_an~e {c |}{col 14}{res}{space 2} .1082112{col 26}{space 2} .0280328{col 37}{space 1}    3.86{col 46}{space 3}0.018{col 54}{space 4} .0303796{col 67}{space 3} .1860428
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_here_a~e#{c |}
{space 10}c. {c |}
dst_now_an~e {c |}{col 14}{res}{space 2}-.0566057{col 26}{space 2} .0336677{col 37}{space 1}   -1.68{col 46}{space 3}0.168{col 54}{space 4}-.1500822{col 67}{space 3} .0368708
{txt}{space 12} {c |}
{space 2}not_midday {c |}{col 14}{res}{space 2} .0223871{col 26}{space 2} 1.43e-12{col 37}{space 1} 1.6e+10{col 46}{space 3}0.000{col 54}{space 4} .0223871{col 67}{space 3} .0223871
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_here_a~e#{c |}
c.not_midday {c |}{col 14}{res}{space 2} .0116052{col 26}{space 2} .0130831{col 37}{space 1}    0.89{col 46}{space 3}0.425{col 54}{space 4}-.0247194{col 67}{space 3} .0479298
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_now_an~e#{c |}
c.not_midday {c |}{col 14}{res}{space 2}-.0764301{col 26}{space 2} 3.25e-12{col 37}{space 1}-2.4e+10{col 46}{space 3}0.000{col 54}{space 4}-.0764301{col 67}{space 3}-.0764301
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_here_a~e#{c |}
{space 10}c. {c |}
dst_now_an~e#{c |}
c.not_midday {c |}{col 14}{res}{space 2} .0153488{col 26}{space 2} .0242448{col 37}{space 1}    0.63{col 46}{space 3}0.561{col 54}{space 4}-.0519655{col 67}{space 3} .0826631
{txt}{space 12} {c |}
weekend_lo~l {c |}{col 14}{res}{space 2}-.0947336{col 26}{space 2} .0108571{col 37}{space 1}   -8.73{col 46}{space 3}0.001{col 54}{space 4}-.1248778{col 67}{space 3}-.0645894
{txt}public_hol~y {c |}{col 14}{res}{space 2}-.1098849{col 26}{space 2} .0154848{col 37}{space 1}   -7.10{col 46}{space 3}0.002{col 54}{space 4}-.1528776{col 67}{space 3}-.0668923
{txt}{space 1}temperature {c |}{col 14}{res}{space 2}-.0401994{col 26}{space 2} .0224744{col 37}{space 1}   -1.79{col 46}{space 3}0.148{col 54}{space 4}-.1025984{col 67}{space 3} .0221995
{txt}{space 12} {c |}
{space 10}c. {c |}
{space 1}temperature#{c |}
{space 10}c. {c |}
{space 1}temperature {c |}{col 14}{res}{space 2} .0008715{col 26}{space 2} .0003803{col 37}{space 1}    2.29{col 46}{space 3}0.084{col 54}{space 4}-.0001844{col 67}{space 3} .0019275
{txt}{space 12} {c |}
solar_expo~e {c |}{col 14}{res}{space 2}-.0147691{col 26}{space 2} .0091328{col 37}{space 1}   -1.62{col 46}{space 3}0.181{col 54}{space 4}-.0401257{col 67}{space 3} .0105875
{txt}{space 6}wind_3 {c |}{col 14}{res}{space 2} .0050325{col 26}{space 2} .0205966{col 37}{space 1}    0.24{col 46}{space 3}0.819{col 54}{space 4}-.0521529{col 67}{space 3} .0622178
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .1111079{col 26}{space 2}  .365545{col 37}{space 1}    0.30{col 46}{space 3}0.776{col 54}{space 4}-.9038076{col 67}{space 3} 1.126024
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo ln_Elec_DDD
{txt}
{com}. 
. esttab ln_CO2_DDD ln_Elec_DDD using "results/ln-DDD-results.tex", ///
>  label se stats(r2 r2_a) replace
{res}{txt}(output written to {browse  `"results/ln-DDD-results.tex"'})

{com}. 
. /********************** 9. **DDD without Controls:*****************************
> - DiD regressions for CO2 emissions and electricity consumption without additional controls.
> - Results are stored in `eststo CO2_DDD_base` and `eststo Elec_DDD_base`.
> */
. 
. use "data/05-half-hourly.dta", clear
{txt}
{com}. //DDD Regression for CO2
. reg co2_kg_per_capita c.dst_here_anytime##c.dst_now_anywhere##c.not_midday ///
>  [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1533
                                                {txt}Root MSE          =    {res} .14871

{txt}{ralign 78:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}co2_kg_per~a{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_a~e {c |}{col 14}{res}{space 2}-.1229028{col 26}{space 2} .0435058{col 37}{space 1}   -2.82{col 46}{space 3}0.048{col 54}{space 4}-.2436942{col 67}{space 3}-.0021113
{txt}dst_now_an~e {c |}{col 14}{res}{space 2} .0584965{col 26}{space 2} 5.59e-14{col 37}{space 1} 1.0e+12{col 46}{space 3}0.000{col 54}{space 4} .0584965{col 67}{space 3} .0584965
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_here_a~e#{c |}
{space 10}c. {c |}
dst_now_an~e {c |}{col 14}{res}{space 2}-.0451268{col 26}{space 2} .0050616{col 37}{space 1}   -8.92{col 46}{space 3}0.001{col 54}{space 4}-.0591801{col 67}{space 3}-.0310736
{txt}{space 12} {c |}
{space 2}not_midday {c |}{col 14}{res}{space 2} .0272147{col 26}{space 2} 1.11e-13{col 37}{space 1} 2.4e+11{col 46}{space 3}0.000{col 54}{space 4} .0272147{col 67}{space 3} .0272147
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_here_a~e#{c |}
c.not_midday {c |}{col 14}{res}{space 2}-.0115314{col 26}{space 2} .0087464{col 37}{space 1}   -1.32{col 46}{space 3}0.258{col 54}{space 4}-.0358154{col 67}{space 3} .0127526
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_now_an~e#{c |}
c.not_midday {c |}{col 14}{res}{space 2}-.0381789{col 26}{space 2} 1.50e-13{col 37}{space 1}-2.5e+11{col 46}{space 3}0.000{col 54}{space 4}-.0381789{col 67}{space 3}-.0381789
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_here_a~e#{c |}
{space 10}c. {c |}
dst_now_an~e#{c |}
c.not_midday {c |}{col 14}{res}{space 2} .0135701{col 26}{space 2} .0128898{col 37}{space 1}    1.05{col 46}{space 3}0.352{col 54}{space 4}-.0222178{col 67}{space 3}  .049358
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5515983{col 26}{space 2} 1.40e-13{col 37}{space 1} 3.9e+12{col 46}{space 3}0.000{col 54}{space 4} .5515983{col 67}{space 3} .5515983
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo CO2_DDD_base
{txt}
{com}. //DDD Regression for Electricity
. reg energy_kwh_per_capita c.dst_here_anytime##c.dst_now_anywhere##c.not_midday ///
>  [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.3278
                                                {txt}Root MSE          =    {res} .12651

{txt}{ralign 78:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}energy_kwh~a{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_a~e {c |}{col 14}{res}{space 2}-.1803211{col 26}{space 2} .0256259{col 37}{space 1}   -7.04{col 46}{space 3}0.002{col 54}{space 4}-.2514701{col 67}{space 3}-.1091721
{txt}dst_now_an~e {c |}{col 14}{res}{space 2}  .079018{col 26}{space 2} 2.19e-13{col 37}{space 1} 3.6e+11{col 46}{space 3}0.000{col 54}{space 4}  .079018{col 67}{space 3}  .079018
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_here_a~e#{c |}
{space 10}c. {c |}
dst_now_an~e {c |}{col 14}{res}{space 2}-.0733837{col 26}{space 2} .0141888{col 37}{space 1}   -5.17{col 46}{space 3}0.007{col 54}{space 4} -.112778{col 67}{space 3}-.0339893
{txt}{space 12} {c |}
{space 2}not_midday {c |}{col 14}{res}{space 2} .0143327{col 26}{space 2} 1.44e-13{col 37}{space 1} 9.9e+10{col 46}{space 3}0.000{col 54}{space 4} .0143327{col 67}{space 3} .0143327
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_here_a~e#{c |}
c.not_midday {c |}{col 14}{res}{space 2} .0008581{col 26}{space 2} .0060752{col 37}{space 1}    0.14{col 46}{space 3}0.895{col 54}{space 4}-.0160095{col 67}{space 3} .0177256
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_now_an~e#{c |}
c.not_midday {c |}{col 14}{res}{space 2}-.0528644{col 26}{space 2} 2.31e-13{col 37}{space 1}-2.3e+11{col 46}{space 3}0.000{col 54}{space 4}-.0528644{col 67}{space 3}-.0528644
{txt}{space 12} {c |}
{space 10}c. {c |}
dst_here_a~e#{c |}
{space 10}c. {c |}
dst_now_an~e#{c |}
c.not_midday {c |}{col 14}{res}{space 2}  .018536{col 26}{space 2} .0109668{col 37}{space 1}    1.69{col 46}{space 3}0.166{col 54}{space 4}-.0119126{col 67}{space 3} .0489847
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .6431092{col 26}{space 2} 1.29e-13{col 37}{space 1} 5.0e+12{col 46}{space 3}0.000{col 54}{space 4} .6431092{col 67}{space 3} .6431092
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo Elec_DDD_base
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Alex\AppData\Local\Temp\STD4cc_000000.tmp"
{txt}
{com}. esttab CO2_DDD_base Elec_DDD_base "results/DDD-base-results.tex", ///
>  label se stats(r2 r2_a) replace
{err}DDD not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\Alex\AppData\Local\Temp\STD4cc_000000.tmp"
{txt}
{com}. esttab CO2_DDD_base Elec_DDD_base using "results/DDD-base-results.tex", ///
>  label se stats(r2 r2_a) replace
{res}{txt}{p 0 4 2}
(file {bf}
results/DDD-base-results.tex{rm}
not found)
{p_end}
(output written to {browse  `"results/DDD-base-results.tex"'})

{com}. 
{txt}end of do-file

{com}. exit, clear
