{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. ********************* 1. Data Import and Transformation:************************
. *                  - Importing and transforming data from the CSV file.
.    
. import delimited using "data/04-half-hourly.csv"
{res}{txt}(encoding automatically selected: ISO-8859-1)
{text}(46 vars, 1,264,072 obs)

{com}. 
. //Transforming data: In the code below we are transforming the following string variables to long types or numerics respectively
. //Date
. gen date_new=date(date_local,"YMD")
{txt}
{com}. format date_new %td
{txt}
{com}. drop date_local
{txt}
{com}. rename date_new date
{res}{txt}
{com}. //DST Date
. gen dst_date_new = date(dst_date, "YMD")
{txt}
{com}. format dst_date_new %td
{txt}
{com}. drop dst_date
{txt}
{com}. rename dst_date_new dst_date
{res}{txt}
{com}. 
. * dst_now_here, Weekend
. *Converts dst_start
. gen dst_start_temp = 0
{txt}
{com}. replace dst_start_temp = 1 if dst_start == "TRUE"
{txt}(649,560 real changes made)

{com}. drop dst_start
{txt}
{com}. rename dst_start_temp dst_start
{res}{txt}
{com}. //after_transition 
. gen after_transition_temp = 0
{txt}
{com}. replace after_transition_temp = 1 if after_transition == "TRUE"
{txt}(629,272 real changes made)

{com}. drop after_transition
{txt}
{com}. rename after_transition_temp after_transition
{res}{txt}
{com}. //dst_now_anywhere
. gen dst_now_anywhere_temp = 0
{txt}
{com}. replace dst_now_anywhere_temp = 1 if dst_now_anywhere == "TRUE"
{txt}(626,280 real changes made)

{com}. drop dst_now_anywhere
{txt}
{com}. rename dst_now_anywhere_temp dst_now_anywhere
{res}{txt}
{com}. //dst_here_anytime
. gen dst_here_anytime_temp = 0
{txt}
{com}. replace dst_here_anytime_temp = 1 if dst_here_anytime == "TRUE"
{txt}(1,011,256 real changes made)

{com}. drop dst_here_anytime
{txt}
{com}. rename dst_here_anytime_temp dst_here_anytime
{res}{txt}
{com}. //Converts dst_now_here
. gen dst_now_here_temp = 0
{txt}
{com}. replace dst_now_here_temp = 1 if dst_now_here == "TRUE"
{txt}(501,000 real changes made)

{com}. drop dst_now_here
{txt}
{com}. rename dst_now_here_temp dst_now_here
{res}{txt}
{com}. //Converts Weekend
. gen Weekend_local_temp = 0
{txt}
{com}. replace Weekend_local_temp = 1 if weekend_local == "TRUE"
{txt}(360,952 real changes made)

{com}. drop weekend_local
{txt}
{com}. rename Weekend_local_temp weekend_local
{res}{txt}
{com}. //Converts public holiday
. gen public_holiday_temp = 0
{txt}
{com}. replace public_holiday_temp = 1 if public_holiday == "TRUE"
{txt}(42,732 real changes made)

{com}. drop public_holiday
{txt}
{com}. rename public_holiday_temp public_holiday
{res}{txt}
{com}. 
. //Converts dst_direction, start is 1
. gen dst_direction_temp = 0
{txt}
{com}. replace dst_direction_temp = 1 if dst_direction == "start"
{txt}(649,560 real changes made)

{com}. drop dst_direction
{txt}
{com}. rename dst_direction_temp dst_direction
{res}{txt}
{com}. //Encodes region id and dst transition
. encode regionid, gen(regionid1)
{txt}
{com}. encode dst_transition_id,gen(dst_transition1)
{txt}
{com}. //Scale by 1/10000 to increase coefficient size for interpretation
. rename wind_km_per_h wind
{res}{txt}
{com}. gen wind_3 = (wind*wind*wind)/10000
{txt}
{com}. //Generate not midday variable for DDD
. gen not_midday = 0
{txt}
{com}. replace not_midday = 1 if not_midday_control_local == "TRUE"
{txt}(1,106,062 real changes made)

{com}. 
. //Generating Labels
. // Labeling variables
. // Labeling variables
. label variable regionid "Region ID"
{txt}
{com}. label variable midday_control_fixed "Midday(Noon time) Control (Fixed Time)"
{txt}
{com}. label variable dst_now_anywhere "DST Now in Any Region (Time)"
{txt}
{com}. label variable not_midday_control_local "Not Midday Control (Local Time)"
{txt}
{com}. label variable co2_kg_per_capita "KG CO2 Emissions per Capita per 30 Minutes"
{txt}
{com}. label variable dst_here_anytime "DST Region (Treatment)"
{txt}
{com}. label variable dst_transition_id "DST Transition ID, per year 2 IDs"
{txt}
{com}. label variable not_midday_control_fixed "Not Midday Control (Fixed Time)"
{txt}
{com}. label variable energy_kwh_per_capita "kWh Electricity Consumption per Capita per 30 Minutes"
{txt}
{com}. label variable dst_now_here "DST Active Here (Treatment*Time)"
{txt}
{com}. label variable days_before_transition "Days Before DST Transition"
{txt}
{com}. label variable hr_local "Local Half-Hour Time"
{txt}
{com}. label variable energy_kwh_adj_rooftop_solar_per "Adjusted kWh Electricity Consumption per Capita per 30 Minutes"
{txt}
{com}. label variable days_after_transition "Days After DST Transition"
{txt}
{com}. label variable hr_fixed "Fixed Half-Hour Time"
{txt}
{com}. label variable total_renewables_today_twh "Total Renewables Today (TWh)"
{txt}
{com}. label variable total_renewables_today_twh_uigf "Total Renewables Today (TWh) - Uncertain Future"
{txt}
{com}. label variable co2_kg_per_capita_midday "Kg CO2 Emissions per Capita compared to the Midday period"
{txt}
{com}. label variable regionid1 "Region ID (Encoded)"
{txt}
{com}. label variable dst_transition1 "DST Transition (Encoded)"
{txt}
{com}. label variable dst_direction "Direction of DST for given transition"
{txt}
{com}. label variable wind "Mean Wind Speed (km/h) per day"
{txt}
{com}. label variable wind_3 "Daily mean Wind Speed (km/h) Cubed"
{txt}
{com}. label variable not_midday "Not Midday time period as a 0 or 1"
{txt}
{com}. label variable rooftop_solar_energy_mwh "Rooftop Solar Energy (MWh) per day"
{txt}
{com}. label variable hh_end_fixed "Fixed End Time"
{txt}
{com}. label variable hh_end_local "Local End Time"
{txt}
{com}. label variable hh_start_fixed "Fixed Start Time"
{txt}
{com}. label variable hh_start_local "Local Start Time"
{txt}
{com}. label variable date_fixed "Fixed Date"
{txt}
{com}. label variable midday_control_local "Midday Control (Local Time)"
{txt}
{com}. label variable midday_control_fixed "Midday Control (Fixed Time)"
{txt}
{com}. label variable not_midday_control_local "Not Midday Control (Local Time)"
{txt}
{com}. label variable not_midday_control_fixed "Not Midday Control (Fixed Time)"
{txt}
{com}. label variable hr_local "Local Half-Hour"
{txt}
{com}. label variable hr_fixed "Fixed Half-Hour"
{txt}
{com}. label variable day_of_week_local "Day of Week (Local Time)"
{txt}
{com}. label variable day_of_week_fixed "Day of Week (Fixed Time)"
{txt}
{com}. label variable weekend_local "Weekend (Local)"
{txt}
{com}. label variable weekend_fixed "Weekend (Fixed)"
{txt}
{com}. label variable public_holiday "1 if Public holiday in Region, 0 otherwise"
{txt}
{com}. label variable days_into_dst_extreme_outlier  "Days into DST for Extreme Outliers"
{txt}
{com}. label variable days_into_dst_outlier "Days into DST for Outliers"
{txt}
{com}. label variable population "Population in given State and Time period"
{txt}
{com}. label variable temperature "Mean Daily Temperature Â°C in given State"
{txt}
{com}. label variable solar_exposure "Solar Exposure Coefficient"
{txt}
{com}. label variable co2_kg_per_capita "KG CO2 Emissions per Capita per 30 Minutes"
{txt}
{com}. label variable energy_kwh_per_capita "kwh Electricity Consumption per Capita per 30 Minutes"
{txt}
{com}. label variable energy_kwh_per_capita_midday "Mean Electricity Consumption (kWh) per Capita during the Midday period"
{txt}
{com}. label variable co2_g_per_capita_vs_midday "CO2 Emissions (g) per Capita compared to the Midday period"
{txt}
{com}. label variable date "Date"
{txt}
{com}. label variable dst_date "DST Date"
{txt}
{com}. label variable dst_start "DST Start"
{txt}
{com}. label variable after_transition "After Transition"
{txt}
{com}. label variable dst_transition_id_and_region "DST Transition ID and Region"
{txt}
{com}. label variable energy_wh_per_capita_vs_midday "Electricity Consumption (Wh) per Capita compared to the Midday period"
{txt}
{com}. label variable days_into_dst "Number of Days into the DST transition"
{txt}
{com}. 
. save "data/06-half-hourly.dta", replace
{txt}{p 0 4 2}
(file {bf}
data/06-half-hourly.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
data/06-half-hourly.dta{rm}
saved
{p_end}

{com}. 
. ///////////////////////// Regressions /////////////////////////////////////////
> /*******************2. Base DiD Regressions:*************************************
> - Event studies for CO2 emissions and electricity consumption using `eventdd`.
> - Plots are generated and exported.
> - Results are stored in `results/EventStudy-Co2.png` and `results/EventStudy-Elec.png`.*/
. use "data/06-half-hourly.dta", clear
{txt}
{com}. 
. //Base 
. reg co2_kg_per_capita c.dst_here_anytime##c.dst_now_anywhere [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(2, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1525
                                                {txt}Root MSE          =    {res} .14878

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}co2_kg_per_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.1332327{col 27}{space 2}  .039085{col 38}{space 1}   -3.41{col 47}{space 3}0.027{col 55}{space 4}  -.24175{col 68}{space 3}-.0247153
{txt}dst_now_any~e {c |}{col 15}{res}{space 2} .0242945{col 27}{space 2} 1.50e-14{col 38}{space 1} 1.6e+12{col 47}{space 3}0.000{col 55}{space 4} .0242945{col 68}{space 3} .0242945
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0329705{col 27}{space 2} .0066293{col 38}{space 1}   -4.97{col 47}{space 3}0.008{col 55}{space 4}-.0513763{col 68}{space 3}-.0145647
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .5759782{col 27}{space 2} 1.41e-14{col 38}{space 1} 4.1e+13{col 47}{space 3}0.000{col 55}{space 4} .5759782{col 68}{space 3} .5759782
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo CO2_Base
{txt}
{com}. //Controls
. reg co2_kg_per_capita c.dst_here_anytime##c.dst_now_anywhere weekend_local public_holiday c.temperature##c.temperature solar_exposure wind_3 [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.2132
                                                {txt}Root MSE          =    {res} .14335

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}co2_kg_per_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.1439874{col 27}{space 2} .0280714{col 38}{space 1}   -5.13{col 47}{space 3}0.007{col 55}{space 4}-.2219261{col 68}{space 3}-.0660486
{txt}dst_now_any~e {c |}{col 15}{res}{space 2} .0262619{col 27}{space 2} .0173514{col 38}{space 1}    1.51{col 47}{space 3}0.205{col 55}{space 4}-.0219132{col 68}{space 3} .0744371
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0181134{col 27}{space 2} .0222476{col 38}{space 1}   -0.81{col 47}{space 3}0.461{col 55}{space 4}-.0798827{col 68}{space 3} .0436559
{txt}{space 13} {c |}
weekend_local {c |}{col 15}{res}{space 2} -.033831{col 27}{space 2} .0013227{col 38}{space 1}  -25.58{col 47}{space 3}0.000{col 55}{space 4}-.0375035{col 68}{space 3}-.0301586
{txt}public_holi~y {c |}{col 15}{res}{space 2}-.0377945{col 27}{space 2} .0055602{col 38}{space 1}   -6.80{col 47}{space 3}0.002{col 55}{space 4}-.0532319{col 68}{space 3} -.022357
{txt}{space 2}temperature {c |}{col 15}{res}{space 2}-.0108863{col 27}{space 2} .0141706{col 38}{space 1}   -0.77{col 47}{space 3}0.485{col 55}{space 4}-.0502303{col 68}{space 3} .0284577
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2} .0002718{col 27}{space 2} .0002346{col 38}{space 1}    1.16{col 47}{space 3}0.311{col 55}{space 4}-.0003796{col 68}{space 3} .0009232
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2}-.0042183{col 27}{space 2}   .00631{col 38}{space 1}   -0.67{col 47}{space 3}0.540{col 55}{space 4}-.0217375{col 68}{space 3}  .013301
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2}-.0593653{col 27}{space 2} .0249105{col 38}{space 1}   -2.38{col 47}{space 3}0.076{col 55}{space 4}-.1285278{col 68}{space 3} .0097972
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} .7364206{col 27}{space 2} .2152255{col 38}{space 1}    3.42{col 47}{space 3}0.027{col 55}{space 4} .1388589{col 68}{space 3} 1.333982
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo CO2_DiD
{txt}
{com}. 
. /// Elec_DiD
> //Base
. reg energy_kwh_per_capita c.dst_here_anytime##c.dst_now_anywhere [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(2, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.3262
                                                {txt}Root MSE          =    {res} .12666

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}energy_kwh_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.1795521{col 27}{space 2} .0284118{col 38}{space 1}   -6.32{col 47}{space 3}0.003{col 55}{space 4}-.2584358{col 68}{space 3}-.1006684
{txt}dst_now_any~e {c |}{col 15}{res}{space 2} .0316603{col 27}{space 2} 6.03e-15{col 38}{space 1} 5.2e+12{col 47}{space 3}0.000{col 55}{space 4} .0316603{col 68}{space 3} .0316603
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0567784{col 27}{space 2} .0091992{col 38}{space 1}   -6.17{col 47}{space 3}0.003{col 55}{space 4}-.0823196{col 68}{space 3}-.0312372
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .6559489{col 27}{space 2} 6.97e-15{col 38}{space 1} 9.4e+13{col 47}{space 3}0.000{col 55}{space 4} .6559489{col 68}{space 3} .6559489
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo Elec_Base
{txt}
{com}. 
. // Controls
. reg energy_kwh_per_capita c.dst_here_anytime##c.dst_now_anywhere weekend_local public_holiday c.temperature##c.temperature solar_exposure wind_3 [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.3781
                                                {txt}Root MSE          =    {res} .12168

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}energy_kwh_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.2149418{col 27}{space 2} .0197522{col 38}{space 1}  -10.88{col 47}{space 3}0.000{col 55}{space 4}-.2697827{col 68}{space 3}-.1601009
{txt}dst_now_any~e {c |}{col 15}{res}{space 2}  .031467{col 27}{space 2} .0173533{col 38}{space 1}    1.81{col 47}{space 3}0.144{col 55}{space 4}-.0167136{col 68}{space 3} .0796476
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0235068{col 27}{space 2} .0160757{col 38}{space 1}   -1.46{col 47}{space 3}0.217{col 55}{space 4}  -.06814{col 68}{space 3} .0211264
{txt}{space 13} {c |}
weekend_local {c |}{col 15}{res}{space 2}-.0461566{col 27}{space 2} .0018091{col 38}{space 1}  -25.51{col 47}{space 3}0.000{col 55}{space 4}-.0511796{col 68}{space 3}-.0411336
{txt}public_holi~y {c |}{col 15}{res}{space 2}-.0498073{col 27}{space 2} .0038723{col 38}{space 1}  -12.86{col 47}{space 3}0.000{col 55}{space 4}-.0605586{col 68}{space 3} -.039056
{txt}{space 2}temperature {c |}{col 15}{res}{space 2}-.0250168{col 27}{space 2}  .016778{col 38}{space 1}   -1.49{col 47}{space 3}0.210{col 55}{space 4}   -.0716{col 68}{space 3} .0215664
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2} .0005213{col 27}{space 2} .0002887{col 38}{space 1}    1.81{col 47}{space 3}0.145{col 55}{space 4}-.0002803{col 68}{space 3} .0013228
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2}-.0081455{col 27}{space 2} .0059962{col 38}{space 1}   -1.36{col 47}{space 3}0.246{col 55}{space 4}-.0247938{col 68}{space 3} .0085027
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2} .0041665{col 27}{space 2} .0118573{col 38}{space 1}    0.35{col 47}{space 3}0.743{col 55}{space 4}-.0287546{col 68}{space 3} .0370876
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} 1.007665{col 27}{space 2} .2649951{col 38}{space 1}    3.80{col 47}{space 3}0.019{col 55}{space 4}  .271921{col 68}{space 3}  1.74341
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo Elec_DiD
{txt}
{com}. 
. esttab CO2_Base Elec_Base CO2_DiD Elec_DiD using "results/DiD-results.tex", label se stats(r2 r2_a) replace
{res}{txt}(output written to {browse  `"results/DiD-results.tex"'})

{com}. 
{txt}end of do-file

{com}. do "/var/folders/6h/778gphg5533gk87_wkb11wqh0000gn/T//SD01922.000000"
{txt}
{com}. use "data/06-half-hourly.dta", clear
{txt}
{com}. gen timevar = .
{txt}(1,264,072 missing values generated)

{com}. replace timevar = days_into_dst if dst_here_anytime == 1
{txt}(1,011,256 real changes made)

{com}. 
. eventdd co2_kg_per_capita public_holiday c.temperature##c.temperature solar_exposure wind_3  [aweight = population], timevar(timevar) method(hdfe, absorb(regionid1 date) cluster(regionid1)) graph_op(ytitle("Co2 kg per capita") xtitle("Days until DST transition") title("Event Study - CO2 Emissions"))
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}{txt}warning: missing F statistic; dropped variables due to collinearity or too few clusters
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,264,072
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F( 190,      4)}{col 67}=          {res}.
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.7944
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7935
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0317
{txt}{col 1}Number of clusters ({res}regionid1{txt}) {col 30}= {res}         5{txt}{col 51}Root MSE{col 67}= {res}    0.0734

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}co2_kg_per_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
public_holi~y {c |}{col 15}{res}{space 2}-.0218586{col 27}{space 2} .0063584{col 38}{space 1}   -3.44{col 47}{space 3}0.026{col 55}{space 4}-.0395124{col 68}{space 3}-.0042048
{txt}{space 2}temperature {c |}{col 15}{res}{space 2}-.0042563{col 27}{space 2} .0033137{col 38}{space 1}   -1.28{col 47}{space 3}0.268{col 55}{space 4}-.0134566{col 68}{space 3}  .004944
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2} .0001287{col 27}{space 2} .0000618{col 38}{space 1}    2.08{col 47}{space 3}0.106{col 55}{space 4}-.0000428{col 68}{space 3} .0003002
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2}-.0001296{col 27}{space 2} .0010202{col 38}{space 1}   -0.13{col 47}{space 3}0.905{col 55}{space 4}-.0029622{col 68}{space 3} .0027029
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2}-.0119872{col 27}{space 2} .0034973{col 38}{space 1}   -3.43{col 47}{space 3}0.027{col 55}{space 4}-.0216972{col 68}{space 3}-.0022771
{txt}{space 7}lead94 {c |}{col 15}{res}{space 2} .0350427{col 27}{space 2} .0274609{col 38}{space 1}    1.28{col 47}{space 3}0.271{col 55}{space 4}-.0412011{col 68}{space 3} .1112865
{txt}{space 7}lead93 {c |}{col 15}{res}{space 2} .0314533{col 27}{space 2} .0289465{col 38}{space 1}    1.09{col 47}{space 3}0.338{col 55}{space 4}-.0489151{col 68}{space 3} .1118217
{txt}{space 7}lead92 {c |}{col 15}{res}{space 2} .0220171{col 27}{space 2} .0248344{col 38}{space 1}    0.89{col 47}{space 3}0.425{col 55}{space 4}-.0469342{col 68}{space 3} .0909684
{txt}{space 7}lead91 {c |}{col 15}{res}{space 2} .0398514{col 27}{space 2} .0133499{col 38}{space 1}    2.99{col 47}{space 3}0.041{col 55}{space 4} .0027861{col 68}{space 3} .0769168
{txt}{space 7}lead90 {c |}{col 15}{res}{space 2}  .037605{col 27}{space 2} .0139601{col 38}{space 1}    2.69{col 47}{space 3}0.054{col 55}{space 4}-.0011546{col 68}{space 3} .0763645
{txt}{space 7}lead89 {c |}{col 15}{res}{space 2} .0418116{col 27}{space 2} .0179443{col 38}{space 1}    2.33{col 47}{space 3}0.080{col 55}{space 4}-.0080096{col 68}{space 3} .0916329
{txt}{space 7}lead88 {c |}{col 15}{res}{space 2}  .042687{col 27}{space 2} .0156983{col 38}{space 1}    2.72{col 47}{space 3}0.053{col 55}{space 4}-.0008986{col 68}{space 3} .0862725
{txt}{space 7}lead87 {c |}{col 15}{res}{space 2} .0467888{col 27}{space 2} .0176167{col 38}{space 1}    2.66{col 47}{space 3}0.057{col 55}{space 4} -.002123{col 68}{space 3} .0957007
{txt}{space 7}lead86 {c |}{col 15}{res}{space 2} .0502186{col 27}{space 2} .0173444{col 38}{space 1}    2.90{col 47}{space 3}0.044{col 55}{space 4} .0020628{col 68}{space 3} .0983744
{txt}{space 7}lead85 {c |}{col 15}{res}{space 2} .0481788{col 27}{space 2} .0170066{col 38}{space 1}    2.83{col 47}{space 3}0.047{col 55}{space 4} .0009609{col 68}{space 3} .0953967
{txt}{space 7}lead84 {c |}{col 15}{res}{space 2} .0384569{col 27}{space 2} .0172337{col 38}{space 1}    2.23{col 47}{space 3}0.089{col 55}{space 4}-.0093917{col 68}{space 3} .0863054
{txt}{space 7}lead83 {c |}{col 15}{res}{space 2} .0388528{col 27}{space 2} .0156439{col 38}{space 1}    2.48{col 47}{space 3}0.068{col 55}{space 4}-.0045818{col 68}{space 3} .0822873
{txt}{space 7}lead82 {c |}{col 15}{res}{space 2}  .041965{col 27}{space 2} .0163983{col 38}{space 1}    2.56{col 47}{space 3}0.063{col 55}{space 4}-.0035639{col 68}{space 3} .0874939
{txt}{space 7}lead81 {c |}{col 15}{res}{space 2} .0389094{col 27}{space 2} .0179423{col 38}{space 1}    2.17{col 47}{space 3}0.096{col 55}{space 4}-.0109063{col 68}{space 3} .0887251
{txt}{space 7}lead80 {c |}{col 15}{res}{space 2} .0401438{col 27}{space 2} .0173438{col 38}{space 1}    2.31{col 47}{space 3}0.082{col 55}{space 4}-.0080104{col 68}{space 3} .0882981
{txt}{space 7}lead79 {c |}{col 15}{res}{space 2} .0432433{col 27}{space 2} .0182887{col 38}{space 1}    2.36{col 47}{space 3}0.077{col 55}{space 4}-.0075342{col 68}{space 3} .0940209
{txt}{space 7}lead78 {c |}{col 15}{res}{space 2} .0420741{col 27}{space 2} .0172579{col 38}{space 1}    2.44{col 47}{space 3}0.071{col 55}{space 4}-.0058414{col 68}{space 3} .0899897
{txt}{space 7}lead77 {c |}{col 15}{res}{space 2} .0378748{col 27}{space 2} .0147254{col 38}{space 1}    2.57{col 47}{space 3}0.062{col 55}{space 4}-.0030094{col 68}{space 3} .0787589
{txt}{space 7}lead76 {c |}{col 15}{res}{space 2} .0449152{col 27}{space 2} .0150935{col 38}{space 1}    2.98{col 47}{space 3}0.041{col 55}{space 4} .0030088{col 68}{space 3} .0868215
{txt}{space 7}lead75 {c |}{col 15}{res}{space 2} .0427233{col 27}{space 2} .0149073{col 38}{space 1}    2.87{col 47}{space 3}0.046{col 55}{space 4}  .001334{col 68}{space 3} .0841126
{txt}{space 7}lead74 {c |}{col 15}{res}{space 2}  .048149{col 27}{space 2} .0132211{col 38}{space 1}    3.64{col 47}{space 3}0.022{col 55}{space 4} .0114412{col 68}{space 3} .0848567
{txt}{space 7}lead73 {c |}{col 15}{res}{space 2} .0442691{col 27}{space 2}  .014803{col 38}{space 1}    2.99{col 47}{space 3}0.040{col 55}{space 4} .0031695{col 68}{space 3} .0853688
{txt}{space 7}lead72 {c |}{col 15}{res}{space 2} .0396293{col 27}{space 2} .0169283{col 38}{space 1}    2.34{col 47}{space 3}0.079{col 55}{space 4}-.0073712{col 68}{space 3} .0866298
{txt}{space 7}lead71 {c |}{col 15}{res}{space 2} .0429221{col 27}{space 2}  .015815{col 38}{space 1}    2.71{col 47}{space 3}0.053{col 55}{space 4}-.0009873{col 68}{space 3} .0868316
{txt}{space 7}lead70 {c |}{col 15}{res}{space 2} .0389362{col 27}{space 2} .0126962{col 38}{space 1}    3.07{col 47}{space 3}0.037{col 55}{space 4}  .003686{col 68}{space 3} .0741864
{txt}{space 7}lead69 {c |}{col 15}{res}{space 2}  .047634{col 27}{space 2} .0118974{col 38}{space 1}    4.00{col 47}{space 3}0.016{col 55}{space 4} .0146016{col 68}{space 3} .0806665
{txt}{space 7}lead68 {c |}{col 15}{res}{space 2} .0527786{col 27}{space 2} .0118918{col 38}{space 1}    4.44{col 47}{space 3}0.011{col 55}{space 4} .0197615{col 68}{space 3} .0857956
{txt}{space 7}lead67 {c |}{col 15}{res}{space 2} .0508542{col 27}{space 2}    .0098{col 38}{space 1}    5.19{col 47}{space 3}0.007{col 55}{space 4}  .023645{col 68}{space 3} .0780635
{txt}{space 7}lead66 {c |}{col 15}{res}{space 2}  .049123{col 27}{space 2} .0137985{col 38}{space 1}    3.56{col 47}{space 3}0.024{col 55}{space 4} .0108122{col 68}{space 3} .0874338
{txt}{space 7}lead65 {c |}{col 15}{res}{space 2} .0487087{col 27}{space 2} .0119926{col 38}{space 1}    4.06{col 47}{space 3}0.015{col 55}{space 4}  .015412{col 68}{space 3} .0820054
{txt}{space 7}lead64 {c |}{col 15}{res}{space 2} .0368039{col 27}{space 2} .0132538{col 38}{space 1}    2.78{col 47}{space 3}0.050{col 55}{space 4} 5.42e-06{col 68}{space 3} .0736023
{txt}{space 7}lead63 {c |}{col 15}{res}{space 2} .0330634{col 27}{space 2} .0133433{col 38}{space 1}    2.48{col 47}{space 3}0.068{col 55}{space 4}-.0039836{col 68}{space 3} .0701103
{txt}{space 7}lead62 {c |}{col 15}{res}{space 2} .0437757{col 27}{space 2} .0151702{col 38}{space 1}    2.89{col 47}{space 3}0.045{col 55}{space 4} .0016565{col 68}{space 3} .0858949
{txt}{space 7}lead61 {c |}{col 15}{res}{space 2} .0497398{col 27}{space 2} .0147093{col 38}{space 1}    3.38{col 47}{space 3}0.028{col 55}{space 4} .0089003{col 68}{space 3} .0905794
{txt}{space 7}lead60 {c |}{col 15}{res}{space 2} .0468237{col 27}{space 2} .0126739{col 38}{space 1}    3.69{col 47}{space 3}0.021{col 55}{space 4} .0116353{col 68}{space 3}  .082012
{txt}{space 7}lead59 {c |}{col 15}{res}{space 2} .0471815{col 27}{space 2} .0144082{col 38}{space 1}    3.27{col 47}{space 3}0.031{col 55}{space 4} .0071779{col 68}{space 3} .0871851
{txt}{space 7}lead58 {c |}{col 15}{res}{space 2} .0446971{col 27}{space 2} .0115146{col 38}{space 1}    3.88{col 47}{space 3}0.018{col 55}{space 4} .0127276{col 68}{space 3} .0766666
{txt}{space 7}lead57 {c |}{col 15}{res}{space 2} .0436218{col 27}{space 2} .0075638{col 38}{space 1}    5.77{col 47}{space 3}0.004{col 55}{space 4} .0226214{col 68}{space 3} .0646222
{txt}{space 7}lead56 {c |}{col 15}{res}{space 2} .0453675{col 27}{space 2}  .010074{col 38}{space 1}    4.50{col 47}{space 3}0.011{col 55}{space 4} .0173975{col 68}{space 3} .0733374
{txt}{space 7}lead55 {c |}{col 15}{res}{space 2} .0485805{col 27}{space 2} .0103136{col 38}{space 1}    4.71{col 47}{space 3}0.009{col 55}{space 4} .0199453{col 68}{space 3} .0772157
{txt}{space 7}lead54 {c |}{col 15}{res}{space 2} .0516011{col 27}{space 2} .0097593{col 38}{space 1}    5.29{col 47}{space 3}0.006{col 55}{space 4} .0245048{col 68}{space 3} .0786973
{txt}{space 7}lead53 {c |}{col 15}{res}{space 2} .0433131{col 27}{space 2} .0098073{col 38}{space 1}    4.42{col 47}{space 3}0.012{col 55}{space 4} .0160836{col 68}{space 3} .0705426
{txt}{space 7}lead52 {c |}{col 15}{res}{space 2} .0423231{col 27}{space 2} .0084885{col 38}{space 1}    4.99{col 47}{space 3}0.008{col 55}{space 4} .0187552{col 68}{space 3}  .065891
{txt}{space 7}lead51 {c |}{col 15}{res}{space 2} .0461533{col 27}{space 2} .0086743{col 38}{space 1}    5.32{col 47}{space 3}0.006{col 55}{space 4} .0220695{col 68}{space 3} .0702371
{txt}{space 7}lead50 {c |}{col 15}{res}{space 2} .0404271{col 27}{space 2} .0065075{col 38}{space 1}    6.21{col 47}{space 3}0.003{col 55}{space 4} .0223594{col 68}{space 3} .0584949
{txt}{space 7}lead49 {c |}{col 15}{res}{space 2} .0425213{col 27}{space 2} .0063266{col 38}{space 1}    6.72{col 47}{space 3}0.003{col 55}{space 4} .0249558{col 68}{space 3} .0600868
{txt}{space 7}lead48 {c |}{col 15}{res}{space 2} .0464228{col 27}{space 2} .0055237{col 38}{space 1}    8.40{col 47}{space 3}0.001{col 55}{space 4} .0310867{col 68}{space 3}  .061759
{txt}{space 7}lead47 {c |}{col 15}{res}{space 2} .0437113{col 27}{space 2} .0055694{col 38}{space 1}    7.85{col 47}{space 3}0.001{col 55}{space 4} .0282483{col 68}{space 3} .0591744
{txt}{space 7}lead46 {c |}{col 15}{res}{space 2} .0390017{col 27}{space 2} .0089704{col 38}{space 1}    4.35{col 47}{space 3}0.012{col 55}{space 4} .0140959{col 68}{space 3} .0639074
{txt}{space 7}lead45 {c |}{col 15}{res}{space 2} .0346201{col 27}{space 2} .0114489{col 38}{space 1}    3.02{col 47}{space 3}0.039{col 55}{space 4} .0028329{col 68}{space 3} .0664074
{txt}{space 7}lead44 {c |}{col 15}{res}{space 2} .0299977{col 27}{space 2} .0100667{col 38}{space 1}    2.98{col 47}{space 3}0.041{col 55}{space 4} .0020482{col 68}{space 3} .0579473
{txt}{space 7}lead43 {c |}{col 15}{res}{space 2} .0293643{col 27}{space 2} .0099167{col 38}{space 1}    2.96{col 47}{space 3}0.042{col 55}{space 4}  .001831{col 68}{space 3} .0568976
{txt}{space 7}lead42 {c |}{col 15}{res}{space 2} .0265425{col 27}{space 2} .0079861{col 38}{space 1}    3.32{col 47}{space 3}0.029{col 55}{space 4} .0043695{col 68}{space 3} .0487155
{txt}{space 7}lead41 {c |}{col 15}{res}{space 2} .0366755{col 27}{space 2} .0071668{col 38}{space 1}    5.12{col 47}{space 3}0.007{col 55}{space 4} .0167773{col 68}{space 3} .0565737
{txt}{space 7}lead40 {c |}{col 15}{res}{space 2} .0403879{col 27}{space 2} .0059486{col 38}{space 1}    6.79{col 47}{space 3}0.002{col 55}{space 4} .0238721{col 68}{space 3} .0569038
{txt}{space 7}lead39 {c |}{col 15}{res}{space 2} .0392556{col 27}{space 2} .0059176{col 38}{space 1}    6.63{col 47}{space 3}0.003{col 55}{space 4} .0228258{col 68}{space 3} .0556855
{txt}{space 7}lead38 {c |}{col 15}{res}{space 2} .0350344{col 27}{space 2} .0079737{col 38}{space 1}    4.39{col 47}{space 3}0.012{col 55}{space 4} .0128958{col 68}{space 3}  .057173
{txt}{space 7}lead37 {c |}{col 15}{res}{space 2} .0360856{col 27}{space 2} .0075319{col 38}{space 1}    4.79{col 47}{space 3}0.009{col 55}{space 4} .0151738{col 68}{space 3} .0569974
{txt}{space 7}lead36 {c |}{col 15}{res}{space 2} .0279891{col 27}{space 2} .0089795{col 38}{space 1}    3.12{col 47}{space 3}0.036{col 55}{space 4} .0030579{col 68}{space 3} .0529202
{txt}{space 7}lead35 {c |}{col 15}{res}{space 2} .0277323{col 27}{space 2} .0088235{col 38}{space 1}    3.14{col 47}{space 3}0.035{col 55}{space 4} .0032342{col 68}{space 3} .0522304
{txt}{space 7}lead34 {c |}{col 15}{res}{space 2} .0334329{col 27}{space 2} .0059637{col 38}{space 1}    5.61{col 47}{space 3}0.005{col 55}{space 4} .0168752{col 68}{space 3} .0499907
{txt}{space 7}lead33 {c |}{col 15}{res}{space 2} .0300722{col 27}{space 2} .0065946{col 38}{space 1}    4.56{col 47}{space 3}0.010{col 55}{space 4} .0117626{col 68}{space 3} .0483818
{txt}{space 7}lead32 {c |}{col 15}{res}{space 2} .0328734{col 27}{space 2}  .003615{col 38}{space 1}    9.09{col 47}{space 3}0.001{col 55}{space 4} .0228364{col 68}{space 3} .0429103
{txt}{space 7}lead31 {c |}{col 15}{res}{space 2} .0284634{col 27}{space 2} .0037521{col 38}{space 1}    7.59{col 47}{space 3}0.002{col 55}{space 4} .0180459{col 68}{space 3} .0388809
{txt}{space 7}lead30 {c |}{col 15}{res}{space 2} .0255301{col 27}{space 2} .0059764{col 38}{space 1}    4.27{col 47}{space 3}0.013{col 55}{space 4}  .008937{col 68}{space 3} .0421233
{txt}{space 7}lead29 {c |}{col 15}{res}{space 2} .0342967{col 27}{space 2} .0068752{col 38}{space 1}    4.99{col 47}{space 3}0.008{col 55}{space 4} .0152081{col 68}{space 3} .0533853
{txt}{space 7}lead28 {c |}{col 15}{res}{space 2}  .027804{col 27}{space 2} .0042242{col 38}{space 1}    6.58{col 47}{space 3}0.003{col 55}{space 4} .0160758{col 68}{space 3} .0395322
{txt}{space 7}lead27 {c |}{col 15}{res}{space 2} .0231151{col 27}{space 2} .0073629{col 38}{space 1}    3.14{col 47}{space 3}0.035{col 55}{space 4} .0026725{col 68}{space 3} .0435577
{txt}{space 7}lead26 {c |}{col 15}{res}{space 2} .0215501{col 27}{space 2} .0045856{col 38}{space 1}    4.70{col 47}{space 3}0.009{col 55}{space 4} .0088185{col 68}{space 3} .0342818
{txt}{space 7}lead25 {c |}{col 15}{res}{space 2} .0247845{col 27}{space 2} .0047248{col 38}{space 1}    5.25{col 47}{space 3}0.006{col 55}{space 4} .0116665{col 68}{space 3} .0379026
{txt}{space 7}lead24 {c |}{col 15}{res}{space 2} .0197462{col 27}{space 2}  .003705{col 38}{space 1}    5.33{col 47}{space 3}0.006{col 55}{space 4} .0094596{col 68}{space 3} .0300329
{txt}{space 7}lead23 {c |}{col 15}{res}{space 2} .0154082{col 27}{space 2} .0059867{col 38}{space 1}    2.57{col 47}{space 3}0.062{col 55}{space 4}-.0012135{col 68}{space 3} .0320299
{txt}{space 7}lead22 {c |}{col 15}{res}{space 2} .0147286{col 27}{space 2} .0027876{col 38}{space 1}    5.28{col 47}{space 3}0.006{col 55}{space 4} .0069889{col 68}{space 3} .0224684
{txt}{space 7}lead21 {c |}{col 15}{res}{space 2} .0147372{col 27}{space 2} .0031465{col 38}{space 1}    4.68{col 47}{space 3}0.009{col 55}{space 4}  .006001{col 68}{space 3} .0234735
{txt}{space 7}lead20 {c |}{col 15}{res}{space 2}  .019604{col 27}{space 2} .0017159{col 38}{space 1}   11.42{col 47}{space 3}0.000{col 55}{space 4} .0148399{col 68}{space 3} .0243681
{txt}{space 7}lead19 {c |}{col 15}{res}{space 2} .0264664{col 27}{space 2} .0015505{col 38}{space 1}   17.07{col 47}{space 3}0.000{col 55}{space 4} .0221615{col 68}{space 3} .0307712
{txt}{space 7}lead18 {c |}{col 15}{res}{space 2} .0208007{col 27}{space 2} .0013037{col 38}{space 1}   15.96{col 47}{space 3}0.000{col 55}{space 4} .0171811{col 68}{space 3} .0244204
{txt}{space 7}lead17 {c |}{col 15}{res}{space 2} .0192021{col 27}{space 2} .0015997{col 38}{space 1}   12.00{col 47}{space 3}0.000{col 55}{space 4} .0147606{col 68}{space 3} .0236437
{txt}{space 7}lead16 {c |}{col 15}{res}{space 2} .0091732{col 27}{space 2} .0015494{col 38}{space 1}    5.92{col 47}{space 3}0.004{col 55}{space 4} .0048714{col 68}{space 3}  .013475
{txt}{space 7}lead15 {c |}{col 15}{res}{space 2} .0018351{col 27}{space 2} .0024576{col 38}{space 1}    0.75{col 47}{space 3}0.497{col 55}{space 4}-.0049883{col 68}{space 3} .0086585
{txt}{space 7}lead14 {c |}{col 15}{res}{space 2} .0008908{col 27}{space 2} .0049136{col 38}{space 1}    0.18{col 47}{space 3}0.865{col 55}{space 4}-.0127515{col 68}{space 3} .0145332
{txt}{space 7}lead13 {c |}{col 15}{res}{space 2} .0038943{col 27}{space 2} .0019498{col 38}{space 1}    2.00{col 47}{space 3}0.116{col 55}{space 4}-.0015191{col 68}{space 3} .0093077
{txt}{space 7}lead12 {c |}{col 15}{res}{space 2} .0062269{col 27}{space 2} .0021891{col 38}{space 1}    2.84{col 47}{space 3}0.047{col 55}{space 4}  .000149{col 68}{space 3} .0123049
{txt}{space 7}lead11 {c |}{col 15}{res}{space 2} .0047007{col 27}{space 2} .0010052{col 38}{space 1}    4.68{col 47}{space 3}0.009{col 55}{space 4} .0019099{col 68}{space 3} .0074916
{txt}{space 7}lead10 {c |}{col 15}{res}{space 2}  .006671{col 27}{space 2} .0012833{col 38}{space 1}    5.20{col 47}{space 3}0.007{col 55}{space 4}  .003108{col 68}{space 3}  .010234
{txt}{space 8}lead9 {c |}{col 15}{res}{space 2} .0122594{col 27}{space 2} .0024545{col 38}{space 1}    4.99{col 47}{space 3}0.008{col 55}{space 4} .0054445{col 68}{space 3} .0190743
{txt}{space 8}lead8 {c |}{col 15}{res}{space 2}  .015931{col 27}{space 2}  .001906{col 38}{space 1}    8.36{col 47}{space 3}0.001{col 55}{space 4} .0106392{col 68}{space 3} .0212228
{txt}{space 8}lead7 {c |}{col 15}{res}{space 2}  .002843{col 27}{space 2} .0027237{col 38}{space 1}    1.04{col 47}{space 3}0.355{col 55}{space 4}-.0047191{col 68}{space 3} .0104052
{txt}{space 8}lead6 {c |}{col 15}{res}{space 2}-.0011334{col 27}{space 2} .0019349{col 38}{space 1}   -0.59{col 47}{space 3}0.589{col 55}{space 4}-.0065056{col 68}{space 3} .0042388
{txt}{space 8}lead5 {c |}{col 15}{res}{space 2} .0011339{col 27}{space 2} .0013525{col 38}{space 1}    0.84{col 47}{space 3}0.449{col 55}{space 4}-.0026214{col 68}{space 3} .0048892
{txt}{space 8}lead4 {c |}{col 15}{res}{space 2} .0096778{col 27}{space 2} .0022062{col 38}{space 1}    4.39{col 47}{space 3}0.012{col 55}{space 4} .0035523{col 68}{space 3} .0158032
{txt}{space 8}lead3 {c |}{col 15}{res}{space 2}  .008466{col 27}{space 2} .0045868{col 38}{space 1}    1.85{col 47}{space 3}0.139{col 55}{space 4}-.0042691{col 68}{space 3} .0212011
{txt}{space 8}lead2 {c |}{col 15}{res}{space 2} .0046238{col 27}{space 2} .0015502{col 38}{space 1}    2.98{col 47}{space 3}0.041{col 55}{space 4} .0003196{col 68}{space 3} .0089279
{txt}{space 9}lag0 {c |}{col 15}{res}{space 2} .0010874{col 27}{space 2} .0047543{col 38}{space 1}    0.23{col 47}{space 3}0.830{col 55}{space 4}-.0121127{col 68}{space 3} .0142874
{txt}{space 9}lag1 {c |}{col 15}{res}{space 2}-.0023664{col 27}{space 2} .0043518{col 38}{space 1}   -0.54{col 47}{space 3}0.615{col 55}{space 4} -.014449{col 68}{space 3} .0097161
{txt}{space 9}lag2 {c |}{col 15}{res}{space 2} .0052666{col 27}{space 2} .0031419{col 38}{space 1}    1.68{col 47}{space 3}0.169{col 55}{space 4}-.0034566{col 68}{space 3} .0139899
{txt}{space 9}lag3 {c |}{col 15}{res}{space 2} .0103663{col 27}{space 2} .0018517{col 38}{space 1}    5.60{col 47}{space 3}0.005{col 55}{space 4} .0052251{col 68}{space 3} .0155075
{txt}{space 9}lag4 {c |}{col 15}{res}{space 2}-.0002424{col 27}{space 2} .0011591{col 38}{space 1}   -0.21{col 47}{space 3}0.845{col 55}{space 4}-.0034604{col 68}{space 3} .0029757
{txt}{space 9}lag5 {c |}{col 15}{res}{space 2} .0019102{col 27}{space 2}   .00129{col 38}{space 1}    1.48{col 47}{space 3}0.213{col 55}{space 4}-.0016714{col 68}{space 3} .0054917
{txt}{space 9}lag6 {c |}{col 15}{res}{space 2}  .003698{col 27}{space 2} .0018715{col 38}{space 1}    1.98{col 47}{space 3}0.119{col 55}{space 4}-.0014981{col 68}{space 3} .0088942
{txt}{space 9}lag7 {c |}{col 15}{res}{space 2} .0057498{col 27}{space 2} .0017967{col 38}{space 1}    3.20{col 47}{space 3}0.033{col 55}{space 4} .0007613{col 68}{space 3} .0107382
{txt}{space 9}lag8 {c |}{col 15}{res}{space 2} .0048291{col 27}{space 2}  .001724{col 38}{space 1}    2.80{col 47}{space 3}0.049{col 55}{space 4} .0000426{col 68}{space 3} .0096156
{txt}{space 9}lag9 {c |}{col 15}{res}{space 2} .0083291{col 27}{space 2} .0021126{col 38}{space 1}    3.94{col 47}{space 3}0.017{col 55}{space 4} .0024636{col 68}{space 3} .0141947
{txt}{space 8}lag10 {c |}{col 15}{res}{space 2} .0054413{col 27}{space 2}  .001399{col 38}{space 1}    3.89{col 47}{space 3}0.018{col 55}{space 4}  .001557{col 68}{space 3} .0093256
{txt}{space 8}lag11 {c |}{col 15}{res}{space 2} .0044247{col 27}{space 2} .0019851{col 38}{space 1}    2.23{col 47}{space 3}0.090{col 55}{space 4}-.0010867{col 68}{space 3} .0099362
{txt}{space 8}lag12 {c |}{col 15}{res}{space 2} .0108434{col 27}{space 2} .0022219{col 38}{space 1}    4.88{col 47}{space 3}0.008{col 55}{space 4} .0046744{col 68}{space 3} .0170124
{txt}{space 8}lag13 {c |}{col 15}{res}{space 2} .0048891{col 27}{space 2} .0033581{col 38}{space 1}    1.46{col 47}{space 3}0.219{col 55}{space 4}-.0044346{col 68}{space 3} .0142128
{txt}{space 8}lag14 {c |}{col 15}{res}{space 2} .0042339{col 27}{space 2} .0016316{col 38}{space 1}    2.59{col 47}{space 3}0.060{col 55}{space 4}-.0002961{col 68}{space 3} .0087639
{txt}{space 8}lag15 {c |}{col 15}{res}{space 2} .0071102{col 27}{space 2} .0018944{col 38}{space 1}    3.75{col 47}{space 3}0.020{col 55}{space 4} .0018504{col 68}{space 3}   .01237
{txt}{space 8}lag16 {c |}{col 15}{res}{space 2} .0141267{col 27}{space 2} .0036585{col 38}{space 1}    3.86{col 47}{space 3}0.018{col 55}{space 4} .0039691{col 68}{space 3} .0242843
{txt}{space 8}lag17 {c |}{col 15}{res}{space 2} .0031162{col 27}{space 2} .0020913{col 38}{space 1}    1.49{col 47}{space 3}0.210{col 55}{space 4}-.0026901{col 68}{space 3} .0089225
{txt}{space 8}lag18 {c |}{col 15}{res}{space 2}  .006399{col 27}{space 2} .0020277{col 38}{space 1}    3.16{col 47}{space 3}0.034{col 55}{space 4} .0007692{col 68}{space 3} .0120288
{txt}{space 8}lag19 {c |}{col 15}{res}{space 2} .0113461{col 27}{space 2} .0073418{col 38}{space 1}    1.55{col 47}{space 3}0.197{col 55}{space 4}-.0090381{col 68}{space 3} .0317303
{txt}{space 8}lag20 {c |}{col 15}{res}{space 2} .0015785{col 27}{space 2} .0059784{col 38}{space 1}    0.26{col 47}{space 3}0.805{col 55}{space 4}-.0150202{col 68}{space 3} .0181772
{txt}{space 8}lag21 {c |}{col 15}{res}{space 2}-.0034021{col 27}{space 2} .0031009{col 38}{space 1}   -1.10{col 47}{space 3}0.334{col 55}{space 4}-.0120118{col 68}{space 3} .0052075
{txt}{space 8}lag22 {c |}{col 15}{res}{space 2} .0009607{col 27}{space 2} .0040437{col 38}{space 1}    0.24{col 47}{space 3}0.824{col 55}{space 4}-.0102666{col 68}{space 3} .0121879
{txt}{space 8}lag23 {c |}{col 15}{res}{space 2} .0051576{col 27}{space 2} .0044499{col 38}{space 1}    1.16{col 47}{space 3}0.311{col 55}{space 4}-.0071973{col 68}{space 3} .0175125
{txt}{space 8}lag24 {c |}{col 15}{res}{space 2}  .003314{col 27}{space 2} .0062102{col 38}{space 1}    0.53{col 47}{space 3}0.622{col 55}{space 4}-.0139282{col 68}{space 3} .0205562
{txt}{space 8}lag25 {c |}{col 15}{res}{space 2}  .003031{col 27}{space 2} .0058056{col 38}{space 1}    0.52{col 47}{space 3}0.629{col 55}{space 4}-.0130879{col 68}{space 3} .0191499
{txt}{space 8}lag26 {c |}{col 15}{res}{space 2} .0051315{col 27}{space 2} .0034201{col 38}{space 1}    1.50{col 47}{space 3}0.208{col 55}{space 4}-.0043643{col 68}{space 3} .0146272
{txt}{space 8}lag27 {c |}{col 15}{res}{space 2}  .010342{col 27}{space 2} .0015314{col 38}{space 1}    6.75{col 47}{space 3}0.003{col 55}{space 4}   .00609{col 68}{space 3} .0145939
{txt}{space 8}lag28 {c |}{col 15}{res}{space 2} .0066209{col 27}{space 2} .0029355{col 38}{space 1}    2.26{col 47}{space 3}0.087{col 55}{space 4}-.0015294{col 68}{space 3} .0147712
{txt}{space 8}lag29 {c |}{col 15}{res}{space 2} .0096346{col 27}{space 2} .0022794{col 38}{space 1}    4.23{col 47}{space 3}0.013{col 55}{space 4}  .003306{col 68}{space 3} .0159631
{txt}{space 8}lag30 {c |}{col 15}{res}{space 2} .0079994{col 27}{space 2} .0023377{col 38}{space 1}    3.42{col 47}{space 3}0.027{col 55}{space 4}  .001509{col 68}{space 3} .0144898
{txt}{space 8}lag31 {c |}{col 15}{res}{space 2} .0151834{col 27}{space 2} .0034083{col 38}{space 1}    4.45{col 47}{space 3}0.011{col 55}{space 4} .0057204{col 68}{space 3} .0246465
{txt}{space 8}lag32 {c |}{col 15}{res}{space 2} .0146536{col 27}{space 2} .0039246{col 38}{space 1}    3.73{col 47}{space 3}0.020{col 55}{space 4} .0037571{col 68}{space 3} .0255501
{txt}{space 8}lag33 {c |}{col 15}{res}{space 2} .0123724{col 27}{space 2} .0021101{col 38}{space 1}    5.86{col 47}{space 3}0.004{col 55}{space 4} .0065139{col 68}{space 3} .0182309
{txt}{space 8}lag34 {c |}{col 15}{res}{space 2} .0087906{col 27}{space 2} .0024816{col 38}{space 1}    3.54{col 47}{space 3}0.024{col 55}{space 4} .0019006{col 68}{space 3} .0156806
{txt}{space 8}lag35 {c |}{col 15}{res}{space 2}-.0022255{col 27}{space 2} .0018715{col 38}{space 1}   -1.19{col 47}{space 3}0.300{col 55}{space 4}-.0074215{col 68}{space 3} .0029705
{txt}{space 8}lag36 {c |}{col 15}{res}{space 2}-.0067105{col 27}{space 2} .0018182{col 38}{space 1}   -3.69{col 47}{space 3}0.021{col 55}{space 4}-.0117586{col 68}{space 3}-.0016625
{txt}{space 8}lag37 {c |}{col 15}{res}{space 2}-.0072655{col 27}{space 2} .0014697{col 38}{space 1}   -4.94{col 47}{space 3}0.008{col 55}{space 4}-.0113461{col 68}{space 3}-.0031849
{txt}{space 8}lag38 {c |}{col 15}{res}{space 2}-.0014549{col 27}{space 2} .0024416{col 38}{space 1}   -0.60{col 47}{space 3}0.583{col 55}{space 4}-.0082337{col 68}{space 3}  .005324
{txt}{space 8}lag39 {c |}{col 15}{res}{space 2} .0019553{col 27}{space 2} .0034673{col 38}{space 1}    0.56{col 47}{space 3}0.603{col 55}{space 4}-.0076715{col 68}{space 3} .0115821
{txt}{space 8}lag40 {c |}{col 15}{res}{space 2}-.0042994{col 27}{space 2} .0019114{col 38}{space 1}   -2.25{col 47}{space 3}0.088{col 55}{space 4}-.0096062{col 68}{space 3} .0010074
{txt}{space 8}lag41 {c |}{col 15}{res}{space 2}-.0072456{col 27}{space 2} .0018915{col 38}{space 1}   -3.83{col 47}{space 3}0.019{col 55}{space 4}-.0124973{col 68}{space 3}-.0019938
{txt}{space 8}lag42 {c |}{col 15}{res}{space 2}-.0061894{col 27}{space 2} .0044934{col 38}{space 1}   -1.38{col 47}{space 3}0.240{col 55}{space 4}-.0186651{col 68}{space 3} .0062863
{txt}{space 8}lag43 {c |}{col 15}{res}{space 2}-.0041847{col 27}{space 2} .0027993{col 38}{space 1}   -1.49{col 47}{space 3}0.209{col 55}{space 4}-.0119569{col 68}{space 3} .0035876
{txt}{space 8}lag44 {c |}{col 15}{res}{space 2} .0005681{col 27}{space 2} .0034307{col 38}{space 1}    0.17{col 47}{space 3}0.877{col 55}{space 4}-.0089571{col 68}{space 3} .0100934
{txt}{space 8}lag45 {c |}{col 15}{res}{space 2}-.0083468{col 27}{space 2} .0033609{col 38}{space 1}   -2.48{col 47}{space 3}0.068{col 55}{space 4}-.0176783{col 68}{space 3} .0009846
{txt}{space 8}lag46 {c |}{col 15}{res}{space 2}-.0126428{col 27}{space 2} .0018641{col 38}{space 1}   -6.78{col 47}{space 3}0.002{col 55}{space 4}-.0178184{col 68}{space 3}-.0074672
{txt}{space 8}lag47 {c |}{col 15}{res}{space 2}-.0053448{col 27}{space 2} .0035673{col 38}{space 1}   -1.50{col 47}{space 3}0.208{col 55}{space 4}-.0152493{col 68}{space 3} .0045598
{txt}{space 8}lag48 {c |}{col 15}{res}{space 2}-.0017281{col 27}{space 2} .0037924{col 38}{space 1}   -0.46{col 47}{space 3}0.672{col 55}{space 4}-.0122575{col 68}{space 3} .0088013
{txt}{space 8}lag49 {c |}{col 15}{res}{space 2}-.0044835{col 27}{space 2} .0040555{col 38}{space 1}   -1.11{col 47}{space 3}0.331{col 55}{space 4}-.0157434{col 68}{space 3} .0067765
{txt}{space 8}lag50 {c |}{col 15}{res}{space 2} .0000545{col 27}{space 2} .0024893{col 38}{space 1}    0.02{col 47}{space 3}0.984{col 55}{space 4} -.006857{col 68}{space 3} .0069659
{txt}{space 8}lag51 {c |}{col 15}{res}{space 2} .0007797{col 27}{space 2} .0035347{col 38}{space 1}    0.22{col 47}{space 3}0.836{col 55}{space 4}-.0090342{col 68}{space 3} .0105936
{txt}{space 8}lag52 {c |}{col 15}{res}{space 2}-.0018752{col 27}{space 2}  .002718{col 38}{space 1}   -0.69{col 47}{space 3}0.528{col 55}{space 4}-.0094217{col 68}{space 3} .0056713
{txt}{space 8}lag53 {c |}{col 15}{res}{space 2} .0000372{col 27}{space 2} .0032351{col 38}{space 1}    0.01{col 47}{space 3}0.991{col 55}{space 4} -.008945{col 68}{space 3} .0090193
{txt}{space 8}lag54 {c |}{col 15}{res}{space 2}-.0009474{col 27}{space 2} .0042956{col 38}{space 1}   -0.22{col 47}{space 3}0.836{col 55}{space 4} -.012874{col 68}{space 3} .0109793
{txt}{space 8}lag55 {c |}{col 15}{res}{space 2}-.0026855{col 27}{space 2}  .008566{col 38}{space 1}   -0.31{col 47}{space 3}0.770{col 55}{space 4}-.0264684{col 68}{space 3} .0210975
{txt}{space 8}lag56 {c |}{col 15}{res}{space 2}-.0091677{col 27}{space 2}  .004345{col 38}{space 1}   -2.11{col 47}{space 3}0.102{col 55}{space 4}-.0212314{col 68}{space 3} .0028959
{txt}{space 8}lag57 {c |}{col 15}{res}{space 2}-.0098426{col 27}{space 2} .0053771{col 38}{space 1}   -1.83{col 47}{space 3}0.141{col 55}{space 4}-.0247716{col 68}{space 3} .0050865
{txt}{space 8}lag58 {c |}{col 15}{res}{space 2}-.0124077{col 27}{space 2} .0060415{col 38}{space 1}   -2.05{col 47}{space 3}0.109{col 55}{space 4}-.0291815{col 68}{space 3} .0043662
{txt}{space 8}lag59 {c |}{col 15}{res}{space 2}-.0156228{col 27}{space 2} .0038498{col 38}{space 1}   -4.06{col 47}{space 3}0.015{col 55}{space 4}-.0263116{col 68}{space 3} -.004934
{txt}{space 8}lag60 {c |}{col 15}{res}{space 2} -.007941{col 27}{space 2} .0037879{col 38}{space 1}   -2.10{col 47}{space 3}0.104{col 55}{space 4} -.018458{col 68}{space 3}  .002576
{txt}{space 8}lag61 {c |}{col 15}{res}{space 2}-.0082504{col 27}{space 2} .0030442{col 38}{space 1}   -2.71{col 47}{space 3}0.054{col 55}{space 4}-.0167024{col 68}{space 3} .0002016
{txt}{space 8}lag62 {c |}{col 15}{res}{space 2} .0024918{col 27}{space 2} .0033215{col 38}{space 1}    0.75{col 47}{space 3}0.495{col 55}{space 4}-.0067301{col 68}{space 3} .0117136
{txt}{space 8}lag63 {c |}{col 15}{res}{space 2}-.0019699{col 27}{space 2}  .003868{col 38}{space 1}   -0.51{col 47}{space 3}0.637{col 55}{space 4}-.0127093{col 68}{space 3} .0087695
{txt}{space 8}lag64 {c |}{col 15}{res}{space 2} .0012003{col 27}{space 2} .0057562{col 38}{space 1}    0.21{col 47}{space 3}0.845{col 55}{space 4}-.0147815{col 68}{space 3}  .017182
{txt}{space 8}lag65 {c |}{col 15}{res}{space 2}  .007677{col 27}{space 2} .0059422{col 38}{space 1}    1.29{col 47}{space 3}0.266{col 55}{space 4}-.0088212{col 68}{space 3} .0241752
{txt}{space 8}lag66 {c |}{col 15}{res}{space 2}-.0006977{col 27}{space 2} .0072625{col 38}{space 1}   -0.10{col 47}{space 3}0.928{col 55}{space 4}-.0208616{col 68}{space 3} .0194661
{txt}{space 8}lag67 {c |}{col 15}{res}{space 2}-.0113447{col 27}{space 2} .0071628{col 38}{space 1}   -1.58{col 47}{space 3}0.188{col 55}{space 4}-.0312318{col 68}{space 3} .0085424
{txt}{space 8}lag68 {c |}{col 15}{res}{space 2}-.0075767{col 27}{space 2} .0063651{col 38}{space 1}   -1.19{col 47}{space 3}0.300{col 55}{space 4}-.0252492{col 68}{space 3} .0100957
{txt}{space 8}lag69 {c |}{col 15}{res}{space 2}-.0051472{col 27}{space 2} .0038609{col 38}{space 1}   -1.33{col 47}{space 3}0.253{col 55}{space 4}-.0158668{col 68}{space 3} .0055724
{txt}{space 8}lag70 {c |}{col 15}{res}{space 2}-.0013194{col 27}{space 2} .0038697{col 38}{space 1}   -0.34{col 47}{space 3}0.750{col 55}{space 4}-.0120633{col 68}{space 3} .0094246
{txt}{space 8}lag71 {c |}{col 15}{res}{space 2} .0050821{col 27}{space 2} .0047539{col 38}{space 1}    1.07{col 47}{space 3}0.345{col 55}{space 4}-.0081169{col 68}{space 3} .0182811
{txt}{space 8}lag72 {c |}{col 15}{res}{space 2} .0051855{col 27}{space 2} .0046609{col 38}{space 1}    1.11{col 47}{space 3}0.328{col 55}{space 4}-.0077552{col 68}{space 3} .0181262
{txt}{space 8}lag73 {c |}{col 15}{res}{space 2} .0041115{col 27}{space 2} .0064992{col 38}{space 1}    0.63{col 47}{space 3}0.561{col 55}{space 4}-.0139333{col 68}{space 3} .0221562
{txt}{space 8}lag74 {c |}{col 15}{res}{space 2} .0007713{col 27}{space 2} .0047266{col 38}{space 1}    0.16{col 47}{space 3}0.878{col 55}{space 4}-.0123518{col 68}{space 3} .0138943
{txt}{space 8}lag75 {c |}{col 15}{res}{space 2}-.0001236{col 27}{space 2} .0061568{col 38}{space 1}   -0.02{col 47}{space 3}0.985{col 55}{space 4}-.0172176{col 68}{space 3} .0169705
{txt}{space 8}lag76 {c |}{col 15}{res}{space 2}-.0001029{col 27}{space 2} .0069426{col 38}{space 1}   -0.01{col 47}{space 3}0.989{col 55}{space 4}-.0193787{col 68}{space 3} .0191729
{txt}{space 8}lag77 {c |}{col 15}{res}{space 2}  -.00019{col 27}{space 2} .0062008{col 38}{space 1}   -0.03{col 47}{space 3}0.977{col 55}{space 4}-.0174063{col 68}{space 3} .0170263
{txt}{space 8}lag78 {c |}{col 15}{res}{space 2}  .002053{col 27}{space 2} .0068197{col 38}{space 1}    0.30{col 47}{space 3}0.778{col 55}{space 4}-.0168816{col 68}{space 3} .0209877
{txt}{space 8}lag79 {c |}{col 15}{res}{space 2} .0048696{col 27}{space 2} .0049956{col 38}{space 1}    0.97{col 47}{space 3}0.385{col 55}{space 4}-.0090003{col 68}{space 3} .0187395
{txt}{space 8}lag80 {c |}{col 15}{res}{space 2} .0056182{col 27}{space 2} .0028563{col 38}{space 1}    1.97{col 47}{space 3}0.121{col 55}{space 4}-.0023121{col 68}{space 3} .0135486
{txt}{space 8}lag81 {c |}{col 15}{res}{space 2} .0043345{col 27}{space 2} .0032504{col 38}{space 1}    1.33{col 47}{space 3}0.253{col 55}{space 4}-.0046901{col 68}{space 3} .0133591
{txt}{space 8}lag82 {c |}{col 15}{res}{space 2}-.0010933{col 27}{space 2} .0022195{col 38}{space 1}   -0.49{col 47}{space 3}0.648{col 55}{space 4}-.0072556{col 68}{space 3} .0050689
{txt}{space 8}lag83 {c |}{col 15}{res}{space 2}-.0060107{col 27}{space 2} .0042598{col 38}{space 1}   -1.41{col 47}{space 3}0.231{col 55}{space 4}-.0178378{col 68}{space 3} .0058164
{txt}{space 8}lag84 {c |}{col 15}{res}{space 2}-.0083701{col 27}{space 2} .0036091{col 38}{space 1}   -2.32{col 47}{space 3}0.081{col 55}{space 4}-.0183905{col 68}{space 3} .0016503
{txt}{space 8}lag85 {c |}{col 15}{res}{space 2}-.0036931{col 27}{space 2} .0048982{col 38}{space 1}   -0.75{col 47}{space 3}0.493{col 55}{space 4}-.0172927{col 68}{space 3} .0099066
{txt}{space 8}lag86 {c |}{col 15}{res}{space 2} .0008474{col 27}{space 2} .0055408{col 38}{space 1}    0.15{col 47}{space 3}0.886{col 55}{space 4}-.0145362{col 68}{space 3}  .016231
{txt}{space 8}lag87 {c |}{col 15}{res}{space 2} .0022013{col 27}{space 2} .0043802{col 38}{space 1}    0.50{col 47}{space 3}0.642{col 55}{space 4}  -.00996{col 68}{space 3} .0143627
{txt}{space 8}lag88 {c |}{col 15}{res}{space 2}  .011108{col 27}{space 2} .0041677{col 38}{space 1}    2.67{col 47}{space 3}0.056{col 55}{space 4}-.0004635{col 68}{space 3} .0226794
{txt}{space 8}lag89 {c |}{col 15}{res}{space 2} .0067809{col 27}{space 2} .0065513{col 38}{space 1}    1.04{col 47}{space 3}0.359{col 55}{space 4}-.0114085{col 68}{space 3} .0249702
{txt}{space 8}lag90 {c |}{col 15}{res}{space 2} .0067299{col 27}{space 2}  .004561{col 38}{space 1}    1.48{col 47}{space 3}0.214{col 55}{space 4}-.0059335{col 68}{space 3} .0193932
{txt}{space 8}lag91 {c |}{col 15}{res}{space 2} .0095412{col 27}{space 2}  .004672{col 38}{space 1}    2.04{col 47}{space 3}0.111{col 55}{space 4}-.0034304{col 68}{space 3} .0225128
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} .4922477{col 27}{space 2} .0463163{col 38}{space 1}   10.63{col 47}{space 3}0.000{col 55}{space 4}  .363653{col 68}{space 3} .6208424
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}   regionid1{col 14}{c |}{space 1}        5{col 27}{space 1}        5{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}        date{col 14}{c |}{space 1}     5267{col 27}{space 1}        1{col 39}{result}{space 1}     5266{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. graph export "results/EventStudy-Co2.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/simonpostler/Desktop/applied-econometrics-dst-master-2/results/EventStudy-Co2.png{rm}
saved as
PNG
format
{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/6h/778gphg5533gk87_wkb11wqh0000gn/T//SD01922.000000"
{txt}
{com}. eventdd energy_kwh_per_capita public_holiday c.temperature##c.temperature solar_exposure wind_3  [aweight = population], timevar(timevar) method(hdfe, absorb(regionid1 date) cluster(regionid1)) graph_op(ytitle("Kwh energy p.c.") xtitle("Days until DST transition") title("Event Study - Electricity Consumption"))
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}{txt}warning: missing F statistic; dropped variables due to collinearity or too few clusters
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,264,072
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F( 190,      4)}{col 67}=          {res}.
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.7469
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7458
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0582
{txt}{col 1}Number of clusters ({res}regionid1{txt}) {col 30}= {res}         5{txt}{col 51}Root MSE{col 67}= {res}    0.0778

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}energy_kwh_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
public_holi~y {c |}{col 15}{res}{space 2}-.0219825{col 27}{space 2} .0029596{col 38}{space 1}   -7.43{col 47}{space 3}0.002{col 55}{space 4}-.0301996{col 68}{space 3}-.0137654
{txt}{space 2}temperature {c |}{col 15}{res}{space 2}-.0166145{col 27}{space 2} .0064803{col 38}{space 1}   -2.56{col 47}{space 3}0.062{col 55}{space 4}-.0346066{col 68}{space 3} .0013776
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2} .0003735{col 27}{space 2} .0001291{col 38}{space 1}    2.89{col 47}{space 3}0.044{col 55}{space 4}  .000015{col 68}{space 3} .0007319
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2}-.0009928{col 27}{space 2}  .000503{col 38}{space 1}   -1.97{col 47}{space 3}0.120{col 55}{space 4}-.0023893{col 68}{space 3} .0004036
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2} .0032744{col 27}{space 2}  .002993{col 38}{space 1}    1.09{col 47}{space 3}0.335{col 55}{space 4}-.0050355{col 68}{space 3} .0115843
{txt}{space 7}lead94 {c |}{col 15}{res}{space 2} .0663487{col 27}{space 2} .0177856{col 38}{space 1}    3.73{col 47}{space 3}0.020{col 55}{space 4} .0169679{col 68}{space 3} .1157296
{txt}{space 7}lead93 {c |}{col 15}{res}{space 2} .0561053{col 27}{space 2} .0166184{col 38}{space 1}    3.38{col 47}{space 3}0.028{col 55}{space 4} .0099652{col 68}{space 3} .1022454
{txt}{space 7}lead92 {c |}{col 15}{res}{space 2} .0442249{col 27}{space 2} .0130577{col 38}{space 1}    3.39{col 47}{space 3}0.028{col 55}{space 4}  .007971{col 68}{space 3} .0804787
{txt}{space 7}lead91 {c |}{col 15}{res}{space 2} .0320048{col 27}{space 2} .0141906{col 38}{space 1}    2.26{col 47}{space 3}0.087{col 55}{space 4}-.0073947{col 68}{space 3} .0714043
{txt}{space 7}lead90 {c |}{col 15}{res}{space 2} .0344443{col 27}{space 2} .0141389{col 38}{space 1}    2.44{col 47}{space 3}0.072{col 55}{space 4}-.0048116{col 68}{space 3} .0737003
{txt}{space 7}lead89 {c |}{col 15}{res}{space 2} .0423295{col 27}{space 2} .0137927{col 38}{space 1}    3.07{col 47}{space 3}0.037{col 55}{space 4} .0040349{col 68}{space 3} .0806242
{txt}{space 7}lead88 {c |}{col 15}{res}{space 2} .0442689{col 27}{space 2} .0130504{col 38}{space 1}    3.39{col 47}{space 3}0.027{col 55}{space 4} .0080352{col 68}{space 3} .0805027
{txt}{space 7}lead87 {c |}{col 15}{res}{space 2} .0492219{col 27}{space 2}   .01159{col 38}{space 1}    4.25{col 47}{space 3}0.013{col 55}{space 4} .0170429{col 68}{space 3}  .081401
{txt}{space 7}lead86 {c |}{col 15}{res}{space 2} .0508744{col 27}{space 2} .0130338{col 38}{space 1}    3.90{col 47}{space 3}0.017{col 55}{space 4} .0146868{col 68}{space 3} .0870619
{txt}{space 7}lead85 {c |}{col 15}{res}{space 2} .0454438{col 27}{space 2} .0139924{col 38}{space 1}    3.25{col 47}{space 3}0.031{col 55}{space 4} .0065948{col 68}{space 3} .0842928
{txt}{space 7}lead84 {c |}{col 15}{res}{space 2} .0378006{col 27}{space 2} .0152513{col 38}{space 1}    2.48{col 47}{space 3}0.068{col 55}{space 4}-.0045439{col 68}{space 3} .0801451
{txt}{space 7}lead83 {c |}{col 15}{res}{space 2} .0398532{col 27}{space 2} .0138634{col 38}{space 1}    2.87{col 47}{space 3}0.045{col 55}{space 4} .0013623{col 68}{space 3} .0783441
{txt}{space 7}lead82 {c |}{col 15}{res}{space 2} .0416137{col 27}{space 2} .0142901{col 38}{space 1}    2.91{col 47}{space 3}0.044{col 55}{space 4}  .001938{col 68}{space 3} .0812893
{txt}{space 7}lead81 {c |}{col 15}{res}{space 2}  .040876{col 27}{space 2} .0133165{col 38}{space 1}    3.07{col 47}{space 3}0.037{col 55}{space 4} .0039035{col 68}{space 3} .0778484
{txt}{space 7}lead80 {c |}{col 15}{res}{space 2} .0420116{col 27}{space 2} .0120388{col 38}{space 1}    3.49{col 47}{space 3}0.025{col 55}{space 4} .0085865{col 68}{space 3} .0754367
{txt}{space 7}lead79 {c |}{col 15}{res}{space 2} .0436566{col 27}{space 2} .0134243{col 38}{space 1}    3.25{col 47}{space 3}0.031{col 55}{space 4} .0063847{col 68}{space 3} .0809286
{txt}{space 7}lead78 {c |}{col 15}{res}{space 2} .0432167{col 27}{space 2}  .014258{col 38}{space 1}    3.03{col 47}{space 3}0.039{col 55}{space 4} .0036302{col 68}{space 3} .0828032
{txt}{space 7}lead77 {c |}{col 15}{res}{space 2} .0339747{col 27}{space 2} .0144698{col 38}{space 1}    2.35{col 47}{space 3}0.079{col 55}{space 4}-.0061998{col 68}{space 3} .0741492
{txt}{space 7}lead76 {c |}{col 15}{res}{space 2} .0439969{col 27}{space 2} .0125215{col 38}{space 1}    3.51{col 47}{space 3}0.025{col 55}{space 4} .0092316{col 68}{space 3} .0787622
{txt}{space 7}lead75 {c |}{col 15}{res}{space 2} .0517404{col 27}{space 2}  .011076{col 38}{space 1}    4.67{col 47}{space 3}0.010{col 55}{space 4} .0209884{col 68}{space 3} .0824925
{txt}{space 7}lead74 {c |}{col 15}{res}{space 2} .0514533{col 27}{space 2} .0104952{col 38}{space 1}    4.90{col 47}{space 3}0.008{col 55}{space 4} .0223139{col 68}{space 3} .0805928
{txt}{space 7}lead73 {c |}{col 15}{res}{space 2} .0487152{col 27}{space 2} .0096624{col 38}{space 1}    5.04{col 47}{space 3}0.007{col 55}{space 4} .0218881{col 68}{space 3} .0755422
{txt}{space 7}lead72 {c |}{col 15}{res}{space 2} .0481117{col 27}{space 2} .0112168{col 38}{space 1}    4.29{col 47}{space 3}0.013{col 55}{space 4} .0169688{col 68}{space 3} .0792546
{txt}{space 7}lead71 {c |}{col 15}{res}{space 2} .0399651{col 27}{space 2} .0134286{col 38}{space 1}    2.98{col 47}{space 3}0.041{col 55}{space 4} .0026813{col 68}{space 3} .0772488
{txt}{space 7}lead70 {c |}{col 15}{res}{space 2} .0333488{col 27}{space 2}  .012187{col 38}{space 1}    2.74{col 47}{space 3}0.052{col 55}{space 4}-.0004877{col 68}{space 3} .0671853
{txt}{space 7}lead69 {c |}{col 15}{res}{space 2} .0457263{col 27}{space 2}  .009435{col 38}{space 1}    4.85{col 47}{space 3}0.008{col 55}{space 4} .0195305{col 68}{space 3} .0719222
{txt}{space 7}lead68 {c |}{col 15}{res}{space 2} .0519591{col 27}{space 2} .0096817{col 38}{space 1}    5.37{col 47}{space 3}0.006{col 55}{space 4} .0250785{col 68}{space 3} .0788397
{txt}{space 7}lead67 {c |}{col 15}{res}{space 2} .0479192{col 27}{space 2} .0071523{col 38}{space 1}    6.70{col 47}{space 3}0.003{col 55}{space 4} .0280613{col 68}{space 3} .0677771
{txt}{space 7}lead66 {c |}{col 15}{res}{space 2} .0487696{col 27}{space 2}  .009079{col 38}{space 1}    5.37{col 47}{space 3}0.006{col 55}{space 4} .0235624{col 68}{space 3} .0739768
{txt}{space 7}lead65 {c |}{col 15}{res}{space 2} .0492254{col 27}{space 2}  .009853{col 38}{space 1}    5.00{col 47}{space 3}0.008{col 55}{space 4} .0218692{col 68}{space 3} .0765816
{txt}{space 7}lead64 {c |}{col 15}{res}{space 2} .0416033{col 27}{space 2} .0109704{col 38}{space 1}    3.79{col 47}{space 3}0.019{col 55}{space 4} .0111447{col 68}{space 3} .0720619
{txt}{space 7}lead63 {c |}{col 15}{res}{space 2} .0359634{col 27}{space 2} .0118713{col 38}{space 1}    3.03{col 47}{space 3}0.039{col 55}{space 4} .0030033{col 68}{space 3} .0689235
{txt}{space 7}lead62 {c |}{col 15}{res}{space 2} .0463594{col 27}{space 2} .0133144{col 38}{space 1}    3.48{col 47}{space 3}0.025{col 55}{space 4} .0093925{col 68}{space 3} .0833262
{txt}{space 7}lead61 {c |}{col 15}{res}{space 2} .0500888{col 27}{space 2} .0104121{col 38}{space 1}    4.81{col 47}{space 3}0.009{col 55}{space 4} .0211803{col 68}{space 3} .0789974
{txt}{space 7}lead60 {c |}{col 15}{res}{space 2} .0457075{col 27}{space 2} .0102004{col 38}{space 1}    4.48{col 47}{space 3}0.011{col 55}{space 4} .0173868{col 68}{space 3} .0740282
{txt}{space 7}lead59 {c |}{col 15}{res}{space 2} .0469973{col 27}{space 2} .0093543{col 38}{space 1}    5.02{col 47}{space 3}0.007{col 55}{space 4} .0210255{col 68}{space 3} .0729691
{txt}{space 7}lead58 {c |}{col 15}{res}{space 2} .0452994{col 27}{space 2}    .0076{col 38}{space 1}    5.96{col 47}{space 3}0.004{col 55}{space 4} .0241984{col 68}{space 3} .0664003
{txt}{space 7}lead57 {c |}{col 15}{res}{space 2} .0407081{col 27}{space 2}  .008649{col 38}{space 1}    4.71{col 47}{space 3}0.009{col 55}{space 4} .0166946{col 68}{space 3} .0647216
{txt}{space 7}lead56 {c |}{col 15}{res}{space 2}   .03458{col 27}{space 2} .0112528{col 38}{space 1}    3.07{col 47}{space 3}0.037{col 55}{space 4} .0033372{col 68}{space 3} .0658229
{txt}{space 7}lead55 {c |}{col 15}{res}{space 2} .0404054{col 27}{space 2} .0098588{col 38}{space 1}    4.10{col 47}{space 3}0.015{col 55}{space 4} .0130328{col 68}{space 3} .0677779
{txt}{space 7}lead54 {c |}{col 15}{res}{space 2} .0458679{col 27}{space 2}   .00722{col 38}{space 1}    6.35{col 47}{space 3}0.003{col 55}{space 4}  .025822{col 68}{space 3} .0659139
{txt}{space 7}lead53 {c |}{col 15}{res}{space 2} .0481434{col 27}{space 2} .0069769{col 38}{space 1}    6.90{col 47}{space 3}0.002{col 55}{space 4} .0287725{col 68}{space 3} .0675143
{txt}{space 7}lead52 {c |}{col 15}{res}{space 2} .0463985{col 27}{space 2} .0065798{col 38}{space 1}    7.05{col 47}{space 3}0.002{col 55}{space 4} .0281301{col 68}{space 3} .0646669
{txt}{space 7}lead51 {c |}{col 15}{res}{space 2} .0473799{col 27}{space 2} .0065819{col 38}{space 1}    7.20{col 47}{space 3}0.002{col 55}{space 4} .0291057{col 68}{space 3} .0656541
{txt}{space 7}lead50 {c |}{col 15}{res}{space 2} .0374316{col 27}{space 2} .0072801{col 38}{space 1}    5.14{col 47}{space 3}0.007{col 55}{space 4} .0172187{col 68}{space 3} .0576444
{txt}{space 7}lead49 {c |}{col 15}{res}{space 2} .0374842{col 27}{space 2} .0074541{col 38}{space 1}    5.03{col 47}{space 3}0.007{col 55}{space 4} .0167884{col 68}{space 3} .0581799
{txt}{space 7}lead48 {c |}{col 15}{res}{space 2} .0430842{col 27}{space 2} .0072626{col 38}{space 1}    5.93{col 47}{space 3}0.004{col 55}{space 4} .0229201{col 68}{space 3} .0632484
{txt}{space 7}lead47 {c |}{col 15}{res}{space 2} .0446613{col 27}{space 2} .0056969{col 38}{space 1}    7.84{col 47}{space 3}0.001{col 55}{space 4} .0288441{col 68}{space 3} .0604784
{txt}{space 7}lead46 {c |}{col 15}{res}{space 2} .0449958{col 27}{space 2} .0068102{col 38}{space 1}    6.61{col 47}{space 3}0.003{col 55}{space 4} .0260876{col 68}{space 3} .0639039
{txt}{space 7}lead45 {c |}{col 15}{res}{space 2} .0449695{col 27}{space 2} .0068484{col 38}{space 1}    6.57{col 47}{space 3}0.003{col 55}{space 4} .0259554{col 68}{space 3} .0639836
{txt}{space 7}lead44 {c |}{col 15}{res}{space 2} .0413513{col 27}{space 2} .0059127{col 38}{space 1}    6.99{col 47}{space 3}0.002{col 55}{space 4} .0249349{col 68}{space 3} .0577676
{txt}{space 7}lead43 {c |}{col 15}{res}{space 2}  .034448{col 27}{space 2}  .006158{col 38}{space 1}    5.59{col 47}{space 3}0.005{col 55}{space 4} .0173507{col 68}{space 3} .0515453
{txt}{space 7}lead42 {c |}{col 15}{res}{space 2} .0205274{col 27}{space 2} .0071249{col 38}{space 1}    2.88{col 47}{space 3}0.045{col 55}{space 4} .0007456{col 68}{space 3} .0403092
{txt}{space 7}lead41 {c |}{col 15}{res}{space 2} .0324235{col 27}{space 2} .0061985{col 38}{space 1}    5.23{col 47}{space 3}0.006{col 55}{space 4} .0152137{col 68}{space 3} .0496332
{txt}{space 7}lead40 {c |}{col 15}{res}{space 2} .0335647{col 27}{space 2} .0036748{col 38}{space 1}    9.13{col 47}{space 3}0.001{col 55}{space 4} .0233619{col 68}{space 3} .0437676
{txt}{space 7}lead39 {c |}{col 15}{res}{space 2} .0375381{col 27}{space 2} .0039057{col 38}{space 1}    9.61{col 47}{space 3}0.001{col 55}{space 4}  .026694{col 68}{space 3} .0483821
{txt}{space 7}lead38 {c |}{col 15}{res}{space 2} .0322789{col 27}{space 2} .0055853{col 38}{space 1}    5.78{col 47}{space 3}0.004{col 55}{space 4} .0167716{col 68}{space 3} .0477862
{txt}{space 7}lead37 {c |}{col 15}{res}{space 2} .0340609{col 27}{space 2} .0052377{col 38}{space 1}    6.50{col 47}{space 3}0.003{col 55}{space 4} .0195187{col 68}{space 3}  .048603
{txt}{space 7}lead36 {c |}{col 15}{res}{space 2} .0333805{col 27}{space 2} .0063236{col 38}{space 1}    5.28{col 47}{space 3}0.006{col 55}{space 4} .0158234{col 68}{space 3} .0509376
{txt}{space 7}lead35 {c |}{col 15}{res}{space 2} .0310803{col 27}{space 2} .0075747{col 38}{space 1}    4.10{col 47}{space 3}0.015{col 55}{space 4} .0100497{col 68}{space 3}  .052111
{txt}{space 7}lead34 {c |}{col 15}{res}{space 2}  .039273{col 27}{space 2} .0057293{col 38}{space 1}    6.85{col 47}{space 3}0.002{col 55}{space 4} .0233659{col 68}{space 3} .0551801
{txt}{space 7}lead33 {c |}{col 15}{res}{space 2}  .040541{col 27}{space 2} .0041445{col 38}{space 1}    9.78{col 47}{space 3}0.001{col 55}{space 4}  .029034{col 68}{space 3}  .052048
{txt}{space 7}lead32 {c |}{col 15}{res}{space 2} .0403753{col 27}{space 2} .0037207{col 38}{space 1}   10.85{col 47}{space 3}0.000{col 55}{space 4}  .030045{col 68}{space 3} .0507057
{txt}{space 7}lead31 {c |}{col 15}{res}{space 2} .0375794{col 27}{space 2} .0031235{col 38}{space 1}   12.03{col 47}{space 3}0.000{col 55}{space 4}  .028907{col 68}{space 3} .0462517
{txt}{space 7}lead30 {c |}{col 15}{res}{space 2}  .037191{col 27}{space 2} .0038132{col 38}{space 1}    9.75{col 47}{space 3}0.001{col 55}{space 4} .0266038{col 68}{space 3} .0477781
{txt}{space 7}lead29 {c |}{col 15}{res}{space 2} .0357409{col 27}{space 2} .0027482{col 38}{space 1}   13.01{col 47}{space 3}0.000{col 55}{space 4} .0281107{col 68}{space 3} .0433711
{txt}{space 7}lead28 {c |}{col 15}{res}{space 2} .0281107{col 27}{space 2} .0045423{col 38}{space 1}    6.19{col 47}{space 3}0.003{col 55}{space 4} .0154993{col 68}{space 3} .0407221
{txt}{space 7}lead27 {c |}{col 15}{res}{space 2} .0305149{col 27}{space 2} .0055406{col 38}{space 1}    5.51{col 47}{space 3}0.005{col 55}{space 4} .0151317{col 68}{space 3}  .045898
{txt}{space 7}lead26 {c |}{col 15}{res}{space 2} .0295899{col 27}{space 2} .0020952{col 38}{space 1}   14.12{col 47}{space 3}0.000{col 55}{space 4} .0237728{col 68}{space 3}  .035407
{txt}{space 7}lead25 {c |}{col 15}{res}{space 2} .0318913{col 27}{space 2} .0032966{col 38}{space 1}    9.67{col 47}{space 3}0.001{col 55}{space 4} .0227384{col 68}{space 3} .0410442
{txt}{space 7}lead24 {c |}{col 15}{res}{space 2} .0260874{col 27}{space 2} .0022789{col 38}{space 1}   11.45{col 47}{space 3}0.000{col 55}{space 4} .0197603{col 68}{space 3} .0324145
{txt}{space 7}lead23 {c |}{col 15}{res}{space 2}  .024356{col 27}{space 2}  .001908{col 38}{space 1}   12.77{col 47}{space 3}0.000{col 55}{space 4} .0190587{col 68}{space 3} .0296534
{txt}{space 7}lead22 {c |}{col 15}{res}{space 2} .0181099{col 27}{space 2}  .002505{col 38}{space 1}    7.23{col 47}{space 3}0.002{col 55}{space 4}  .011155{col 68}{space 3} .0250647
{txt}{space 7}lead21 {c |}{col 15}{res}{space 2} .0130377{col 27}{space 2} .0014385{col 38}{space 1}    9.06{col 47}{space 3}0.001{col 55}{space 4} .0090438{col 68}{space 3} .0170316
{txt}{space 7}lead20 {c |}{col 15}{res}{space 2} .0187241{col 27}{space 2} .0025413{col 38}{space 1}    7.37{col 47}{space 3}0.002{col 55}{space 4} .0116682{col 68}{space 3} .0257799
{txt}{space 7}lead19 {c |}{col 15}{res}{space 2} .0262775{col 27}{space 2} .0020205{col 38}{space 1}   13.01{col 47}{space 3}0.000{col 55}{space 4} .0206676{col 68}{space 3} .0318873
{txt}{space 7}lead18 {c |}{col 15}{res}{space 2} .0264228{col 27}{space 2} .0029823{col 38}{space 1}    8.86{col 47}{space 3}0.001{col 55}{space 4} .0181426{col 68}{space 3} .0347029
{txt}{space 7}lead17 {c |}{col 15}{res}{space 2} .0235683{col 27}{space 2} .0041618{col 38}{space 1}    5.66{col 47}{space 3}0.005{col 55}{space 4} .0120133{col 68}{space 3} .0351233
{txt}{space 7}lead16 {c |}{col 15}{res}{space 2} .0201743{col 27}{space 2} .0042411{col 38}{space 1}    4.76{col 47}{space 3}0.009{col 55}{space 4}  .008399{col 68}{space 3} .0319495
{txt}{space 7}lead15 {c |}{col 15}{res}{space 2} .0133391{col 27}{space 2} .0030197{col 38}{space 1}    4.42{col 47}{space 3}0.012{col 55}{space 4}  .004955{col 68}{space 3} .0217232
{txt}{space 7}lead14 {c |}{col 15}{res}{space 2} .0129794{col 27}{space 2} .0028642{col 38}{space 1}    4.53{col 47}{space 3}0.011{col 55}{space 4} .0050271{col 68}{space 3} .0209318
{txt}{space 7}lead13 {c |}{col 15}{res}{space 2} .0129182{col 27}{space 2} .0020726{col 38}{space 1}    6.23{col 47}{space 3}0.003{col 55}{space 4} .0071637{col 68}{space 3} .0186727
{txt}{space 7}lead12 {c |}{col 15}{res}{space 2} .0145831{col 27}{space 2}  .002137{col 38}{space 1}    6.82{col 47}{space 3}0.002{col 55}{space 4} .0086499{col 68}{space 3} .0205164
{txt}{space 7}lead11 {c |}{col 15}{res}{space 2} .0111009{col 27}{space 2} .0046371{col 38}{space 1}    2.39{col 47}{space 3}0.075{col 55}{space 4}-.0017738{col 68}{space 3} .0239755
{txt}{space 7}lead10 {c |}{col 15}{res}{space 2} .0073146{col 27}{space 2} .0030024{col 38}{space 1}    2.44{col 47}{space 3}0.071{col 55}{space 4}-.0010213{col 68}{space 3} .0156506
{txt}{space 8}lead9 {c |}{col 15}{res}{space 2} .0107729{col 27}{space 2} .0033272{col 38}{space 1}    3.24{col 47}{space 3}0.032{col 55}{space 4} .0015351{col 68}{space 3} .0200107
{txt}{space 8}lead8 {c |}{col 15}{res}{space 2} .0112593{col 27}{space 2} .0012923{col 38}{space 1}    8.71{col 47}{space 3}0.001{col 55}{space 4} .0076714{col 68}{space 3} .0148473
{txt}{space 8}lead7 {c |}{col 15}{res}{space 2} .0010925{col 27}{space 2} .0015579{col 38}{space 1}    0.70{col 47}{space 3}0.522{col 55}{space 4}-.0032328{col 68}{space 3} .0054178
{txt}{space 8}lead6 {c |}{col 15}{res}{space 2}  .002312{col 27}{space 2} .0026185{col 38}{space 1}    0.88{col 47}{space 3}0.427{col 55}{space 4}-.0049582{col 68}{space 3} .0095821
{txt}{space 8}lead5 {c |}{col 15}{res}{space 2} .0042562{col 27}{space 2}  .002956{col 38}{space 1}    1.44{col 47}{space 3}0.223{col 55}{space 4}-.0039508{col 68}{space 3} .0124633
{txt}{space 8}lead4 {c |}{col 15}{res}{space 2}  .010975{col 27}{space 2} .0027131{col 38}{space 1}    4.05{col 47}{space 3}0.016{col 55}{space 4} .0034422{col 68}{space 3} .0185078
{txt}{space 8}lead3 {c |}{col 15}{res}{space 2}    .0048{col 27}{space 2}  .003018{col 38}{space 1}    1.59{col 47}{space 3}0.187{col 55}{space 4}-.0035794{col 68}{space 3} .0131794
{txt}{space 8}lead2 {c |}{col 15}{res}{space 2}  .004953{col 27}{space 2} .0020679{col 38}{space 1}    2.40{col 47}{space 3}0.075{col 55}{space 4}-.0007885{col 68}{space 3} .0106945
{txt}{space 9}lag0 {c |}{col 15}{res}{space 2}-.0021629{col 27}{space 2} .0029923{col 38}{space 1}   -0.72{col 47}{space 3}0.510{col 55}{space 4}-.0104708{col 68}{space 3} .0061451
{txt}{space 9}lag1 {c |}{col 15}{res}{space 2}-.0009058{col 27}{space 2} .0043708{col 38}{space 1}   -0.21{col 47}{space 3}0.846{col 55}{space 4}-.0130413{col 68}{space 3} .0112296
{txt}{space 9}lag2 {c |}{col 15}{res}{space 2} .0035535{col 27}{space 2}  .002025{col 38}{space 1}    1.75{col 47}{space 3}0.154{col 55}{space 4}-.0020688{col 68}{space 3} .0091758
{txt}{space 9}lag3 {c |}{col 15}{res}{space 2} .0075214{col 27}{space 2}  .001046{col 38}{space 1}    7.19{col 47}{space 3}0.002{col 55}{space 4} .0046172{col 68}{space 3} .0104256
{txt}{space 9}lag4 {c |}{col 15}{res}{space 2}-.0010772{col 27}{space 2} .0008911{col 38}{space 1}   -1.21{col 47}{space 3}0.293{col 55}{space 4}-.0035513{col 68}{space 3} .0013969
{txt}{space 9}lag5 {c |}{col 15}{res}{space 2}-.0005784{col 27}{space 2} .0015631{col 38}{space 1}   -0.37{col 47}{space 3}0.730{col 55}{space 4}-.0049183{col 68}{space 3} .0037616
{txt}{space 9}lag6 {c |}{col 15}{res}{space 2}-.0035929{col 27}{space 2} .0017746{col 38}{space 1}   -2.02{col 47}{space 3}0.113{col 55}{space 4}  -.00852{col 68}{space 3} .0013343
{txt}{space 9}lag7 {c |}{col 15}{res}{space 2}-.0026556{col 27}{space 2} .0031845{col 38}{space 1}   -0.83{col 47}{space 3}0.451{col 55}{space 4}-.0114972{col 68}{space 3} .0061861
{txt}{space 9}lag8 {c |}{col 15}{res}{space 2} .0002029{col 27}{space 2} .0034319{col 38}{space 1}    0.06{col 47}{space 3}0.956{col 55}{space 4}-.0093256{col 68}{space 3} .0097315
{txt}{space 9}lag9 {c |}{col 15}{res}{space 2} .0057665{col 27}{space 2} .0013971{col 38}{space 1}    4.13{col 47}{space 3}0.015{col 55}{space 4} .0018874{col 68}{space 3} .0096456
{txt}{space 8}lag10 {c |}{col 15}{res}{space 2} .0009541{col 27}{space 2} .0018044{col 38}{space 1}    0.53{col 47}{space 3}0.625{col 55}{space 4}-.0040558{col 68}{space 3} .0059639
{txt}{space 8}lag11 {c |}{col 15}{res}{space 2} .0019607{col 27}{space 2} .0015344{col 38}{space 1}    1.28{col 47}{space 3}0.270{col 55}{space 4}-.0022993{col 68}{space 3} .0062208
{txt}{space 8}lag12 {c |}{col 15}{res}{space 2} .0092618{col 27}{space 2}  .002266{col 38}{space 1}    4.09{col 47}{space 3}0.015{col 55}{space 4} .0029705{col 68}{space 3} .0155531
{txt}{space 8}lag13 {c |}{col 15}{res}{space 2} .0028502{col 27}{space 2} .0050511{col 38}{space 1}    0.56{col 47}{space 3}0.603{col 55}{space 4}-.0111739{col 68}{space 3} .0168742
{txt}{space 8}lag14 {c |}{col 15}{res}{space 2}-.0058446{col 27}{space 2} .0031371{col 38}{space 1}   -1.86{col 47}{space 3}0.136{col 55}{space 4}-.0145545{col 68}{space 3} .0028653
{txt}{space 8}lag15 {c |}{col 15}{res}{space 2} .0030561{col 27}{space 2} .0047629{col 38}{space 1}    0.64{col 47}{space 3}0.556{col 55}{space 4}-.0101678{col 68}{space 3}   .01628
{txt}{space 8}lag16 {c |}{col 15}{res}{space 2} .0053994{col 27}{space 2} .0037136{col 38}{space 1}    1.45{col 47}{space 3}0.220{col 55}{space 4}-.0049113{col 68}{space 3}   .01571
{txt}{space 8}lag17 {c |}{col 15}{res}{space 2}-.0034828{col 27}{space 2} .0027867{col 38}{space 1}   -1.25{col 47}{space 3}0.280{col 55}{space 4}  -.01122{col 68}{space 3} .0042544
{txt}{space 8}lag18 {c |}{col 15}{res}{space 2}-.0036389{col 27}{space 2} .0035141{col 38}{space 1}   -1.04{col 47}{space 3}0.359{col 55}{space 4}-.0133955{col 68}{space 3} .0061177
{txt}{space 8}lag19 {c |}{col 15}{res}{space 2}-.0046787{col 27}{space 2} .0027561{col 38}{space 1}   -1.70{col 47}{space 3}0.165{col 55}{space 4}-.0123308{col 68}{space 3} .0029735
{txt}{space 8}lag20 {c |}{col 15}{res}{space 2}-.0152517{col 27}{space 2} .0042488{col 38}{space 1}   -3.59{col 47}{space 3}0.023{col 55}{space 4}-.0270483{col 68}{space 3}-.0034552
{txt}{space 8}lag21 {c |}{col 15}{res}{space 2}-.0145845{col 27}{space 2} .0047782{col 38}{space 1}   -3.05{col 47}{space 3}0.038{col 55}{space 4}-.0278508{col 68}{space 3}-.0013181
{txt}{space 8}lag22 {c |}{col 15}{res}{space 2}-.0067265{col 27}{space 2}  .002819{col 38}{space 1}   -2.39{col 47}{space 3}0.075{col 55}{space 4}-.0145535{col 68}{space 3} .0011004
{txt}{space 8}lag23 {c |}{col 15}{res}{space 2}-.0063677{col 27}{space 2} .0021382{col 38}{space 1}   -2.98{col 47}{space 3}0.041{col 55}{space 4}-.0123043{col 68}{space 3} -.000431
{txt}{space 8}lag24 {c |}{col 15}{res}{space 2} -.009029{col 27}{space 2} .0030612{col 38}{space 1}   -2.95{col 47}{space 3}0.042{col 55}{space 4}-.0175283{col 68}{space 3}-.0005297
{txt}{space 8}lag25 {c |}{col 15}{res}{space 2} -.006645{col 27}{space 2} .0035124{col 38}{space 1}   -1.89{col 47}{space 3}0.131{col 55}{space 4}-.0163972{col 68}{space 3} .0031071
{txt}{space 8}lag26 {c |}{col 15}{res}{space 2}-.0020701{col 27}{space 2} .0057809{col 38}{space 1}   -0.36{col 47}{space 3}0.738{col 55}{space 4}-.0181204{col 68}{space 3} .0139802
{txt}{space 8}lag27 {c |}{col 15}{res}{space 2}-.0079834{col 27}{space 2} .0065416{col 38}{space 1}   -1.22{col 47}{space 3}0.289{col 55}{space 4}-.0261456{col 68}{space 3} .0101789
{txt}{space 8}lag28 {c |}{col 15}{res}{space 2}-.0054707{col 27}{space 2} .0065939{col 38}{space 1}   -0.83{col 47}{space 3}0.453{col 55}{space 4}-.0237784{col 68}{space 3} .0128369
{txt}{space 8}lag29 {c |}{col 15}{res}{space 2}-.0085333{col 27}{space 2} .0070225{col 38}{space 1}   -1.22{col 47}{space 3}0.291{col 55}{space 4} -.028031{col 68}{space 3} .0109645
{txt}{space 8}lag30 {c |}{col 15}{res}{space 2}-.0094661{col 27}{space 2} .0079603{col 38}{space 1}   -1.19{col 47}{space 3}0.300{col 55}{space 4}-.0315675{col 68}{space 3} .0126353
{txt}{space 8}lag31 {c |}{col 15}{res}{space 2}-.0016151{col 27}{space 2} .0034988{col 38}{space 1}   -0.46{col 47}{space 3}0.668{col 55}{space 4}-.0113295{col 68}{space 3} .0080992
{txt}{space 8}lag32 {c |}{col 15}{res}{space 2}-.0061865{col 27}{space 2} .0036884{col 38}{space 1}   -1.68{col 47}{space 3}0.169{col 55}{space 4} -.016427{col 68}{space 3} .0040541
{txt}{space 8}lag33 {c |}{col 15}{res}{space 2}-.0037428{col 27}{space 2} .0040728{col 38}{space 1}   -0.92{col 47}{space 3}0.410{col 55}{space 4}-.0150507{col 68}{space 3} .0075652
{txt}{space 8}lag34 {c |}{col 15}{res}{space 2}-.0068311{col 27}{space 2}  .004922{col 38}{space 1}   -1.39{col 47}{space 3}0.237{col 55}{space 4}-.0204967{col 68}{space 3} .0068345
{txt}{space 8}lag35 {c |}{col 15}{res}{space 2}-.0141332{col 27}{space 2} .0057112{col 38}{space 1}   -2.47{col 47}{space 3}0.069{col 55}{space 4}-.0299899{col 68}{space 3} .0017235
{txt}{space 8}lag36 {c |}{col 15}{res}{space 2}-.0136505{col 27}{space 2}  .006313{col 38}{space 1}   -2.16{col 47}{space 3}0.097{col 55}{space 4}-.0311783{col 68}{space 3} .0038773
{txt}{space 8}lag37 {c |}{col 15}{res}{space 2}-.0115749{col 27}{space 2} .0055868{col 38}{space 1}   -2.07{col 47}{space 3}0.107{col 55}{space 4}-.0270863{col 68}{space 3} .0039366
{txt}{space 8}lag38 {c |}{col 15}{res}{space 2}-.0057481{col 27}{space 2} .0041748{col 38}{space 1}   -1.38{col 47}{space 3}0.241{col 55}{space 4}-.0173393{col 68}{space 3} .0058431
{txt}{space 8}lag39 {c |}{col 15}{res}{space 2}-.0045442{col 27}{space 2} .0044632{col 38}{space 1}   -1.02{col 47}{space 3}0.366{col 55}{space 4}-.0169361{col 68}{space 3} .0078476
{txt}{space 8}lag40 {c |}{col 15}{res}{space 2} -.012551{col 27}{space 2} .0061987{col 38}{space 1}   -2.02{col 47}{space 3}0.113{col 55}{space 4}-.0297613{col 68}{space 3} .0046594
{txt}{space 8}lag41 {c |}{col 15}{res}{space 2} -.013728{col 27}{space 2} .0073774{col 38}{space 1}   -1.86{col 47}{space 3}0.136{col 55}{space 4}-.0342109{col 68}{space 3}  .006755
{txt}{space 8}lag42 {c |}{col 15}{res}{space 2} -.012939{col 27}{space 2} .0096503{col 38}{space 1}   -1.34{col 47}{space 3}0.251{col 55}{space 4}-.0397325{col 68}{space 3} .0138545
{txt}{space 8}lag43 {c |}{col 15}{res}{space 2}-.0143196{col 27}{space 2} .0067771{col 38}{space 1}   -2.11{col 47}{space 3}0.102{col 55}{space 4}-.0331358{col 68}{space 3} .0044967
{txt}{space 8}lag44 {c |}{col 15}{res}{space 2}-.0092798{col 27}{space 2} .0059362{col 38}{space 1}   -1.56{col 47}{space 3}0.193{col 55}{space 4}-.0257614{col 68}{space 3} .0072017
{txt}{space 8}lag45 {c |}{col 15}{res}{space 2} -.019952{col 27}{space 2} .0062653{col 38}{space 1}   -3.18{col 47}{space 3}0.033{col 55}{space 4}-.0373472{col 68}{space 3}-.0025567
{txt}{space 8}lag46 {c |}{col 15}{res}{space 2}-.0192118{col 27}{space 2} .0085055{col 38}{space 1}   -2.26{col 47}{space 3}0.087{col 55}{space 4}-.0428267{col 68}{space 3} .0044032
{txt}{space 8}lag47 {c |}{col 15}{res}{space 2}-.0162245{col 27}{space 2}  .007447{col 38}{space 1}   -2.18{col 47}{space 3}0.095{col 55}{space 4}-.0369006{col 68}{space 3} .0044516
{txt}{space 8}lag48 {c |}{col 15}{res}{space 2} -.016293{col 27}{space 2} .0102073{col 38}{space 1}   -1.60{col 47}{space 3}0.186{col 55}{space 4} -.044633{col 68}{space 3}  .012047
{txt}{space 8}lag49 {c |}{col 15}{res}{space 2}-.0204741{col 27}{space 2} .0099332{col 38}{space 1}   -2.06{col 47}{space 3}0.108{col 55}{space 4}-.0480531{col 68}{space 3} .0071048
{txt}{space 8}lag50 {c |}{col 15}{res}{space 2}-.0090782{col 27}{space 2} .0084788{col 38}{space 1}   -1.07{col 47}{space 3}0.345{col 55}{space 4}-.0326191{col 68}{space 3} .0144626
{txt}{space 8}lag51 {c |}{col 15}{res}{space 2}-.0080104{col 27}{space 2} .0046793{col 38}{space 1}   -1.71{col 47}{space 3}0.162{col 55}{space 4}-.0210022{col 68}{space 3} .0049813
{txt}{space 8}lag52 {c |}{col 15}{res}{space 2}-.0046684{col 27}{space 2} .0053936{col 38}{space 1}   -0.87{col 47}{space 3}0.436{col 55}{space 4}-.0196436{col 68}{space 3} .0103067
{txt}{space 8}lag53 {c |}{col 15}{res}{space 2}-.0077198{col 27}{space 2}  .006369{col 38}{space 1}   -1.21{col 47}{space 3}0.292{col 55}{space 4}-.0254031{col 68}{space 3} .0099636
{txt}{space 8}lag54 {c |}{col 15}{res}{space 2}-.0086365{col 27}{space 2} .0084054{col 38}{space 1}   -1.03{col 47}{space 3}0.362{col 55}{space 4}-.0319738{col 68}{space 3} .0147007
{txt}{space 8}lag55 {c |}{col 15}{res}{space 2} -.010095{col 27}{space 2} .0117703{col 38}{space 1}   -0.86{col 47}{space 3}0.439{col 55}{space 4}-.0427747{col 68}{space 3} .0225847
{txt}{space 8}lag56 {c |}{col 15}{res}{space 2}-.0211869{col 27}{space 2}  .010486{col 38}{space 1}   -2.02{col 47}{space 3}0.113{col 55}{space 4}-.0503007{col 68}{space 3} .0079269
{txt}{space 8}lag57 {c |}{col 15}{res}{space 2}-.0169185{col 27}{space 2} .0108346{col 38}{space 1}   -1.56{col 47}{space 3}0.193{col 55}{space 4}    -.047{col 68}{space 3} .0131631
{txt}{space 8}lag58 {c |}{col 15}{res}{space 2}-.0155163{col 27}{space 2} .0100323{col 38}{space 1}   -1.55{col 47}{space 3}0.197{col 55}{space 4}-.0433704{col 68}{space 3} .0123378
{txt}{space 8}lag59 {c |}{col 15}{res}{space 2}-.0253821{col 27}{space 2} .0076864{col 38}{space 1}   -3.30{col 47}{space 3}0.030{col 55}{space 4}-.0467229{col 68}{space 3}-.0040413
{txt}{space 8}lag60 {c |}{col 15}{res}{space 2}-.0160595{col 27}{space 2} .0092544{col 38}{space 1}   -1.74{col 47}{space 3}0.158{col 55}{space 4}-.0417539{col 68}{space 3} .0096349
{txt}{space 8}lag61 {c |}{col 15}{res}{space 2}-.0191245{col 27}{space 2} .0093167{col 38}{space 1}   -2.05{col 47}{space 3}0.109{col 55}{space 4}-.0449918{col 68}{space 3} .0067429
{txt}{space 8}lag62 {c |}{col 15}{res}{space 2}-.0160806{col 27}{space 2} .0103638{col 38}{space 1}   -1.55{col 47}{space 3}0.196{col 55}{space 4}-.0448551{col 68}{space 3} .0126939
{txt}{space 8}lag63 {c |}{col 15}{res}{space 2} -.014331{col 27}{space 2}  .012376{col 38}{space 1}   -1.16{col 47}{space 3}0.311{col 55}{space 4}-.0486923{col 68}{space 3} .0200304
{txt}{space 8}lag64 {c |}{col 15}{res}{space 2}-.0119235{col 27}{space 2} .0117149{col 38}{space 1}   -1.02{col 47}{space 3}0.366{col 55}{space 4}-.0444494{col 68}{space 3} .0206024
{txt}{space 8}lag65 {c |}{col 15}{res}{space 2}-.0070355{col 27}{space 2} .0122594{col 38}{space 1}   -0.57{col 47}{space 3}0.597{col 55}{space 4}-.0410731{col 68}{space 3} .0270021
{txt}{space 8}lag66 {c |}{col 15}{res}{space 2}-.0116285{col 27}{space 2} .0097794{col 38}{space 1}   -1.19{col 47}{space 3}0.300{col 55}{space 4}-.0387806{col 68}{space 3} .0155235
{txt}{space 8}lag67 {c |}{col 15}{res}{space 2}-.0237869{col 27}{space 2} .0130915{col 38}{space 1}   -1.82{col 47}{space 3}0.143{col 55}{space 4}-.0601347{col 68}{space 3} .0125609
{txt}{space 8}lag68 {c |}{col 15}{res}{space 2} -.022726{col 27}{space 2} .0113396{col 38}{space 1}   -2.00{col 47}{space 3}0.116{col 55}{space 4}-.0542097{col 68}{space 3} .0087576
{txt}{space 8}lag69 {c |}{col 15}{res}{space 2}-.0198474{col 27}{space 2} .0092616{col 38}{space 1}   -2.14{col 47}{space 3}0.099{col 55}{space 4}-.0455618{col 68}{space 3} .0058671
{txt}{space 8}lag70 {c |}{col 15}{res}{space 2}-.0171496{col 27}{space 2} .0084589{col 38}{space 1}   -2.03{col 47}{space 3}0.113{col 55}{space 4}-.0406353{col 68}{space 3} .0063361
{txt}{space 8}lag71 {c |}{col 15}{res}{space 2}-.0074389{col 27}{space 2} .0094523{col 38}{space 1}   -0.79{col 47}{space 3}0.475{col 55}{space 4}-.0336826{col 68}{space 3} .0188047
{txt}{space 8}lag72 {c |}{col 15}{res}{space 2}-.0075793{col 27}{space 2} .0122051{col 38}{space 1}   -0.62{col 47}{space 3}0.568{col 55}{space 4}-.0414661{col 68}{space 3} .0263074
{txt}{space 8}lag73 {c |}{col 15}{res}{space 2}-.0094679{col 27}{space 2} .0123904{col 38}{space 1}   -0.76{col 47}{space 3}0.487{col 55}{space 4}-.0438692{col 68}{space 3} .0249335
{txt}{space 8}lag74 {c |}{col 15}{res}{space 2}-.0116499{col 27}{space 2} .0088051{col 38}{space 1}   -1.32{col 47}{space 3}0.256{col 55}{space 4}-.0360967{col 68}{space 3} .0127968
{txt}{space 8}lag75 {c |}{col 15}{res}{space 2}-.0115518{col 27}{space 2}  .011804{col 38}{space 1}   -0.98{col 47}{space 3}0.383{col 55}{space 4} -.044325{col 68}{space 3} .0212213
{txt}{space 8}lag76 {c |}{col 15}{res}{space 2}-.0135058{col 27}{space 2} .0137512{col 38}{space 1}   -0.98{col 47}{space 3}0.382{col 55}{space 4}-.0516852{col 68}{space 3} .0246737
{txt}{space 8}lag77 {c |}{col 15}{res}{space 2}-.0150825{col 27}{space 2} .0134952{col 38}{space 1}   -1.12{col 47}{space 3}0.326{col 55}{space 4}-.0525511{col 68}{space 3}  .022386
{txt}{space 8}lag78 {c |}{col 15}{res}{space 2}-.0108693{col 27}{space 2} .0140151{col 38}{space 1}   -0.78{col 47}{space 3}0.481{col 55}{space 4}-.0497814{col 68}{space 3} .0280429
{txt}{space 8}lag79 {c |}{col 15}{res}{space 2}-.0052342{col 27}{space 2} .0115642{col 38}{space 1}   -0.45{col 47}{space 3}0.674{col 55}{space 4}-.0373415{col 68}{space 3} .0268732
{txt}{space 8}lag80 {c |}{col 15}{res}{space 2}-.0078973{col 27}{space 2}  .010837{col 38}{space 1}   -0.73{col 47}{space 3}0.507{col 55}{space 4}-.0379857{col 68}{space 3}  .022191
{txt}{space 8}lag81 {c |}{col 15}{res}{space 2}-.0047139{col 27}{space 2}  .013439{col 38}{space 1}   -0.35{col 47}{space 3}0.743{col 55}{space 4}-.0420265{col 68}{space 3} .0325987
{txt}{space 8}lag82 {c |}{col 15}{res}{space 2}-.0028741{col 27}{space 2} .0089462{col 38}{space 1}   -0.32{col 47}{space 3}0.764{col 55}{space 4}-.0277127{col 68}{space 3} .0219645
{txt}{space 8}lag83 {c |}{col 15}{res}{space 2}-.0125256{col 27}{space 2}  .009656{col 38}{space 1}   -1.30{col 47}{space 3}0.264{col 55}{space 4}-.0393351{col 68}{space 3} .0142838
{txt}{space 8}lag84 {c |}{col 15}{res}{space 2}-.0160032{col 27}{space 2} .0095689{col 38}{space 1}   -1.67{col 47}{space 3}0.170{col 55}{space 4}-.0425707{col 68}{space 3} .0105643
{txt}{space 8}lag85 {c |}{col 15}{res}{space 2}-.0093499{col 27}{space 2} .0125642{col 38}{space 1}   -0.74{col 47}{space 3}0.498{col 55}{space 4}-.0442337{col 68}{space 3} .0255339
{txt}{space 8}lag86 {c |}{col 15}{res}{space 2}-.0042069{col 27}{space 2} .0117561{col 38}{space 1}   -0.36{col 47}{space 3}0.739{col 55}{space 4} -.036847{col 68}{space 3} .0284333
{txt}{space 8}lag87 {c |}{col 15}{res}{space 2}-.0031277{col 27}{space 2} .0121253{col 38}{space 1}   -0.26{col 47}{space 3}0.809{col 55}{space 4}-.0367929{col 68}{space 3} .0305376
{txt}{space 8}lag88 {c |}{col 15}{res}{space 2} -.002966{col 27}{space 2} .0129678{col 38}{space 1}   -0.23{col 47}{space 3}0.830{col 55}{space 4}-.0389705{col 68}{space 3} .0330385
{txt}{space 8}lag89 {c |}{col 15}{res}{space 2}-.0065717{col 27}{space 2} .0145257{col 38}{space 1}   -0.45{col 47}{space 3}0.674{col 55}{space 4}-.0469015{col 68}{space 3}  .033758
{txt}{space 8}lag90 {c |}{col 15}{res}{space 2}-.0099258{col 27}{space 2}  .012237{col 38}{space 1}   -0.81{col 47}{space 3}0.463{col 55}{space 4} -.043901{col 68}{space 3} .0240494
{txt}{space 8}lag91 {c |}{col 15}{res}{space 2}-.0049867{col 27}{space 2} .0131769{col 38}{space 1}   -0.38{col 47}{space 3}0.724{col 55}{space 4}-.0415716{col 68}{space 3} .0315982
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} .6775089{col 27}{space 2}  .074125{col 38}{space 1}    9.14{col 47}{space 3}0.001{col 55}{space 4} .4717049{col 68}{space 3} .8833129
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}   regionid1{col 14}{c |}{space 1}        5{col 27}{space 1}        5{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}        date{col 14}{c |}{space 1}     5267{col 27}{space 1}        1{col 39}{result}{space 1}     5266{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. graph export "results/EventStudy-Elec.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/simonpostler/Desktop/applied-econometrics-dst-master-2/results/EventStudy-Elec.png{rm}
saved as
PNG
format
{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/6h/778gphg5533gk87_wkb11wqh0000gn/T//SD01922.000000"
{txt}
{com}. use "data/06-half-hourly.dta", clear
{txt}
{com}. /// DDD regression - adjusting for midday emissions
> reg co2_kg_per_capita c.dst_here_anytime##c.dst_now_anywhere##c.not_midday weekend_local public_holiday temperature c.temperature#c.temperature solar_exposure wind_3 [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.2139
                                                {txt}Root MSE          =    {res} .14328

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}co2_kg_per_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.1325527{col 27}{space 2} .0298196{col 38}{space 1}   -4.45{col 47}{space 3}0.011{col 55}{space 4}-.2153453{col 68}{space 3}-.0497601
{txt}dst_now_any~e {c |}{col 15}{res}{space 2} .0522316{col 27}{space 2} .0173514{col 38}{space 1}    3.01{col 47}{space 3}0.040{col 55}{space 4} .0040564{col 68}{space 3} .1004068
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0260932{col 27}{space 2} .0184588{col 38}{space 1}   -1.41{col 47}{space 3}0.230{col 55}{space 4}-.0773431{col 68}{space 3} .0251568
{txt}{space 13} {c |}
{space 3}not_midday {c |}{col 15}{res}{space 2} .0268428{col 27}{space 2} 4.50e-13{col 38}{space 1} 6.0e+10{col 47}{space 3}0.000{col 55}{space 4} .0268428{col 68}{space 3} .0268428
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 1}c.not_midday {c |}{col 15}{res}{space 2}-.0130689{col 27}{space 2} .0080681{col 38}{space 1}   -1.62{col 47}{space 3}0.181{col 55}{space 4}-.0354696{col 68}{space 3} .0093317
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_now_any~e#{c |}
{space 1}c.not_midday {c |}{col 15}{res}{space 2}-.0296795{col 27}{space 2} 1.02e-12{col 38}{space 1}-2.9e+10{col 47}{space 3}0.000{col 55}{space 4}-.0296795{col 68}{space 3}-.0296795
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e#{c |}
{space 1}c.not_midday {c |}{col 15}{res}{space 2} .0091201{col 27}{space 2} .0123802{col 38}{space 1}    0.74{col 47}{space 3}0.502{col 55}{space 4}-.0252527{col 68}{space 3}  .043493
{txt}{space 13} {c |}
weekend_local {c |}{col 15}{res}{space 2}-.0338318{col 27}{space 2} .0013229{col 38}{space 1}  -25.57{col 47}{space 3}0.000{col 55}{space 4}-.0375047{col 68}{space 3}-.0301589
{txt}public_holi~y {c |}{col 15}{res}{space 2}-.0377951{col 27}{space 2} .0055605{col 38}{space 1}   -6.80{col 47}{space 3}0.002{col 55}{space 4}-.0532335{col 68}{space 3}-.0223566
{txt}{space 2}temperature {c |}{col 15}{res}{space 2}-.0108864{col 27}{space 2} .0141706{col 38}{space 1}   -0.77{col 47}{space 3}0.485{col 55}{space 4}-.0502305{col 68}{space 3} .0284576
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2} .0002718{col 27}{space 2} .0002346{col 38}{space 1}    1.16{col 47}{space 3}0.311{col 55}{space 4}-.0003796{col 68}{space 3} .0009232
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2}-.0042183{col 27}{space 2}   .00631{col 38}{space 1}   -0.67{col 47}{space 3}0.540{col 55}{space 4}-.0217376{col 68}{space 3} .0133011
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2}-.0593653{col 27}{space 2} .0249105{col 38}{space 1}   -2.38{col 47}{space 3}0.076{col 55}{space 4}-.1285279{col 68}{space 3} .0097974
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} .7129355{col 27}{space 2} .2152254{col 38}{space 1}    3.31{col 47}{space 3}0.030{col 55}{space 4} .1153739{col 68}{space 3} 1.310497
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo CO2_DDD
{txt}
{com}. 
. reg energy_kwh_per_capita c.dst_here_anytime##c.dst_now_anywhere##c.not_midday weekend_local public_holiday c.temperature##c.temperature solar_exposure wind_3 [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.3793
                                                {txt}Root MSE          =    {res} .12157

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}energy_kwh_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.2117327{col 27}{space 2}  .021124{col 38}{space 1}  -10.02{col 47}{space 3}0.001{col 55}{space 4}-.2703823{col 68}{space 3}-.1530831
{txt}dst_now_any~e {c |}{col 15}{res}{space 2} .0674212{col 27}{space 2} .0173534{col 38}{space 1}    3.89{col 47}{space 3}0.018{col 55}{space 4} .0192403{col 68}{space 3} .1156021
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0341096{col 27}{space 2} .0194444{col 38}{space 1}   -1.75{col 47}{space 3}0.154{col 55}{space 4}-.0880958{col 68}{space 3} .0198766
{txt}{space 13} {c |}
{space 3}not_midday {c |}{col 15}{res}{space 2} .0200269{col 27}{space 2} 1.52e-13{col 38}{space 1} 1.3e+11{col 47}{space 3}0.000{col 55}{space 4} .0200269{col 68}{space 3} .0200269
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 1}c.not_midday {c |}{col 15}{res}{space 2}-.0036683{col 27}{space 2} .0053269{col 38}{space 1}   -0.69{col 47}{space 3}0.529{col 55}{space 4}-.0184581{col 68}{space 3} .0111215
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_now_any~e#{c |}
{space 1}c.not_midday {c |}{col 15}{res}{space 2}-.0410905{col 27}{space 2} 5.20e-13{col 38}{space 1}-7.9e+10{col 47}{space 3}0.000{col 55}{space 4}-.0410905{col 68}{space 3}-.0410905
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e#{c |}
{space 1}c.not_midday {c |}{col 15}{res}{space 2} .0121177{col 27}{space 2} .0104272{col 38}{space 1}    1.16{col 47}{space 3}0.310{col 55}{space 4}-.0168329{col 68}{space 3} .0410684
{txt}{space 13} {c |}
weekend_local {c |}{col 15}{res}{space 2}-.0461577{col 27}{space 2} .0018092{col 38}{space 1}  -25.51{col 47}{space 3}0.000{col 55}{space 4}-.0511807{col 68}{space 3}-.0411347
{txt}public_holi~y {c |}{col 15}{res}{space 2} -.049808{col 27}{space 2} .0038724{col 38}{space 1}  -12.86{col 47}{space 3}0.000{col 55}{space 4}-.0605594{col 68}{space 3}-.0390566
{txt}{space 2}temperature {c |}{col 15}{res}{space 2}-.0250169{col 27}{space 2} .0167781{col 38}{space 1}   -1.49{col 47}{space 3}0.210{col 55}{space 4}-.0716003{col 68}{space 3} .0215664
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2} .0005213{col 27}{space 2} .0002887{col 38}{space 1}    1.81{col 47}{space 3}0.145{col 55}{space 4}-.0002803{col 68}{space 3} .0013228
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2}-.0081455{col 27}{space 2} .0059963{col 38}{space 1}   -1.36{col 47}{space 3}0.246{col 55}{space 4}-.0247939{col 68}{space 3} .0085028
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2} .0041665{col 27}{space 2} .0118573{col 38}{space 1}    0.35{col 47}{space 3}0.743{col 55}{space 4}-.0287547{col 68}{space 3} .0370877
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} .9901444{col 27}{space 2} .2649961{col 38}{space 1}    3.74{col 47}{space 3}0.020{col 55}{space 4} .2543972{col 68}{space 3} 1.725892
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo Elec_DDD
{txt}
{com}. 
. esttab CO2_DDD Elec_DDD using "results/DDD-results.tex", label se stats(r2 r2_a) replace
{res}{txt}(output written to {browse  `"results/DDD-results.tex"'})

{com}. 
{txt}end of do-file

{com}. do "/var/folders/6h/778gphg5533gk87_wkb11wqh0000gn/T//SD01922.000000"
{txt}
{com}. use "data/06-half-hourly.dta", clear
{txt}
{com}. gen timevar = .
{txt}(1,264,072 missing values generated)

{com}. replace timevar = days_into_dst if dst_here_anytime == 1
{txt}(1,011,256 real changes made)

{com}. 
. eventdd co2_g_per_capita_vs_midday public_holiday c.temperature##c.temperature solar_exposure wind_3  [aweight = population], timevar(timevar) method(hdfe, absorb(regionid1 date) cluster(regionid1)) graph_op(ytitle("Co2 g per capita") xtitle("Days until DST transition") title("Event Study - CO2 - Midday Normalised"))
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}{txt}warning: missing F statistic; dropped variables due to collinearity or too few clusters
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,264,072
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F( 190,      4)}{col 67}=          {res}.
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.2247
{txt}{col 51}Adj R-squared{col 67}= {res}    0.2214
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0164
{txt}{col 1}Number of clusters ({res}regionid1{txt}) {col 30}= {res}         5{txt}{col 51}Root MSE{col 67}= {res}   57.0638

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}co2_g_per_c~y{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
public_holi~y {c |}{col 15}{res}{space 2} 9.626883{col 27}{space 2} 2.313241{col 38}{space 1}    4.16{col 47}{space 3}0.014{col 55}{space 4} 3.204296{col 68}{space 3} 16.04947
{txt}{space 2}temperature {c |}{col 15}{res}{space 2} 10.03273{col 27}{space 2} 1.516388{col 38}{space 1}    6.62{col 47}{space 3}0.003{col 55}{space 4} 5.822567{col 68}{space 3}  14.2429
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2}-.2040309{col 27}{space 2} .0261019{col 38}{space 1}   -7.82{col 47}{space 3}0.001{col 55}{space 4}-.2765013{col 68}{space 3}-.1315605
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2} 2.760149{col 27}{space 2}  .640745{col 38}{space 1}    4.31{col 47}{space 3}0.013{col 55}{space 4} .9811556{col 68}{space 3} 4.539142
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2}-1.418261{col 27}{space 2} .4965356{col 38}{space 1}   -2.86{col 47}{space 3}0.046{col 55}{space 4}-2.796865{col 68}{space 3}-.0396575
{txt}{space 7}lead94 {c |}{col 15}{res}{space 2} 6.372171{col 27}{space 2}  5.60523{col 38}{space 1}    1.14{col 47}{space 3}0.319{col 55}{space 4}-9.190441{col 68}{space 3} 21.93478
{txt}{space 7}lead93 {c |}{col 15}{res}{space 2}-5.121897{col 27}{space 2} 3.698344{col 38}{space 1}   -1.38{col 47}{space 3}0.238{col 55}{space 4}-15.39015{col 68}{space 3} 5.146351
{txt}{space 7}lead92 {c |}{col 15}{res}{space 2} 16.54164{col 27}{space 2} 7.032009{col 38}{space 1}    2.35{col 47}{space 3}0.078{col 55}{space 4}-2.982351{col 68}{space 3} 36.06562
{txt}{space 7}lead91 {c |}{col 15}{res}{space 2} 6.699928{col 27}{space 2} 9.970454{col 38}{space 1}    0.67{col 47}{space 3}0.538{col 55}{space 4}-20.98249{col 68}{space 3} 34.38235
{txt}{space 7}lead90 {c |}{col 15}{res}{space 2} 9.574964{col 27}{space 2} 5.000733{col 38}{space 1}    1.91{col 47}{space 3}0.128{col 55}{space 4}-4.309297{col 68}{space 3} 23.45922
{txt}{space 7}lead89 {c |}{col 15}{res}{space 2} 8.177103{col 27}{space 2} 4.815406{col 38}{space 1}    1.70{col 47}{space 3}0.165{col 55}{space 4}-5.192607{col 68}{space 3} 21.54681
{txt}{space 7}lead88 {c |}{col 15}{res}{space 2} 14.67912{col 27}{space 2} 4.718419{col 38}{space 1}    3.11{col 47}{space 3}0.036{col 55}{space 4} 1.578689{col 68}{space 3} 27.77955
{txt}{space 7}lead87 {c |}{col 15}{res}{space 2}  6.52669{col 27}{space 2} 2.077741{col 38}{space 1}    3.14{col 47}{space 3}0.035{col 55}{space 4} .7579556{col 68}{space 3} 12.29542
{txt}{space 7}lead86 {c |}{col 15}{res}{space 2}-.0426925{col 27}{space 2} 4.089545{col 38}{space 1}   -0.01{col 47}{space 3}0.992{col 55}{space 4}-11.39709{col 68}{space 3} 11.31171
{txt}{space 7}lead85 {c |}{col 15}{res}{space 2}-1.996452{col 27}{space 2} 7.791541{col 38}{space 1}   -0.26{col 47}{space 3}0.810{col 55}{space 4}-23.62924{col 68}{space 3} 19.63633
{txt}{space 7}lead84 {c |}{col 15}{res}{space 2} 7.205703{col 27}{space 2}  10.1275{col 38}{space 1}    0.71{col 47}{space 3}0.516{col 55}{space 4}-20.91275{col 68}{space 3} 35.32416
{txt}{space 7}lead83 {c |}{col 15}{res}{space 2} 2.245915{col 27}{space 2} 6.964547{col 38}{space 1}    0.32{col 47}{space 3}0.763{col 55}{space 4}-17.09077{col 68}{space 3}  21.5826
{txt}{space 7}lead82 {c |}{col 15}{res}{space 2}-.3588945{col 27}{space 2} 5.452433{col 38}{space 1}   -0.07{col 47}{space 3}0.951{col 55}{space 4}-15.49728{col 68}{space 3} 14.77949
{txt}{space 7}lead81 {c |}{col 15}{res}{space 2}  .701865{col 27}{space 2} 3.574365{col 38}{space 1}    0.20{col 47}{space 3}0.854{col 55}{space 4}-9.222165{col 68}{space 3} 10.62589
{txt}{space 7}lead80 {c |}{col 15}{res}{space 2}-7.238525{col 27}{space 2} 8.099188{col 38}{space 1}   -0.89{col 47}{space 3}0.422{col 55}{space 4}-29.72547{col 68}{space 3} 15.24843
{txt}{space 7}lead79 {c |}{col 15}{res}{space 2}-1.469949{col 27}{space 2} 6.297691{col 38}{space 1}   -0.23{col 47}{space 3}0.827{col 55}{space 4}-18.95514{col 68}{space 3} 16.01524
{txt}{space 7}lead78 {c |}{col 15}{res}{space 2} -1.63898{col 27}{space 2} 7.376371{col 38}{space 1}   -0.22{col 47}{space 3}0.835{col 55}{space 4}-22.11907{col 68}{space 3} 18.84111
{txt}{space 7}lead77 {c |}{col 15}{res}{space 2} 6.936224{col 27}{space 2} 5.983359{col 38}{space 1}    1.16{col 47}{space 3}0.311{col 55}{space 4}-9.676245{col 68}{space 3} 23.54869
{txt}{space 7}lead76 {c |}{col 15}{res}{space 2}-.6709863{col 27}{space 2} 5.306325{col 38}{space 1}   -0.13{col 47}{space 3}0.905{col 55}{space 4}-15.40371{col 68}{space 3} 14.06173
{txt}{space 7}lead75 {c |}{col 15}{res}{space 2} -.616051{col 27}{space 2} 7.943087{col 38}{space 1}   -0.08{col 47}{space 3}0.942{col 55}{space 4} -22.6696{col 68}{space 3} 21.43749
{txt}{space 7}lead74 {c |}{col 15}{res}{space 2} 3.619898{col 27}{space 2}  5.89659{col 38}{space 1}    0.61{col 47}{space 3}0.572{col 55}{space 4}-12.75166{col 68}{space 3} 19.99146
{txt}{space 7}lead73 {c |}{col 15}{res}{space 2} 3.484314{col 27}{space 2} 3.952621{col 38}{space 1}    0.88{col 47}{space 3}0.428{col 55}{space 4}-7.489923{col 68}{space 3} 14.45855
{txt}{space 7}lead72 {c |}{col 15}{res}{space 2} 6.985579{col 27}{space 2} 6.364571{col 38}{space 1}    1.10{col 47}{space 3}0.334{col 55}{space 4} -10.6853{col 68}{space 3} 24.65646
{txt}{space 7}lead71 {c |}{col 15}{res}{space 2} 6.797453{col 27}{space 2} 5.581818{col 38}{space 1}    1.22{col 47}{space 3}0.290{col 55}{space 4}-8.700158{col 68}{space 3} 22.29506
{txt}{space 7}lead70 {c |}{col 15}{res}{space 2} 8.067175{col 27}{space 2} 6.235523{col 38}{space 1}    1.29{col 47}{space 3}0.265{col 55}{space 4}-9.245411{col 68}{space 3} 25.37976
{txt}{space 7}lead69 {c |}{col 15}{res}{space 2} 3.621234{col 27}{space 2} 7.720144{col 38}{space 1}    0.47{col 47}{space 3}0.663{col 55}{space 4}-17.81332{col 68}{space 3} 25.05579
{txt}{space 7}lead68 {c |}{col 15}{res}{space 2}-1.270658{col 27}{space 2} 8.265807{col 38}{space 1}   -0.15{col 47}{space 3}0.885{col 55}{space 4}-24.22022{col 68}{space 3}  21.6789
{txt}{space 7}lead67 {c |}{col 15}{res}{space 2}-1.467699{col 27}{space 2}  8.59911{col 38}{space 1}   -0.17{col 47}{space 3}0.873{col 55}{space 4}-25.34266{col 68}{space 3} 22.40726
{txt}{space 7}lead66 {c |}{col 15}{res}{space 2} 4.274118{col 27}{space 2} 7.185262{col 38}{space 1}    0.59{col 47}{space 3}0.584{col 55}{space 4}-15.67537{col 68}{space 3}  24.2236
{txt}{space 7}lead65 {c |}{col 15}{res}{space 2} -.676925{col 27}{space 2} 8.548332{col 38}{space 1}   -0.08{col 47}{space 3}0.941{col 55}{space 4} -24.4109{col 68}{space 3} 23.05705
{txt}{space 7}lead64 {c |}{col 15}{res}{space 2} 4.736577{col 27}{space 2} 6.507576{col 38}{space 1}    0.73{col 47}{space 3}0.507{col 55}{space 4}-13.33135{col 68}{space 3}  22.8045
{txt}{space 7}lead63 {c |}{col 15}{res}{space 2} 8.312716{col 27}{space 2} 5.284666{col 38}{space 1}    1.57{col 47}{space 3}0.191{col 55}{space 4}-6.359871{col 68}{space 3}  22.9853
{txt}{space 7}lead62 {c |}{col 15}{res}{space 2} 6.079482{col 27}{space 2} 2.697777{col 38}{space 1}    2.25{col 47}{space 3}0.087{col 55}{space 4}-1.410748{col 68}{space 3} 13.56971
{txt}{space 7}lead61 {c |}{col 15}{res}{space 2} 7.186374{col 27}{space 2} 6.353985{col 38}{space 1}    1.13{col 47}{space 3}0.321{col 55}{space 4}-10.45512{col 68}{space 3} 24.82787
{txt}{space 7}lead60 {c |}{col 15}{res}{space 2} 4.384822{col 27}{space 2} 6.434641{col 38}{space 1}    0.68{col 47}{space 3}0.533{col 55}{space 4}-13.48061{col 68}{space 3} 22.25025
{txt}{space 7}lead59 {c |}{col 15}{res}{space 2}-.1369683{col 27}{space 2} 6.455182{col 38}{space 1}   -0.02{col 47}{space 3}0.984{col 55}{space 4}-18.05943{col 68}{space 3} 17.78549
{txt}{space 7}lead58 {c |}{col 15}{res}{space 2} 2.427726{col 27}{space 2} 6.523812{col 38}{space 1}    0.37{col 47}{space 3}0.729{col 55}{space 4}-15.68528{col 68}{space 3} 20.54073
{txt}{space 7}lead57 {c |}{col 15}{res}{space 2} 1.958958{col 27}{space 2} 5.288392{col 38}{space 1}    0.37{col 47}{space 3}0.730{col 55}{space 4}-12.72397{col 68}{space 3} 16.64189
{txt}{space 7}lead56 {c |}{col 15}{res}{space 2} 5.490467{col 27}{space 2} 5.736369{col 38}{space 1}    0.96{col 47}{space 3}0.393{col 55}{space 4}-10.43625{col 68}{space 3} 21.41718
{txt}{space 7}lead55 {c |}{col 15}{res}{space 2} 4.145066{col 27}{space 2} 6.289328{col 38}{space 1}    0.66{col 47}{space 3}0.546{col 55}{space 4}-13.31691{col 68}{space 3} 21.60704
{txt}{space 7}lead54 {c |}{col 15}{res}{space 2}  3.41831{col 27}{space 2} 6.564023{col 38}{space 1}    0.52{col 47}{space 3}0.630{col 55}{space 4}-14.80634{col 68}{space 3} 21.64296
{txt}{space 7}lead53 {c |}{col 15}{res}{space 2} 2.512852{col 27}{space 2} 5.912004{col 38}{space 1}    0.43{col 47}{space 3}0.693{col 55}{space 4} -13.9015{col 68}{space 3} 18.92721
{txt}{space 7}lead52 {c |}{col 15}{res}{space 2}-1.466604{col 27}{space 2} 10.43843{col 38}{space 1}   -0.14{col 47}{space 3}0.895{col 55}{space 4}-30.44834{col 68}{space 3} 27.51513
{txt}{space 7}lead51 {c |}{col 15}{res}{space 2}  .401624{col 27}{space 2} 5.517339{col 38}{space 1}    0.07{col 47}{space 3}0.945{col 55}{space 4}-14.91696{col 68}{space 3} 15.72021
{txt}{space 7}lead50 {c |}{col 15}{res}{space 2} 2.361022{col 27}{space 2}   5.5911{col 38}{space 1}    0.42{col 47}{space 3}0.695{col 55}{space 4}-13.16236{col 68}{space 3} 17.88441
{txt}{space 7}lead49 {c |}{col 15}{res}{space 2}-.8117076{col 27}{space 2}  3.03564{col 38}{space 1}   -0.27{col 47}{space 3}0.802{col 55}{space 4}-9.239995{col 68}{space 3}  7.61658
{txt}{space 7}lead48 {c |}{col 15}{res}{space 2}-3.035036{col 27}{space 2} 3.539935{col 38}{space 1}   -0.86{col 47}{space 3}0.440{col 55}{space 4}-12.86347{col 68}{space 3} 6.793399
{txt}{space 7}lead47 {c |}{col 15}{res}{space 2}-3.901034{col 27}{space 2} 4.166975{col 38}{space 1}   -0.94{col 47}{space 3}0.402{col 55}{space 4}-15.47041{col 68}{space 3} 7.668344
{txt}{space 7}lead46 {c |}{col 15}{res}{space 2} 2.847115{col 27}{space 2} 6.547271{col 38}{space 1}    0.43{col 47}{space 3}0.686{col 55}{space 4}-15.33102{col 68}{space 3} 21.02525
{txt}{space 7}lead45 {c |}{col 15}{res}{space 2}  4.00493{col 27}{space 2} 4.633783{col 38}{space 1}    0.86{col 47}{space 3}0.436{col 55}{space 4}-8.860515{col 68}{space 3} 16.87037
{txt}{space 7}lead44 {c |}{col 15}{res}{space 2} .6619417{col 27}{space 2} 7.475229{col 38}{space 1}    0.09{col 47}{space 3}0.934{col 55}{space 4}-20.09262{col 68}{space 3} 21.41651
{txt}{space 7}lead43 {c |}{col 15}{res}{space 2}-1.122928{col 27}{space 2} 3.655052{col 38}{space 1}   -0.31{col 47}{space 3}0.774{col 55}{space 4}-11.27098{col 68}{space 3} 9.025122
{txt}{space 7}lead42 {c |}{col 15}{res}{space 2} 6.108633{col 27}{space 2} 1.882653{col 38}{space 1}    3.24{col 47}{space 3}0.032{col 55}{space 4} .8815494{col 68}{space 3} 11.33572
{txt}{space 7}lead41 {c |}{col 15}{res}{space 2} 1.925469{col 27}{space 2} 3.944173{col 38}{space 1}    0.49{col 47}{space 3}0.651{col 55}{space 4}-9.025311{col 68}{space 3} 12.87625
{txt}{space 7}lead40 {c |}{col 15}{res}{space 2}-.3355185{col 27}{space 2} 5.607795{col 38}{space 1}   -0.06{col 47}{space 3}0.955{col 55}{space 4}-15.90525{col 68}{space 3} 15.23422
{txt}{space 7}lead39 {c |}{col 15}{res}{space 2} .2830369{col 27}{space 2} 6.621396{col 38}{space 1}    0.04{col 47}{space 3}0.968{col 55}{space 4}-18.10091{col 68}{space 3} 18.66698
{txt}{space 7}lead38 {c |}{col 15}{res}{space 2} 3.692444{col 27}{space 2} 3.975042{col 38}{space 1}    0.93{col 47}{space 3}0.406{col 55}{space 4}-7.344041{col 68}{space 3} 14.72893
{txt}{space 7}lead37 {c |}{col 15}{res}{space 2} 2.617905{col 27}{space 2} 4.002413{col 38}{space 1}    0.65{col 47}{space 3}0.549{col 55}{space 4}-8.494575{col 68}{space 3} 13.73039
{txt}{space 7}lead36 {c |}{col 15}{res}{space 2} 2.947428{col 27}{space 2} 4.507065{col 38}{space 1}    0.65{col 47}{space 3}0.549{col 55}{space 4}-9.566191{col 68}{space 3} 15.46105
{txt}{space 7}lead35 {c |}{col 15}{res}{space 2} 8.970176{col 27}{space 2} 4.479997{col 38}{space 1}    2.00{col 47}{space 3}0.116{col 55}{space 4} -3.46829{col 68}{space 3} 21.40864
{txt}{space 7}lead34 {c |}{col 15}{res}{space 2} 1.842538{col 27}{space 2} 5.216178{col 38}{space 1}    0.35{col 47}{space 3}0.742{col 55}{space 4}-12.63989{col 68}{space 3} 16.32497
{txt}{space 7}lead33 {c |}{col 15}{res}{space 2} 1.856477{col 27}{space 2} 3.917527{col 38}{space 1}    0.47{col 47}{space 3}0.660{col 55}{space 4}-9.020323{col 68}{space 3} 12.73328
{txt}{space 7}lead32 {c |}{col 15}{res}{space 2} 2.145138{col 27}{space 2} 4.280692{col 38}{space 1}    0.50{col 47}{space 3}0.643{col 55}{space 4}-9.739969{col 68}{space 3} 14.03025
{txt}{space 7}lead31 {c |}{col 15}{res}{space 2} .6707203{col 27}{space 2} 3.043569{col 38}{space 1}    0.22{col 47}{space 3}0.836{col 55}{space 4}-7.779581{col 68}{space 3} 9.121022
{txt}{space 7}lead30 {c |}{col 15}{res}{space 2} 3.241556{col 27}{space 2} 2.474745{col 38}{space 1}    1.31{col 47}{space 3}0.260{col 55}{space 4}-3.629439{col 68}{space 3} 10.11255
{txt}{space 7}lead29 {c |}{col 15}{res}{space 2} 5.815537{col 27}{space 2} 2.963436{col 38}{space 1}    1.96{col 47}{space 3}0.121{col 55}{space 4}-2.412279{col 68}{space 3} 14.04335
{txt}{space 7}lead28 {c |}{col 15}{res}{space 2} 3.873268{col 27}{space 2} 3.654826{col 38}{space 1}    1.06{col 47}{space 3}0.349{col 55}{space 4}-6.274155{col 68}{space 3} 14.02069
{txt}{space 7}lead27 {c |}{col 15}{res}{space 2} 4.139343{col 27}{space 2} 2.578903{col 38}{space 1}    1.61{col 47}{space 3}0.184{col 55}{space 4} -3.02084{col 68}{space 3} 11.29953
{txt}{space 7}lead26 {c |}{col 15}{res}{space 2} 3.103773{col 27}{space 2} 4.360294{col 38}{space 1}    0.71{col 47}{space 3}0.516{col 55}{space 4}-9.002344{col 68}{space 3} 15.20989
{txt}{space 7}lead25 {c |}{col 15}{res}{space 2}-2.676045{col 27}{space 2} 2.265625{col 38}{space 1}   -1.18{col 47}{space 3}0.303{col 55}{space 4} -8.96643{col 68}{space 3} 3.614339
{txt}{space 7}lead24 {c |}{col 15}{res}{space 2}-.8983625{col 27}{space 2} 3.139476{col 38}{space 1}   -0.29{col 47}{space 3}0.789{col 55}{space 4}-9.614945{col 68}{space 3} 7.818219
{txt}{space 7}lead23 {c |}{col 15}{res}{space 2} 1.709854{col 27}{space 2} 2.752104{col 38}{space 1}    0.62{col 47}{space 3}0.568{col 55}{space 4}-5.931211{col 68}{space 3} 9.350919
{txt}{space 7}lead22 {c |}{col 15}{res}{space 2}-2.219792{col 27}{space 2} 2.185872{col 38}{space 1}   -1.02{col 47}{space 3}0.367{col 55}{space 4}-8.288746{col 68}{space 3} 3.849162
{txt}{space 7}lead21 {c |}{col 15}{res}{space 2} .2952559{col 27}{space 2} 2.424795{col 38}{space 1}    0.12{col 47}{space 3}0.909{col 55}{space 4}-6.437055{col 68}{space 3} 7.027567
{txt}{space 7}lead20 {c |}{col 15}{res}{space 2} 2.959404{col 27}{space 2} 2.910094{col 38}{space 1}    1.02{col 47}{space 3}0.367{col 55}{space 4}-5.120311{col 68}{space 3} 11.03912
{txt}{space 7}lead19 {c |}{col 15}{res}{space 2}-1.834184{col 27}{space 2} .9051482{col 38}{space 1}   -2.03{col 47}{space 3}0.113{col 55}{space 4}-4.347278{col 68}{space 3} .6789099
{txt}{space 7}lead18 {c |}{col 15}{res}{space 2} 4.020641{col 27}{space 2} 1.190259{col 38}{space 1}    3.38{col 47}{space 3}0.028{col 55}{space 4} .7159516{col 68}{space 3}  7.32533
{txt}{space 7}lead17 {c |}{col 15}{res}{space 2} .1209167{col 27}{space 2} 1.178258{col 38}{space 1}    0.10{col 47}{space 3}0.923{col 55}{space 4}-3.150452{col 68}{space 3} 3.392285
{txt}{space 7}lead16 {c |}{col 15}{res}{space 2} .0338244{col 27}{space 2} 1.359909{col 38}{space 1}    0.02{col 47}{space 3}0.981{col 55}{space 4}-3.741887{col 68}{space 3} 3.809536
{txt}{space 7}lead15 {c |}{col 15}{res}{space 2}-6.273432{col 27}{space 2}  .992588{col 38}{space 1}   -6.32{col 47}{space 3}0.003{col 55}{space 4}-9.029298{col 68}{space 3}-3.517566
{txt}{space 7}lead14 {c |}{col 15}{res}{space 2}-2.955017{col 27}{space 2} 1.543157{col 38}{space 1}   -1.91{col 47}{space 3}0.128{col 55}{space 4}-7.239509{col 68}{space 3} 1.329474
{txt}{space 7}lead13 {c |}{col 15}{res}{space 2} 2.738677{col 27}{space 2} .9627416{col 38}{space 1}    2.84{col 47}{space 3}0.047{col 55}{space 4} .0656773{col 68}{space 3} 5.411676
{txt}{space 7}lead12 {c |}{col 15}{res}{space 2}-1.835129{col 27}{space 2} 1.482849{col 38}{space 1}   -1.24{col 47}{space 3}0.284{col 55}{space 4}-5.952178{col 68}{space 3}  2.28192
{txt}{space 7}lead11 {c |}{col 15}{res}{space 2}-2.156867{col 27}{space 2} 1.504924{col 38}{space 1}   -1.43{col 47}{space 3}0.225{col 55}{space 4}-6.335207{col 68}{space 3} 2.021473
{txt}{space 7}lead10 {c |}{col 15}{res}{space 2}-4.929836{col 27}{space 2} 2.075909{col 38}{space 1}   -2.37{col 47}{space 3}0.076{col 55}{space 4}-10.69348{col 68}{space 3} .8338109
{txt}{space 8}lead9 {c |}{col 15}{res}{space 2}-2.822196{col 27}{space 2} 1.148687{col 38}{space 1}   -2.46{col 47}{space 3}0.070{col 55}{space 4}-6.011463{col 68}{space 3} .3670707
{txt}{space 8}lead8 {c |}{col 15}{res}{space 2} 2.867213{col 27}{space 2} 2.292924{col 38}{space 1}    1.25{col 47}{space 3}0.279{col 55}{space 4}-3.498963{col 68}{space 3} 9.233389
{txt}{space 8}lead7 {c |}{col 15}{res}{space 2} 2.777545{col 27}{space 2} 2.311228{col 38}{space 1}    1.20{col 47}{space 3}0.296{col 55}{space 4}-3.639452{col 68}{space 3} 9.194541
{txt}{space 8}lead6 {c |}{col 15}{res}{space 2}-3.363415{col 27}{space 2} .7812099{col 38}{space 1}   -4.31{col 47}{space 3}0.013{col 55}{space 4}-5.532402{col 68}{space 3}-1.194429
{txt}{space 8}lead5 {c |}{col 15}{res}{space 2}-7.754699{col 27}{space 2}  1.73499{col 38}{space 1}   -4.47{col 47}{space 3}0.011{col 55}{space 4} -12.5718{col 68}{space 3}-2.937594
{txt}{space 8}lead4 {c |}{col 15}{res}{space 2}-3.659743{col 27}{space 2} 1.984025{col 38}{space 1}   -1.84{col 47}{space 3}0.139{col 55}{space 4} -9.16828{col 68}{space 3} 1.848794
{txt}{space 8}lead3 {c |}{col 15}{res}{space 2}-6.134048{col 27}{space 2} 1.296709{col 38}{space 1}   -4.73{col 47}{space 3}0.009{col 55}{space 4} -9.73429{col 68}{space 3}-2.533805
{txt}{space 8}lead2 {c |}{col 15}{res}{space 2}-1.100363{col 27}{space 2} 2.188815{col 38}{space 1}   -0.50{col 47}{space 3}0.642{col 55}{space 4}-7.177487{col 68}{space 3} 4.976762
{txt}{space 9}lag0 {c |}{col 15}{res}{space 2}-1.572786{col 27}{space 2} .5874976{col 38}{space 1}   -2.68{col 47}{space 3}0.055{col 55}{space 4} -3.20394{col 68}{space 3} .0583692
{txt}{space 9}lag1 {c |}{col 15}{res}{space 2}-3.407941{col 27}{space 2} 1.508194{col 38}{space 1}   -2.26{col 47}{space 3}0.087{col 55}{space 4} -7.59536{col 68}{space 3}  .779478
{txt}{space 9}lag2 {c |}{col 15}{res}{space 2}-2.804686{col 27}{space 2} 1.572261{col 38}{space 1}   -1.78{col 47}{space 3}0.149{col 55}{space 4}-7.169981{col 68}{space 3} 1.560609
{txt}{space 9}lag3 {c |}{col 15}{res}{space 2} -2.76672{col 27}{space 2} 3.578679{col 38}{space 1}   -0.77{col 47}{space 3}0.483{col 55}{space 4}-12.70273{col 68}{space 3} 7.169287
{txt}{space 9}lag4 {c |}{col 15}{res}{space 2}  2.18688{col 27}{space 2} 3.579947{col 38}{space 1}    0.61{col 47}{space 3}0.574{col 55}{space 4}-7.752645{col 68}{space 3} 12.12641
{txt}{space 9}lag5 {c |}{col 15}{res}{space 2}-.0804959{col 27}{space 2} 3.345865{col 38}{space 1}   -0.02{col 47}{space 3}0.982{col 55}{space 4}-9.370105{col 68}{space 3} 9.209113
{txt}{space 9}lag6 {c |}{col 15}{res}{space 2}  -.77604{col 27}{space 2} 5.164566{col 38}{space 1}   -0.15{col 47}{space 3}0.888{col 55}{space 4}-15.11517{col 68}{space 3} 13.56309
{txt}{space 9}lag7 {c |}{col 15}{res}{space 2} .6358153{col 27}{space 2} 2.360526{col 38}{space 1}    0.27{col 47}{space 3}0.801{col 55}{space 4}-5.918054{col 68}{space 3} 7.189685
{txt}{space 9}lag8 {c |}{col 15}{res}{space 2} 6.067891{col 27}{space 2} 3.518631{col 38}{space 1}    1.72{col 47}{space 3}0.160{col 55}{space 4}-3.701396{col 68}{space 3} 15.83718
{txt}{space 9}lag9 {c |}{col 15}{res}{space 2} 5.100559{col 27}{space 2} 4.061282{col 38}{space 1}    1.26{col 47}{space 3}0.278{col 55}{space 4}-6.175368{col 68}{space 3} 16.37649
{txt}{space 8}lag10 {c |}{col 15}{res}{space 2}  .479303{col 27}{space 2} 3.997754{col 38}{space 1}    0.12{col 47}{space 3}0.910{col 55}{space 4}-10.62024{col 68}{space 3} 11.57885
{txt}{space 8}lag11 {c |}{col 15}{res}{space 2}-.6588043{col 27}{space 2}  2.79945{col 38}{space 1}   -0.24{col 47}{space 3}0.826{col 55}{space 4}-8.431324{col 68}{space 3} 7.113716
{txt}{space 8}lag12 {c |}{col 15}{res}{space 2} 1.099586{col 27}{space 2} 4.452562{col 38}{space 1}    0.25{col 47}{space 3}0.817{col 55}{space 4}-11.26271{col 68}{space 3} 13.46188
{txt}{space 8}lag13 {c |}{col 15}{res}{space 2} 1.757789{col 27}{space 2} 2.139026{col 38}{space 1}    0.82{col 47}{space 3}0.457{col 55}{space 4}-4.181101{col 68}{space 3} 7.696678
{txt}{space 8}lag14 {c |}{col 15}{res}{space 2} 1.350933{col 27}{space 2} 2.248244{col 38}{space 1}    0.60{col 47}{space 3}0.580{col 55}{space 4}-4.891193{col 68}{space 3}  7.59306
{txt}{space 8}lag15 {c |}{col 15}{res}{space 2} .6163002{col 27}{space 2} 3.145266{col 38}{space 1}    0.20{col 47}{space 3}0.854{col 55}{space 4}-8.116359{col 68}{space 3} 9.348959
{txt}{space 8}lag16 {c |}{col 15}{res}{space 2} 3.120127{col 27}{space 2} 1.109219{col 38}{space 1}    2.81{col 47}{space 3}0.048{col 55}{space 4} .0404431{col 68}{space 3} 6.199812
{txt}{space 8}lag17 {c |}{col 15}{res}{space 2}  6.30349{col 27}{space 2}  1.59156{col 38}{space 1}    3.96{col 47}{space 3}0.017{col 55}{space 4} 1.884611{col 68}{space 3} 10.72237
{txt}{space 8}lag18 {c |}{col 15}{res}{space 2}-1.110018{col 27}{space 2} 2.142633{col 38}{space 1}   -0.52{col 47}{space 3}0.632{col 55}{space 4}-7.058921{col 68}{space 3} 4.838886
{txt}{space 8}lag19 {c |}{col 15}{res}{space 2}-3.564573{col 27}{space 2}  2.19613{col 38}{space 1}   -1.62{col 47}{space 3}0.180{col 55}{space 4}-9.662008{col 68}{space 3} 2.532862
{txt}{space 8}lag20 {c |}{col 15}{res}{space 2} 1.406131{col 27}{space 2} 1.819203{col 38}{space 1}    0.77{col 47}{space 3}0.483{col 55}{space 4}-3.644787{col 68}{space 3} 6.457049
{txt}{space 8}lag21 {c |}{col 15}{res}{space 2} .3392952{col 27}{space 2} 5.272077{col 38}{space 1}    0.06{col 47}{space 3}0.952{col 55}{space 4}-14.29834{col 68}{space 3} 14.97693
{txt}{space 8}lag22 {c |}{col 15}{res}{space 2}-.0162735{col 27}{space 2} 2.713743{col 38}{space 1}   -0.01{col 47}{space 3}0.996{col 55}{space 4}-7.550832{col 68}{space 3} 7.518285
{txt}{space 8}lag23 {c |}{col 15}{res}{space 2}-.2218457{col 27}{space 2}  1.27222{col 38}{space 1}   -0.17{col 47}{space 3}0.870{col 55}{space 4}-3.754095{col 68}{space 3} 3.310404
{txt}{space 8}lag24 {c |}{col 15}{res}{space 2} .2649694{col 27}{space 2} 2.647213{col 38}{space 1}    0.10{col 47}{space 3}0.925{col 55}{space 4}-7.084872{col 68}{space 3} 7.614811
{txt}{space 8}lag25 {c |}{col 15}{res}{space 2}-1.667972{col 27}{space 2} 3.607874{col 38}{space 1}   -0.46{col 47}{space 3}0.668{col 55}{space 4}-11.68504{col 68}{space 3} 8.349094
{txt}{space 8}lag26 {c |}{col 15}{res}{space 2}-1.673619{col 27}{space 2} 2.852721{col 38}{space 1}   -0.59{col 47}{space 3}0.589{col 55}{space 4}-9.594041{col 68}{space 3} 6.246803
{txt}{space 8}lag27 {c |}{col 15}{res}{space 2}-3.312551{col 27}{space 2}  4.14577{col 38}{space 1}   -0.80{col 47}{space 3}0.469{col 55}{space 4}-14.82305{col 68}{space 3} 8.197951
{txt}{space 8}lag28 {c |}{col 15}{res}{space 2} .7992773{col 27}{space 2}  4.74846{col 38}{space 1}    0.17{col 47}{space 3}0.874{col 55}{space 4}-12.38456{col 68}{space 3} 13.98312
{txt}{space 8}lag29 {c |}{col 15}{res}{space 2} 2.075475{col 27}{space 2} 4.389678{col 38}{space 1}    0.47{col 47}{space 3}0.661{col 55}{space 4}-10.11222{col 68}{space 3} 14.26317
{txt}{space 8}lag30 {c |}{col 15}{res}{space 2}-3.684568{col 27}{space 2} 4.936599{col 38}{space 1}   -0.75{col 47}{space 3}0.497{col 55}{space 4}-17.39076{col 68}{space 3} 10.02163
{txt}{space 8}lag31 {c |}{col 15}{res}{space 2}-4.345569{col 27}{space 2} .5542007{col 38}{space 1}   -7.84{col 47}{space 3}0.001{col 55}{space 4}-5.884277{col 68}{space 3}-2.806861
{txt}{space 8}lag32 {c |}{col 15}{res}{space 2}-1.292477{col 27}{space 2} 2.821233{col 38}{space 1}   -0.46{col 47}{space 3}0.671{col 55}{space 4}-9.125475{col 68}{space 3} 6.540522
{txt}{space 8}lag33 {c |}{col 15}{res}{space 2}-4.562253{col 27}{space 2} 3.472383{col 38}{space 1}   -1.31{col 47}{space 3}0.259{col 55}{space 4}-14.20313{col 68}{space 3} 5.078627
{txt}{space 8}lag34 {c |}{col 15}{res}{space 2}-7.569227{col 27}{space 2} 2.294013{col 38}{space 1}   -3.30{col 47}{space 3}0.030{col 55}{space 4}-13.93843{col 68}{space 3}-1.200026
{txt}{space 8}lag35 {c |}{col 15}{res}{space 2}-5.074348{col 27}{space 2} 3.043191{col 38}{space 1}   -1.67{col 47}{space 3}0.171{col 55}{space 4} -13.5236{col 68}{space 3} 3.374906
{txt}{space 8}lag36 {c |}{col 15}{res}{space 2} -.578353{col 27}{space 2} 1.973656{col 38}{space 1}   -0.29{col 47}{space 3}0.784{col 55}{space 4}-6.058101{col 68}{space 3} 4.901395
{txt}{space 8}lag37 {c |}{col 15}{res}{space 2} 4.560682{col 27}{space 2} 4.017489{col 38}{space 1}    1.14{col 47}{space 3}0.320{col 55}{space 4}-6.593656{col 68}{space 3} 15.71502
{txt}{space 8}lag38 {c |}{col 15}{res}{space 2}-3.980028{col 27}{space 2} 2.725363{col 38}{space 1}   -1.46{col 47}{space 3}0.218{col 55}{space 4}-11.54685{col 68}{space 3} 3.586792
{txt}{space 8}lag39 {c |}{col 15}{res}{space 2}-5.360706{col 27}{space 2} 3.157911{col 38}{space 1}   -1.70{col 47}{space 3}0.165{col 55}{space 4}-14.12847{col 68}{space 3} 3.407062
{txt}{space 8}lag40 {c |}{col 15}{res}{space 2}-4.916281{col 27}{space 2} 5.885207{col 38}{space 1}   -0.84{col 47}{space 3}0.451{col 55}{space 4}-21.25624{col 68}{space 3} 11.42367
{txt}{space 8}lag41 {c |}{col 15}{res}{space 2}-3.869213{col 27}{space 2}  5.91703{col 38}{space 1}   -0.65{col 47}{space 3}0.549{col 55}{space 4}-20.29752{col 68}{space 3}  12.5591
{txt}{space 8}lag42 {c |}{col 15}{res}{space 2}-1.632889{col 27}{space 2} 6.725334{col 38}{space 1}   -0.24{col 47}{space 3}0.820{col 55}{space 4}-20.30541{col 68}{space 3} 17.03963
{txt}{space 8}lag43 {c |}{col 15}{res}{space 2}-8.192276{col 27}{space 2} 3.189095{col 38}{space 1}   -2.57{col 47}{space 3}0.062{col 55}{space 4}-17.04662{col 68}{space 3}   .66207
{txt}{space 8}lag44 {c |}{col 15}{res}{space 2}-5.106529{col 27}{space 2} 3.627287{col 38}{space 1}   -1.41{col 47}{space 3}0.232{col 55}{space 4}-15.17749{col 68}{space 3} 4.964434
{txt}{space 8}lag45 {c |}{col 15}{res}{space 2} -1.26252{col 27}{space 2} 4.585717{col 38}{space 1}   -0.28{col 47}{space 3}0.797{col 55}{space 4}-13.99451{col 68}{space 3} 11.46947
{txt}{space 8}lag46 {c |}{col 15}{res}{space 2}-1.974848{col 27}{space 2} 3.019152{col 38}{space 1}   -0.65{col 47}{space 3}0.549{col 55}{space 4}-10.35736{col 68}{space 3} 6.407662
{txt}{space 8}lag47 {c |}{col 15}{res}{space 2}  .813041{col 27}{space 2}  4.60398{col 38}{space 1}    0.18{col 47}{space 3}0.868{col 55}{space 4}-11.96966{col 68}{space 3} 13.59574
{txt}{space 8}lag48 {c |}{col 15}{res}{space 2} -5.97014{col 27}{space 2} 6.256628{col 38}{space 1}   -0.95{col 47}{space 3}0.394{col 55}{space 4}-23.34132{col 68}{space 3} 11.40104
{txt}{space 8}lag49 {c |}{col 15}{res}{space 2}-9.736685{col 27}{space 2} 3.540981{col 38}{space 1}   -2.75{col 47}{space 3}0.051{col 55}{space 4}-19.56802{col 68}{space 3} .0946539
{txt}{space 8}lag50 {c |}{col 15}{res}{space 2}-9.867657{col 27}{space 2} 3.668141{col 38}{space 1}   -2.69{col 47}{space 3}0.055{col 55}{space 4}-20.05205{col 68}{space 3} .3167336
{txt}{space 8}lag51 {c |}{col 15}{res}{space 2}-4.954598{col 27}{space 2} 3.828445{col 38}{space 1}   -1.29{col 47}{space 3}0.265{col 55}{space 4}-15.58406{col 68}{space 3} 5.674869
{txt}{space 8}lag52 {c |}{col 15}{res}{space 2}-2.251559{col 27}{space 2} 4.176612{col 38}{space 1}   -0.54{col 47}{space 3}0.618{col 55}{space 4}-13.84769{col 68}{space 3} 9.344575
{txt}{space 8}lag53 {c |}{col 15}{res}{space 2}-8.301326{col 27}{space 2} 5.489214{col 38}{space 1}   -1.51{col 47}{space 3}0.205{col 55}{space 4}-23.54183{col 68}{space 3} 6.939175
{txt}{space 8}lag54 {c |}{col 15}{res}{space 2}-3.019013{col 27}{space 2}  2.88329{col 38}{space 1}   -1.05{col 47}{space 3}0.354{col 55}{space 4}-11.02431{col 68}{space 3} 4.986285
{txt}{space 8}lag55 {c |}{col 15}{res}{space 2}-7.967375{col 27}{space 2} 5.061424{col 38}{space 1}   -1.57{col 47}{space 3}0.191{col 55}{space 4}-22.02014{col 68}{space 3} 6.085391
{txt}{space 8}lag56 {c |}{col 15}{res}{space 2}-.5117877{col 27}{space 2} 1.860471{col 38}{space 1}   -0.28{col 47}{space 3}0.797{col 55}{space 4}-5.677282{col 68}{space 3} 4.653707
{txt}{space 8}lag57 {c |}{col 15}{res}{space 2}-3.279465{col 27}{space 2} 4.347284{col 38}{space 1}   -0.75{col 47}{space 3}0.493{col 55}{space 4}-15.34946{col 68}{space 3} 8.790531
{txt}{space 8}lag58 {c |}{col 15}{res}{space 2} -5.14598{col 27}{space 2} 2.919935{col 38}{space 1}   -1.76{col 47}{space 3}0.153{col 55}{space 4}-13.25302{col 68}{space 3}  2.96106
{txt}{space 8}lag59 {c |}{col 15}{res}{space 2}-2.906984{col 27}{space 2} 3.249598{col 38}{space 1}   -0.89{col 47}{space 3}0.422{col 55}{space 4}-11.92932{col 68}{space 3} 6.115347
{txt}{space 8}lag60 {c |}{col 15}{res}{space 2}-2.992874{col 27}{space 2} 4.372309{col 38}{space 1}   -0.68{col 47}{space 3}0.531{col 55}{space 4}-15.13235{col 68}{space 3} 9.146601
{txt}{space 8}lag61 {c |}{col 15}{res}{space 2}-5.508687{col 27}{space 2} 6.848408{col 38}{space 1}   -0.80{col 47}{space 3}0.466{col 55}{space 4}-24.52292{col 68}{space 3} 13.50554
{txt}{space 8}lag62 {c |}{col 15}{res}{space 2}-5.504052{col 27}{space 2} 5.716207{col 38}{space 1}   -0.96{col 47}{space 3}0.390{col 55}{space 4}-21.37479{col 68}{space 3} 10.36668
{txt}{space 8}lag63 {c |}{col 15}{res}{space 2}-8.666448{col 27}{space 2} 7.531166{col 38}{space 1}   -1.15{col 47}{space 3}0.314{col 55}{space 4}-29.57632{col 68}{space 3} 12.24342
{txt}{space 8}lag64 {c |}{col 15}{res}{space 2} -9.43466{col 27}{space 2} 3.805396{col 38}{space 1}   -2.48{col 47}{space 3}0.068{col 55}{space 4}-20.00013{col 68}{space 3} 1.130812
{txt}{space 8}lag65 {c |}{col 15}{res}{space 2}-16.30333{col 27}{space 2} 5.602972{col 38}{space 1}   -2.91{col 47}{space 3}0.044{col 55}{space 4}-31.85967{col 68}{space 3}-.7469822
{txt}{space 8}lag66 {c |}{col 15}{res}{space 2}-2.205925{col 27}{space 2} 4.964461{col 38}{space 1}   -0.44{col 47}{space 3}0.680{col 55}{space 4}-15.98948{col 68}{space 3} 11.57763
{txt}{space 8}lag67 {c |}{col 15}{res}{space 2}-.0927322{col 27}{space 2} 8.081405{col 38}{space 1}   -0.01{col 47}{space 3}0.991{col 55}{space 4}-22.53031{col 68}{space 3} 22.34484
{txt}{space 8}lag68 {c |}{col 15}{res}{space 2}-.9179865{col 27}{space 2} 6.887198{col 38}{space 1}   -0.13{col 47}{space 3}0.900{col 55}{space 4}-20.03991{col 68}{space 3} 18.20394
{txt}{space 8}lag69 {c |}{col 15}{res}{space 2}-8.692759{col 27}{space 2}  3.36917{col 38}{space 1}   -2.58{col 47}{space 3}0.061{col 55}{space 4}-18.04707{col 68}{space 3} .6615556
{txt}{space 8}lag70 {c |}{col 15}{res}{space 2}-7.131389{col 27}{space 2} 4.139199{col 38}{space 1}   -1.72{col 47}{space 3}0.160{col 55}{space 4}-18.62365{col 68}{space 3}  4.36087
{txt}{space 8}lag71 {c |}{col 15}{res}{space 2}-10.06255{col 27}{space 2} 3.977318{col 38}{space 1}   -2.53{col 47}{space 3}0.065{col 55}{space 4}-21.10536{col 68}{space 3} .9802519
{txt}{space 8}lag72 {c |}{col 15}{res}{space 2}-5.603884{col 27}{space 2} 5.144133{col 38}{space 1}   -1.09{col 47}{space 3}0.337{col 55}{space 4}-19.88629{col 68}{space 3} 8.678518
{txt}{space 8}lag73 {c |}{col 15}{res}{space 2}-3.740794{col 27}{space 2} 6.868364{col 38}{space 1}   -0.54{col 47}{space 3}0.615{col 55}{space 4}-22.81043{col 68}{space 3} 15.32884
{txt}{space 8}lag74 {c |}{col 15}{res}{space 2} -5.48001{col 27}{space 2} 6.700666{col 38}{space 1}   -0.82{col 47}{space 3}0.459{col 55}{space 4}-24.08404{col 68}{space 3} 13.12402
{txt}{space 8}lag75 {c |}{col 15}{res}{space 2}-3.761681{col 27}{space 2} 7.629631{col 38}{space 1}   -0.49{col 47}{space 3}0.648{col 55}{space 4}-24.94493{col 68}{space 3} 17.42157
{txt}{space 8}lag76 {c |}{col 15}{res}{space 2}-6.935726{col 27}{space 2} 4.609664{col 38}{space 1}   -1.50{col 47}{space 3}0.207{col 55}{space 4}-19.73421{col 68}{space 3} 5.862752
{txt}{space 8}lag77 {c |}{col 15}{res}{space 2} -11.8221{col 27}{space 2} 2.657889{col 38}{space 1}   -4.45{col 47}{space 3}0.011{col 55}{space 4}-19.20158{col 68}{space 3}-4.442614
{txt}{space 8}lag78 {c |}{col 15}{res}{space 2} -5.72095{col 27}{space 2} 6.958721{col 38}{space 1}   -0.82{col 47}{space 3}0.457{col 55}{space 4}-25.04146{col 68}{space 3} 13.59956
{txt}{space 8}lag79 {c |}{col 15}{res}{space 2}-5.040306{col 27}{space 2} 6.501125{col 38}{space 1}   -0.78{col 47}{space 3}0.481{col 55}{space 4}-23.09032{col 68}{space 3} 13.00971
{txt}{space 8}lag80 {c |}{col 15}{res}{space 2}-2.162217{col 27}{space 2}  7.05604{col 38}{space 1}   -0.31{col 47}{space 3}0.775{col 55}{space 4}-21.75292{col 68}{space 3} 17.42849
{txt}{space 8}lag81 {c |}{col 15}{res}{space 2} -3.15277{col 27}{space 2} 6.618339{col 38}{space 1}   -0.48{col 47}{space 3}0.659{col 55}{space 4}-21.52822{col 68}{space 3} 15.22268
{txt}{space 8}lag82 {c |}{col 15}{res}{space 2}-9.015134{col 27}{space 2} 4.864247{col 38}{space 1}   -1.85{col 47}{space 3}0.137{col 55}{space 4}-22.52045{col 68}{space 3} 4.490181
{txt}{space 8}lag83 {c |}{col 15}{res}{space 2} 1.817285{col 27}{space 2}  4.68618{col 38}{space 1}    0.39{col 47}{space 3}0.718{col 55}{space 4}-11.19364{col 68}{space 3} 14.82821
{txt}{space 8}lag84 {c |}{col 15}{res}{space 2}-1.909174{col 27}{space 2} 3.126763{col 38}{space 1}   -0.61{col 47}{space 3}0.574{col 55}{space 4}-10.59046{col 68}{space 3} 6.772113
{txt}{space 8}lag85 {c |}{col 15}{res}{space 2}-6.828625{col 27}{space 2} 5.160139{col 38}{space 1}   -1.32{col 47}{space 3}0.256{col 55}{space 4}-21.15547{col 68}{space 3} 7.498217
{txt}{space 8}lag86 {c |}{col 15}{res}{space 2}-9.432607{col 27}{space 2} 4.482401{col 38}{space 1}   -2.10{col 47}{space 3}0.103{col 55}{space 4}-21.87775{col 68}{space 3} 3.012533
{txt}{space 8}lag87 {c |}{col 15}{res}{space 2}-7.438507{col 27}{space 2} 6.511391{col 38}{space 1}   -1.14{col 47}{space 3}0.317{col 55}{space 4}-25.51703{col 68}{space 3} 10.64001
{txt}{space 8}lag88 {c |}{col 15}{res}{space 2}-8.467825{col 27}{space 2} 5.758083{col 38}{space 1}   -1.47{col 47}{space 3}0.215{col 55}{space 4}-24.45483{col 68}{space 3} 7.519176
{txt}{space 8}lag89 {c |}{col 15}{res}{space 2} .0702058{col 27}{space 2} 6.274974{col 38}{space 1}    0.01{col 47}{space 3}0.992{col 55}{space 4}-17.35192{col 68}{space 3} 17.49233
{txt}{space 8}lag90 {c |}{col 15}{res}{space 2}-7.090405{col 27}{space 2} 4.301139{col 38}{space 1}   -1.65{col 47}{space 3}0.175{col 55}{space 4}-19.03228{col 68}{space 3} 4.851472
{txt}{space 8}lag91 {c |}{col 15}{res}{space 2}-8.807683{col 27}{space 2} 5.170172{col 38}{space 1}   -1.70{col 47}{space 3}0.164{col 55}{space 4}-23.16238{col 68}{space 3} 5.547017
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}-124.4268{col 27}{space 2} 23.38174{col 38}{space 1}   -5.32{col 47}{space 3}0.006{col 55}{space 4} -189.345{col 68}{space 3}-59.50874
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}   regionid1{col 14}{c |}{space 1}        5{col 27}{space 1}        5{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}        date{col 14}{c |}{space 1}     5267{col 27}{space 1}        1{col 39}{result}{space 1}     5266{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. graph export "results/EventStudy-MiddayCo2.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/simonpostler/Desktop/applied-econometrics-dst-master-2/results/EventStudy-MiddayCo2.png{rm}
saved as
PNG
format
{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/6h/778gphg5533gk87_wkb11wqh0000gn/T//SD01922.000000"
{txt}
{com}. eventdd energy_wh_per_capita_vs_midday public_holiday c.temperature##c.temperature solar_exposure wind_3  [aweight = population], timevar(timevar) method(hdfe, absorb(regionid1 date) cluster(regionid1)) graph_op(ytitle("Wh energy p.c.") xtitle("Days until DST transition") title("Event Study - Energy - Midday Normalised"))
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}{txt}warning: missing F statistic; dropped variables due to collinearity or too few clusters
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,264,072
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F( 190,      4)}{col 67}=          {res}.
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.1924
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1889
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0114
{txt}{col 1}Number of clusters ({res}regionid1{txt}) {col 30}= {res}         5{txt}{col 51}Root MSE{col 67}= {res}   70.1105

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}energy_wh_p~y{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
public_holi~y {c |}{col 15}{res}{space 2}  8.35447{col 27}{space 2} 2.663807{col 38}{space 1}    3.14{col 47}{space 3}0.035{col 55}{space 4} .9585561{col 68}{space 3} 15.75038
{txt}{space 2}temperature {c |}{col 15}{res}{space 2} 9.982929{col 27}{space 2} 1.751507{col 38}{space 1}    5.70{col 47}{space 3}0.005{col 55}{space 4} 5.119965{col 68}{space 3} 14.84589
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2}-.2045381{col 27}{space 2}  .031303{col 38}{space 1}   -6.53{col 47}{space 3}0.003{col 55}{space 4}-.2914491{col 68}{space 3} -.117627
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2} 2.517127{col 27}{space 2} .5550369{col 38}{space 1}    4.54{col 47}{space 3}0.011{col 55}{space 4} .9760975{col 68}{space 3} 4.058156
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2}-1.708077{col 27}{space 2} 1.037992{col 38}{space 1}   -1.65{col 47}{space 3}0.175{col 55}{space 4}-4.590005{col 68}{space 3}  1.17385
{txt}{space 7}lead94 {c |}{col 15}{res}{space 2} 1.284858{col 27}{space 2} 13.50084{col 38}{space 1}    0.10{col 47}{space 3}0.929{col 55}{space 4}-36.19949{col 68}{space 3}  38.7692
{txt}{space 7}lead93 {c |}{col 15}{res}{space 2}-6.841159{col 27}{space 2} 3.380559{col 38}{space 1}   -2.02{col 47}{space 3}0.113{col 55}{space 4}-16.22709{col 68}{space 3} 2.544777
{txt}{space 7}lead92 {c |}{col 15}{res}{space 2} 8.361134{col 27}{space 2} 4.391083{col 38}{space 1}    1.90{col 47}{space 3}0.130{col 55}{space 4}-3.830468{col 68}{space 3} 20.55274
{txt}{space 7}lead91 {c |}{col 15}{res}{space 2} 10.17357{col 27}{space 2} 9.727654{col 38}{space 1}    1.05{col 47}{space 3}0.355{col 55}{space 4}-16.83472{col 68}{space 3} 37.18187
{txt}{space 7}lead90 {c |}{col 15}{res}{space 2} 6.106224{col 27}{space 2} 6.626524{col 38}{space 1}    0.92{col 47}{space 3}0.409{col 55}{space 4}-12.29196{col 68}{space 3}  24.5044
{txt}{space 7}lead89 {c |}{col 15}{res}{space 2} 3.587813{col 27}{space 2} 7.402652{col 38}{space 1}    0.48{col 47}{space 3}0.653{col 55}{space 4}-16.96524{col 68}{space 3} 24.14087
{txt}{space 7}lead88 {c |}{col 15}{res}{space 2} 9.872006{col 27}{space 2} 5.204219{col 38}{space 1}    1.90{col 47}{space 3}0.131{col 55}{space 4}-4.577222{col 68}{space 3} 24.32123
{txt}{space 7}lead87 {c |}{col 15}{res}{space 2} 5.751873{col 27}{space 2}  6.76248{col 38}{space 1}    0.85{col 47}{space 3}0.443{col 55}{space 4}-13.02378{col 68}{space 3} 24.52753
{txt}{space 7}lead86 {c |}{col 15}{res}{space 2} 1.384039{col 27}{space 2} 6.313046{col 38}{space 1}    0.22{col 47}{space 3}0.837{col 55}{space 4}-16.14379{col 68}{space 3} 18.91186
{txt}{space 7}lead85 {c |}{col 15}{res}{space 2}-.2164676{col 27}{space 2} 8.590642{col 38}{space 1}   -0.03{col 47}{space 3}0.981{col 55}{space 4}-24.06791{col 68}{space 3} 23.63498
{txt}{space 7}lead84 {c |}{col 15}{res}{space 2} 10.01255{col 27}{space 2} 9.235552{col 38}{space 1}    1.08{col 47}{space 3}0.339{col 55}{space 4}-15.62945{col 68}{space 3} 35.65456
{txt}{space 7}lead83 {c |}{col 15}{res}{space 2}  .666111{col 27}{space 2} 6.734819{col 38}{space 1}    0.10{col 47}{space 3}0.926{col 55}{space 4}-18.03275{col 68}{space 3} 19.36497
{txt}{space 7}lead82 {c |}{col 15}{res}{space 2}-1.166491{col 27}{space 2} 5.917488{col 38}{space 1}   -0.20{col 47}{space 3}0.853{col 55}{space 4}-17.59607{col 68}{space 3} 15.26309
{txt}{space 7}lead81 {c |}{col 15}{res}{space 2}-4.403217{col 27}{space 2} 5.218837{col 38}{space 1}   -0.84{col 47}{space 3}0.446{col 55}{space 4}-18.89303{col 68}{space 3}  10.0866
{txt}{space 7}lead80 {c |}{col 15}{res}{space 2}-8.219203{col 27}{space 2} 6.448386{col 38}{space 1}   -1.27{col 47}{space 3}0.271{col 55}{space 4}-26.12279{col 68}{space 3} 9.684387
{txt}{space 7}lead79 {c |}{col 15}{res}{space 2}-1.589805{col 27}{space 2} 6.341016{col 38}{space 1}   -0.25{col 47}{space 3}0.814{col 55}{space 4}-19.19529{col 68}{space 3} 16.01568
{txt}{space 7}lead78 {c |}{col 15}{res}{space 2} .3159384{col 27}{space 2} 6.940838{col 38}{space 1}    0.05{col 47}{space 3}0.966{col 55}{space 4}-18.95492{col 68}{space 3} 19.58679
{txt}{space 7}lead77 {c |}{col 15}{res}{space 2}  9.40355{col 27}{space 2}  5.15755{col 38}{space 1}    1.82{col 47}{space 3}0.142{col 55}{space 4}-4.916105{col 68}{space 3} 23.72321
{txt}{space 7}lead76 {c |}{col 15}{res}{space 2} 1.362072{col 27}{space 2}  6.15949{col 38}{space 1}    0.22{col 47}{space 3}0.836{col 55}{space 4}-15.73941{col 68}{space 3} 18.46356
{txt}{space 7}lead75 {c |}{col 15}{res}{space 2}  1.62379{col 27}{space 2} 8.930508{col 38}{space 1}    0.18{col 47}{space 3}0.865{col 55}{space 4}-23.17127{col 68}{space 3} 26.41885
{txt}{space 7}lead74 {c |}{col 15}{res}{space 2} 1.815947{col 27}{space 2}  8.85357{col 38}{space 1}    0.21{col 47}{space 3}0.848{col 55}{space 4} -22.7655{col 68}{space 3}  26.3974
{txt}{space 7}lead73 {c |}{col 15}{res}{space 2} 2.530889{col 27}{space 2} 6.976121{col 38}{space 1}    0.36{col 47}{space 3}0.735{col 55}{space 4}-16.83793{col 68}{space 3} 21.89971
{txt}{space 7}lead72 {c |}{col 15}{res}{space 2} 7.539144{col 27}{space 2} 7.398965{col 38}{space 1}    1.02{col 47}{space 3}0.366{col 55}{space 4}-13.00368{col 68}{space 3} 28.08197
{txt}{space 7}lead71 {c |}{col 15}{res}{space 2} 8.395084{col 27}{space 2} 5.949459{col 38}{space 1}    1.41{col 47}{space 3}0.231{col 55}{space 4}-8.123262{col 68}{space 3} 24.91343
{txt}{space 7}lead70 {c |}{col 15}{res}{space 2} 10.21737{col 27}{space 2} 6.231469{col 38}{space 1}    1.64{col 47}{space 3}0.176{col 55}{space 4}-7.083966{col 68}{space 3}  27.5187
{txt}{space 7}lead69 {c |}{col 15}{res}{space 2}  4.85061{col 27}{space 2} 8.460943{col 38}{space 1}    0.57{col 47}{space 3}0.597{col 55}{space 4}-18.64073{col 68}{space 3} 28.34196
{txt}{space 7}lead68 {c |}{col 15}{res}{space 2}-1.086474{col 27}{space 2} 8.640436{col 38}{space 1}   -0.13{col 47}{space 3}0.906{col 55}{space 4}-25.07617{col 68}{space 3} 22.90322
{txt}{space 7}lead67 {c |}{col 15}{res}{space 2}-.9598349{col 27}{space 2} 9.241739{col 38}{space 1}   -0.10{col 47}{space 3}0.922{col 55}{space 4}-26.61902{col 68}{space 3} 24.69935
{txt}{space 7}lead66 {c |}{col 15}{res}{space 2} .2408447{col 27}{space 2} 8.514103{col 38}{space 1}    0.03{col 47}{space 3}0.979{col 55}{space 4}-23.39809{col 68}{space 3} 23.87978
{txt}{space 7}lead65 {c |}{col 15}{res}{space 2}-.5205515{col 27}{space 2} 8.687413{col 38}{space 1}   -0.06{col 47}{space 3}0.955{col 55}{space 4}-24.64068{col 68}{space 3} 23.59957
{txt}{space 7}lead64 {c |}{col 15}{res}{space 2} 4.160528{col 27}{space 2} 5.918551{col 38}{space 1}    0.70{col 47}{space 3}0.521{col 55}{space 4}  -12.272{col 68}{space 3} 20.59306
{txt}{space 7}lead63 {c |}{col 15}{res}{space 2} 9.644507{col 27}{space 2} 5.995481{col 38}{space 1}    1.61{col 47}{space 3}0.183{col 55}{space 4}-7.001616{col 68}{space 3} 26.29063
{txt}{space 7}lead62 {c |}{col 15}{res}{space 2} 5.446501{col 27}{space 2} 3.384233{col 38}{space 1}    1.61{col 47}{space 3}0.183{col 55}{space 4}-3.949637{col 68}{space 3} 14.84264
{txt}{space 7}lead61 {c |}{col 15}{res}{space 2} 7.476397{col 27}{space 2} 5.570746{col 38}{space 1}    1.34{col 47}{space 3}0.251{col 55}{space 4}-7.990473{col 68}{space 3} 22.94327
{txt}{space 7}lead60 {c |}{col 15}{res}{space 2} 7.117448{col 27}{space 2} 6.856483{col 38}{space 1}    1.04{col 47}{space 3}0.358{col 55}{space 4} -11.9192{col 68}{space 3}  26.1541
{txt}{space 7}lead59 {c |}{col 15}{res}{space 2} 3.255312{col 27}{space 2} 7.734903{col 38}{space 1}    0.42{col 47}{space 3}0.695{col 55}{space 4}-18.22022{col 68}{space 3} 24.73085
{txt}{space 7}lead58 {c |}{col 15}{res}{space 2} 1.963985{col 27}{space 2} 9.583024{col 38}{space 1}    0.20{col 47}{space 3}0.848{col 55}{space 4}-24.64275{col 68}{space 3} 28.57072
{txt}{space 7}lead57 {c |}{col 15}{res}{space 2} .6917633{col 27}{space 2} 7.330868{col 38}{space 1}    0.09{col 47}{space 3}0.929{col 55}{space 4}-19.66199{col 68}{space 3} 21.04552
{txt}{space 7}lead56 {c |}{col 15}{res}{space 2} 9.137963{col 27}{space 2} 5.879765{col 38}{space 1}    1.55{col 47}{space 3}0.195{col 55}{space 4}-7.186881{col 68}{space 3} 25.46281
{txt}{space 7}lead55 {c |}{col 15}{res}{space 2} 7.453821{col 27}{space 2} 5.831293{col 38}{space 1}    1.28{col 47}{space 3}0.270{col 55}{space 4}-8.736443{col 68}{space 3} 23.64409
{txt}{space 7}lead54 {c |}{col 15}{res}{space 2} 5.498294{col 27}{space 2} 6.418722{col 38}{space 1}    0.86{col 47}{space 3}0.440{col 55}{space 4}-12.32294{col 68}{space 3} 23.31952
{txt}{space 7}lead53 {c |}{col 15}{res}{space 2}  .888771{col 27}{space 2} 6.734706{col 38}{space 1}    0.13{col 47}{space 3}0.901{col 55}{space 4}-17.80977{col 68}{space 3} 19.58731
{txt}{space 7}lead52 {c |}{col 15}{res}{space 2}-.3179437{col 27}{space 2} 8.339671{col 38}{space 1}   -0.04{col 47}{space 3}0.971{col 55}{space 4}-23.47258{col 68}{space 3}  22.8367
{txt}{space 7}lead51 {c |}{col 15}{res}{space 2}-5.429361{col 27}{space 2} 7.229406{col 38}{space 1}   -0.75{col 47}{space 3}0.494{col 55}{space 4}-25.50141{col 68}{space 3} 14.64269
{txt}{space 7}lead50 {c |}{col 15}{res}{space 2} 3.035222{col 27}{space 2} 4.235864{col 38}{space 1}    0.72{col 47}{space 3}0.513{col 55}{space 4}-8.725421{col 68}{space 3} 14.79586
{txt}{space 7}lead49 {c |}{col 15}{res}{space 2}-1.536825{col 27}{space 2}  3.86788{col 38}{space 1}   -0.40{col 47}{space 3}0.711{col 55}{space 4}-12.27578{col 68}{space 3} 9.202131
{txt}{space 7}lead48 {c |}{col 15}{res}{space 2}-3.962172{col 27}{space 2} 3.719771{col 38}{space 1}   -1.07{col 47}{space 3}0.347{col 55}{space 4}-14.28991{col 68}{space 3} 6.365568
{txt}{space 7}lead47 {c |}{col 15}{res}{space 2}-5.478902{col 27}{space 2} 4.802159{col 38}{space 1}   -1.14{col 47}{space 3}0.318{col 55}{space 4}-18.81183{col 68}{space 3} 7.854029
{txt}{space 7}lead46 {c |}{col 15}{res}{space 2} 3.909318{col 27}{space 2} 6.887243{col 38}{space 1}    0.57{col 47}{space 3}0.601{col 55}{space 4}-15.21273{col 68}{space 3} 23.03137
{txt}{space 7}lead45 {c |}{col 15}{res}{space 2} 2.117532{col 27}{space 2} 4.468331{col 38}{space 1}    0.47{col 47}{space 3}0.660{col 55}{space 4}-10.28854{col 68}{space 3} 14.52361
{txt}{space 7}lead44 {c |}{col 15}{res}{space 2}-1.960488{col 27}{space 2} 5.851402{col 38}{space 1}   -0.34{col 47}{space 3}0.754{col 55}{space 4}-18.20658{col 68}{space 3} 14.28561
{txt}{space 7}lead43 {c |}{col 15}{res}{space 2}-1.742145{col 27}{space 2} 4.785348{col 38}{space 1}   -0.36{col 47}{space 3}0.734{col 55}{space 4} -15.0284{col 68}{space 3} 11.54411
{txt}{space 7}lead42 {c |}{col 15}{res}{space 2} 5.062515{col 27}{space 2}  1.97533{col 38}{space 1}    2.56{col 47}{space 3}0.062{col 55}{space 4} -.421879{col 68}{space 3} 10.54691
{txt}{space 7}lead41 {c |}{col 15}{res}{space 2} 3.800851{col 27}{space 2} 2.574953{col 38}{space 1}    1.48{col 47}{space 3}0.214{col 55}{space 4}-3.348366{col 68}{space 3} 10.95007
{txt}{space 7}lead40 {c |}{col 15}{res}{space 2} 2.366128{col 27}{space 2} 4.369261{col 38}{space 1}    0.54{col 47}{space 3}0.617{col 55}{space 4}-9.764886{col 68}{space 3} 14.49714
{txt}{space 7}lead39 {c |}{col 15}{res}{space 2}-2.057758{col 27}{space 2} 6.634815{col 38}{space 1}   -0.31{col 47}{space 3}0.772{col 55}{space 4}-20.47896{col 68}{space 3} 16.36344
{txt}{space 7}lead38 {c |}{col 15}{res}{space 2} 4.031421{col 27}{space 2} 5.483881{col 38}{space 1}    0.74{col 47}{space 3}0.503{col 55}{space 4}-11.19427{col 68}{space 3} 19.25712
{txt}{space 7}lead37 {c |}{col 15}{res}{space 2} 2.971122{col 27}{space 2} 4.428572{col 38}{space 1}    0.67{col 47}{space 3}0.539{col 55}{space 4}-9.324565{col 68}{space 3} 15.26681
{txt}{space 7}lead36 {c |}{col 15}{res}{space 2} 1.111651{col 27}{space 2} 3.324986{col 38}{space 1}    0.33{col 47}{space 3}0.755{col 55}{space 4} -8.11999{col 68}{space 3} 10.34329
{txt}{space 7}lead35 {c |}{col 15}{res}{space 2} 10.03495{col 27}{space 2} 5.131728{col 38}{space 1}    1.96{col 47}{space 3}0.122{col 55}{space 4}-4.213011{col 68}{space 3} 24.28291
{txt}{space 7}lead34 {c |}{col 15}{res}{space 2} 2.526038{col 27}{space 2} 5.588734{col 38}{space 1}    0.45{col 47}{space 3}0.675{col 55}{space 4}-12.99077{col 68}{space 3} 18.04285
{txt}{space 7}lead33 {c |}{col 15}{res}{space 2}-1.327581{col 27}{space 2} 5.687119{col 38}{space 1}   -0.23{col 47}{space 3}0.827{col 55}{space 4}-17.11756{col 68}{space 3} 14.46239
{txt}{space 7}lead32 {c |}{col 15}{res}{space 2} 2.998029{col 27}{space 2} 4.221714{col 38}{space 1}    0.71{col 47}{space 3}0.517{col 55}{space 4}-8.723329{col 68}{space 3} 14.71939
{txt}{space 7}lead31 {c |}{col 15}{res}{space 2} 1.769333{col 27}{space 2} 2.757392{col 38}{space 1}    0.64{col 47}{space 3}0.556{col 55}{space 4}-5.886414{col 68}{space 3}  9.42508
{txt}{space 7}lead30 {c |}{col 15}{res}{space 2} 2.150027{col 27}{space 2} 2.723594{col 38}{space 1}    0.79{col 47}{space 3}0.474{col 55}{space 4}-5.411881{col 68}{space 3} 9.711935
{txt}{space 7}lead29 {c |}{col 15}{res}{space 2} 6.215972{col 27}{space 2} 3.062668{col 38}{space 1}    2.03{col 47}{space 3}0.112{col 55}{space 4}-2.287358{col 68}{space 3}  14.7193
{txt}{space 7}lead28 {c |}{col 15}{res}{space 2} 8.134833{col 27}{space 2} 2.802285{col 38}{space 1}    2.90{col 47}{space 3}0.044{col 55}{space 4}  .354443{col 68}{space 3} 15.91522
{txt}{space 7}lead27 {c |}{col 15}{res}{space 2} 4.907503{col 27}{space 2} 2.858236{col 38}{space 1}    1.72{col 47}{space 3}0.161{col 55}{space 4}-3.028231{col 68}{space 3} 12.84324
{txt}{space 7}lead26 {c |}{col 15}{res}{space 2}-.7099089{col 27}{space 2}  4.70721{col 38}{space 1}   -0.15{col 47}{space 3}0.887{col 55}{space 4}-13.77922{col 68}{space 3}  12.3594
{txt}{space 7}lead25 {c |}{col 15}{res}{space 2} -1.68617{col 27}{space 2} 2.181198{col 38}{space 1}   -0.77{col 47}{space 3}0.483{col 55}{space 4}-7.742148{col 68}{space 3} 4.369807
{txt}{space 7}lead24 {c |}{col 15}{res}{space 2}-.3272707{col 27}{space 2} 3.383392{col 38}{space 1}   -0.10{col 47}{space 3}0.928{col 55}{space 4}-9.721074{col 68}{space 3} 9.066532
{txt}{space 7}lead23 {c |}{col 15}{res}{space 2} 2.005857{col 27}{space 2} 3.387174{col 38}{space 1}    0.59{col 47}{space 3}0.586{col 55}{space 4}-7.398445{col 68}{space 3} 11.41016
{txt}{space 7}lead22 {c |}{col 15}{res}{space 2}-1.597191{col 27}{space 2} 2.701395{col 38}{space 1}   -0.59{col 47}{space 3}0.586{col 55}{space 4}-9.097467{col 68}{space 3} 5.903085
{txt}{space 7}lead21 {c |}{col 15}{res}{space 2} 3.024043{col 27}{space 2} 2.393962{col 38}{space 1}    1.26{col 47}{space 3}0.275{col 55}{space 4}-3.622662{col 68}{space 3} 9.670749
{txt}{space 7}lead20 {c |}{col 15}{res}{space 2} 5.252745{col 27}{space 2} 3.058424{col 38}{space 1}    1.72{col 47}{space 3}0.161{col 55}{space 4}-3.238803{col 68}{space 3} 13.74429
{txt}{space 7}lead19 {c |}{col 15}{res}{space 2}-2.206061{col 27}{space 2} 1.217929{col 38}{space 1}   -1.81{col 47}{space 3}0.144{col 55}{space 4}-5.587574{col 68}{space 3} 1.175452
{txt}{space 7}lead18 {c |}{col 15}{res}{space 2} 2.137087{col 27}{space 2} 1.762079{col 38}{space 1}    1.21{col 47}{space 3}0.292{col 55}{space 4} -2.75523{col 68}{space 3} 7.029403
{txt}{space 7}lead17 {c |}{col 15}{res}{space 2}-.7241963{col 27}{space 2} 1.573283{col 38}{space 1}   -0.46{col 47}{space 3}0.669{col 55}{space 4}-5.092332{col 68}{space 3} 3.643939
{txt}{space 7}lead16 {c |}{col 15}{res}{space 2}-2.383515{col 27}{space 2} 3.628725{col 38}{space 1}   -0.66{col 47}{space 3}0.547{col 55}{space 4}-12.45847{col 68}{space 3}  7.69144
{txt}{space 7}lead15 {c |}{col 15}{res}{space 2} -3.80266{col 27}{space 2} 2.819341{col 38}{space 1}   -1.35{col 47}{space 3}0.249{col 55}{space 4} -11.6304{col 68}{space 3} 4.025084
{txt}{space 7}lead14 {c |}{col 15}{res}{space 2}-2.799588{col 27}{space 2}  2.26046{col 38}{space 1}   -1.24{col 47}{space 3}0.283{col 55}{space 4} -9.07563{col 68}{space 3} 3.476454
{txt}{space 7}lead13 {c |}{col 15}{res}{space 2}-.0318964{col 27}{space 2} 2.400417{col 38}{space 1}   -0.01{col 47}{space 3}0.990{col 55}{space 4}-6.696521{col 68}{space 3} 6.632728
{txt}{space 7}lead12 {c |}{col 15}{res}{space 2}-.3228524{col 27}{space 2} 1.718007{col 38}{space 1}   -0.19{col 47}{space 3}0.860{col 55}{space 4}-5.092805{col 68}{space 3}   4.4471
{txt}{space 7}lead11 {c |}{col 15}{res}{space 2}-2.582299{col 27}{space 2} 2.811293{col 38}{space 1}   -0.92{col 47}{space 3}0.410{col 55}{space 4} -10.3877{col 68}{space 3} 5.223101
{txt}{space 7}lead10 {c |}{col 15}{res}{space 2}-3.967191{col 27}{space 2} 1.938099{col 38}{space 1}   -2.05{col 47}{space 3}0.110{col 55}{space 4}-9.348218{col 68}{space 3} 1.413836
{txt}{space 8}lead9 {c |}{col 15}{res}{space 2}-1.153905{col 27}{space 2} 2.166668{col 38}{space 1}   -0.53{col 47}{space 3}0.623{col 55}{space 4} -7.16954{col 68}{space 3} 4.861731
{txt}{space 8}lead8 {c |}{col 15}{res}{space 2} 4.691107{col 27}{space 2} 2.360858{col 38}{space 1}    1.99{col 47}{space 3}0.118{col 55}{space 4}-1.863684{col 68}{space 3}  11.2459
{txt}{space 8}lead7 {c |}{col 15}{res}{space 2} 3.808275{col 27}{space 2} 1.296457{col 38}{space 1}    2.94{col 47}{space 3}0.042{col 55}{space 4} .2087325{col 68}{space 3} 7.407818
{txt}{space 8}lead6 {c |}{col 15}{res}{space 2}-3.905367{col 27}{space 2} 1.317232{col 38}{space 1}   -2.96{col 47}{space 3}0.041{col 55}{space 4} -7.56259{col 68}{space 3}-.2481441
{txt}{space 8}lead5 {c |}{col 15}{res}{space 2}-6.874519{col 27}{space 2} 2.778497{col 38}{space 1}   -2.47{col 47}{space 3}0.069{col 55}{space 4}-14.58886{col 68}{space 3} .8398256
{txt}{space 8}lead4 {c |}{col 15}{res}{space 2}-4.484394{col 27}{space 2} 2.167273{col 38}{space 1}   -2.07{col 47}{space 3}0.107{col 55}{space 4}-10.50171{col 68}{space 3}  1.53292
{txt}{space 8}lead3 {c |}{col 15}{res}{space 2}-3.941381{col 27}{space 2} 2.083017{col 38}{space 1}   -1.89{col 47}{space 3}0.131{col 55}{space 4}-9.724762{col 68}{space 3}    1.842
{txt}{space 8}lead2 {c |}{col 15}{res}{space 2} 1.648515{col 27}{space 2} .9793874{col 38}{space 1}    1.68{col 47}{space 3}0.168{col 55}{space 4}  -1.0707{col 68}{space 3}  4.36773
{txt}{space 9}lag0 {c |}{col 15}{res}{space 2} 1.809234{col 27}{space 2} 1.126816{col 38}{space 1}    1.61{col 47}{space 3}0.184{col 55}{space 4}-1.319309{col 68}{space 3} 4.937778
{txt}{space 9}lag1 {c |}{col 15}{res}{space 2}-1.771605{col 27}{space 2} 1.967314{col 38}{space 1}   -0.90{col 47}{space 3}0.419{col 55}{space 4}-7.233744{col 68}{space 3} 3.690535
{txt}{space 9}lag2 {c |}{col 15}{res}{space 2}-1.995545{col 27}{space 2} 2.084381{col 38}{space 1}   -0.96{col 47}{space 3}0.393{col 55}{space 4}-7.782716{col 68}{space 3} 3.791626
{txt}{space 9}lag3 {c |}{col 15}{res}{space 2}-.3698121{col 27}{space 2}  2.74895{col 38}{space 1}   -0.13{col 47}{space 3}0.899{col 55}{space 4}-8.002121{col 68}{space 3} 7.262496
{txt}{space 9}lag4 {c |}{col 15}{res}{space 2}-.0410481{col 27}{space 2}  .860118{col 38}{space 1}   -0.05{col 47}{space 3}0.964{col 55}{space 4}-2.429118{col 68}{space 3} 2.347022
{txt}{space 9}lag5 {c |}{col 15}{res}{space 2} 2.209551{col 27}{space 2} 2.071506{col 38}{space 1}    1.07{col 47}{space 3}0.346{col 55}{space 4}-3.541873{col 68}{space 3} 7.960974
{txt}{space 9}lag6 {c |}{col 15}{res}{space 2} .9154507{col 27}{space 2} 2.505364{col 38}{space 1}    0.37{col 47}{space 3}0.733{col 55}{space 4}-6.040554{col 68}{space 3} 7.871456
{txt}{space 9}lag7 {c |}{col 15}{res}{space 2} 4.971835{col 27}{space 2} 1.118739{col 38}{space 1}    4.44{col 47}{space 3}0.011{col 55}{space 4} 1.865717{col 68}{space 3} 8.077954
{txt}{space 9}lag8 {c |}{col 15}{res}{space 2} 5.331178{col 27}{space 2} 3.225296{col 38}{space 1}    1.65{col 47}{space 3}0.174{col 55}{space 4}-3.623678{col 68}{space 3} 14.28603
{txt}{space 9}lag9 {c |}{col 15}{res}{space 2} 5.628023{col 27}{space 2} 1.244861{col 38}{space 1}    4.52{col 47}{space 3}0.011{col 55}{space 4} 2.171735{col 68}{space 3} 9.084311
{txt}{space 8}lag10 {c |}{col 15}{res}{space 2}  3.63447{col 27}{space 2} 2.674368{col 38}{space 1}    1.36{col 47}{space 3}0.246{col 55}{space 4}-3.790765{col 68}{space 3} 11.05971
{txt}{space 8}lag11 {c |}{col 15}{res}{space 2} -1.29386{col 27}{space 2} 2.120877{col 38}{space 1}   -0.61{col 47}{space 3}0.575{col 55}{space 4}-7.182358{col 68}{space 3} 4.594637
{txt}{space 8}lag12 {c |}{col 15}{res}{space 2} .2657486{col 27}{space 2} 1.840932{col 38}{space 1}    0.14{col 47}{space 3}0.892{col 55}{space 4}-4.845498{col 68}{space 3} 5.376996
{txt}{space 8}lag13 {c |}{col 15}{res}{space 2} .4105517{col 27}{space 2} 1.541876{col 38}{space 1}    0.27{col 47}{space 3}0.803{col 55}{space 4}-3.870381{col 68}{space 3} 4.691484
{txt}{space 8}lag14 {c |}{col 15}{res}{space 2} 4.864118{col 27}{space 2} 1.111625{col 38}{space 1}    4.38{col 47}{space 3}0.012{col 55}{space 4} 1.777752{col 68}{space 3} 7.950484
{txt}{space 8}lag15 {c |}{col 15}{res}{space 2} 5.672344{col 27}{space 2} 3.950309{col 38}{space 1}    1.44{col 47}{space 3}0.224{col 55}{space 4}-5.295473{col 68}{space 3} 16.64016
{txt}{space 8}lag16 {c |}{col 15}{res}{space 2} 7.518359{col 27}{space 2} 1.964292{col 38}{space 1}    3.83{col 47}{space 3}0.019{col 55}{space 4} 2.064609{col 68}{space 3} 12.97211
{txt}{space 8}lag17 {c |}{col 15}{res}{space 2} 7.955764{col 27}{space 2} .9540035{col 38}{space 1}    8.34{col 47}{space 3}0.001{col 55}{space 4} 5.307026{col 68}{space 3}  10.6045
{txt}{space 8}lag18 {c |}{col 15}{res}{space 2} 1.243574{col 27}{space 2} 2.088586{col 38}{space 1}    0.60{col 47}{space 3}0.584{col 55}{space 4}-4.555271{col 68}{space 3}  7.04242
{txt}{space 8}lag19 {c |}{col 15}{res}{space 2}-1.116598{col 27}{space 2} 1.393902{col 38}{space 1}   -0.80{col 47}{space 3}0.468{col 55}{space 4}-4.986689{col 68}{space 3} 2.753494
{txt}{space 8}lag20 {c |}{col 15}{res}{space 2} 8.446897{col 27}{space 2}  3.10342{col 38}{space 1}    2.72{col 47}{space 3}0.053{col 55}{space 4}-.1695796{col 68}{space 3} 17.06337
{txt}{space 8}lag21 {c |}{col 15}{res}{space 2} 4.471807{col 27}{space 2} 2.067654{col 38}{space 1}    2.16{col 47}{space 3}0.097{col 55}{space 4} -1.26892{col 68}{space 3} 10.21253
{txt}{space 8}lag22 {c |}{col 15}{res}{space 2} 2.797567{col 27}{space 2} 1.733232{col 38}{space 1}    1.61{col 47}{space 3}0.182{col 55}{space 4}-2.014657{col 68}{space 3} 7.609792
{txt}{space 8}lag23 {c |}{col 15}{res}{space 2} 3.886409{col 27}{space 2} 2.486074{col 38}{space 1}    1.56{col 47}{space 3}0.193{col 55}{space 4} -3.01604{col 68}{space 3} 10.78886
{txt}{space 8}lag24 {c |}{col 15}{res}{space 2} 2.815824{col 27}{space 2} 1.834144{col 38}{space 1}    1.54{col 47}{space 3}0.200{col 55}{space 4}-2.276575{col 68}{space 3} 7.908224
{txt}{space 8}lag25 {c |}{col 15}{res}{space 2} 3.618836{col 27}{space 2}  1.49212{col 38}{space 1}    2.43{col 47}{space 3}0.072{col 55}{space 4}-.5239539{col 68}{space 3} 7.761626
{txt}{space 8}lag26 {c |}{col 15}{res}{space 2} 1.459202{col 27}{space 2}  1.29603{col 38}{space 1}    1.13{col 47}{space 3}0.323{col 55}{space 4}-2.139153{col 68}{space 3} 5.057558
{txt}{space 8}lag27 {c |}{col 15}{res}{space 2} 2.131448{col 27}{space 2} 2.912973{col 38}{space 1}    0.73{col 47}{space 3}0.505{col 55}{space 4} -5.95626{col 68}{space 3} 10.21916
{txt}{space 8}lag28 {c |}{col 15}{res}{space 2} 1.364268{col 27}{space 2} 2.235114{col 38}{space 1}    0.61{col 47}{space 3}0.575{col 55}{space 4}-4.841403{col 68}{space 3}  7.56994
{txt}{space 8}lag29 {c |}{col 15}{res}{space 2} 2.947587{col 27}{space 2} 3.567779{col 38}{space 1}    0.83{col 47}{space 3}0.455{col 55}{space 4}-6.958154{col 68}{space 3} 12.85333
{txt}{space 8}lag30 {c |}{col 15}{res}{space 2} 2.146112{col 27}{space 2} 2.158803{col 38}{space 1}    0.99{col 47}{space 3}0.376{col 55}{space 4}-3.847687{col 68}{space 3} 8.139911
{txt}{space 8}lag31 {c |}{col 15}{res}{space 2} 2.731161{col 27}{space 2} 2.371592{col 38}{space 1}    1.15{col 47}{space 3}0.314{col 55}{space 4}-3.853435{col 68}{space 3} 9.315757
{txt}{space 8}lag32 {c |}{col 15}{res}{space 2} 2.229234{col 27}{space 2} 1.225413{col 38}{space 1}    1.82{col 47}{space 3}0.143{col 55}{space 4}-1.173059{col 68}{space 3} 5.631527
{txt}{space 8}lag33 {c |}{col 15}{res}{space 2} 1.262274{col 27}{space 2} 2.378681{col 38}{space 1}    0.53{col 47}{space 3}0.624{col 55}{space 4}-5.342004{col 68}{space 3} 7.866552
{txt}{space 8}lag34 {c |}{col 15}{res}{space 2} -.790884{col 27}{space 2}  1.88568{col 38}{space 1}   -0.42{col 47}{space 3}0.696{col 55}{space 4} -6.02637{col 68}{space 3} 4.444602
{txt}{space 8}lag35 {c |}{col 15}{res}{space 2} 1.597218{col 27}{space 2} 2.872458{col 38}{space 1}    0.56{col 47}{space 3}0.608{col 55}{space 4}-6.378004{col 68}{space 3}  9.57244
{txt}{space 8}lag36 {c |}{col 15}{res}{space 2} 2.218465{col 27}{space 2} 2.477653{col 38}{space 1}    0.90{col 47}{space 3}0.421{col 55}{space 4}-4.660603{col 68}{space 3} 9.097532
{txt}{space 8}lag37 {c |}{col 15}{res}{space 2} 6.136473{col 27}{space 2} 1.978176{col 38}{space 1}    3.10{col 47}{space 3}0.036{col 55}{space 4} .6441745{col 68}{space 3} 11.62877
{txt}{space 8}lag38 {c |}{col 15}{res}{space 2}-2.367706{col 27}{space 2} 1.369799{col 38}{space 1}   -1.73{col 47}{space 3}0.159{col 55}{space 4}-6.170877{col 68}{space 3} 1.435465
{txt}{space 8}lag39 {c |}{col 15}{res}{space 2}-.5779325{col 27}{space 2} 2.668616{col 38}{space 1}   -0.22{col 47}{space 3}0.839{col 55}{space 4}-7.987198{col 68}{space 3} 6.831333
{txt}{space 8}lag40 {c |}{col 15}{res}{space 2}-3.360615{col 27}{space 2}  2.69371{col 38}{space 1}   -1.25{col 47}{space 3}0.280{col 55}{space 4}-10.83955{col 68}{space 3} 4.118323
{txt}{space 8}lag41 {c |}{col 15}{res}{space 2} 2.578434{col 27}{space 2} 3.067304{col 38}{space 1}    0.84{col 47}{space 3}0.448{col 55}{space 4}-5.937767{col 68}{space 3} 11.09464
{txt}{space 8}lag42 {c |}{col 15}{res}{space 2} 2.659352{col 27}{space 2}  3.71604{col 38}{space 1}    0.72{col 47}{space 3}0.514{col 55}{space 4}-7.658029{col 68}{space 3} 12.97673
{txt}{space 8}lag43 {c |}{col 15}{res}{space 2}-2.462047{col 27}{space 2}  2.53245{col 38}{space 1}   -0.97{col 47}{space 3}0.386{col 55}{space 4}-9.493255{col 68}{space 3} 4.569161
{txt}{space 8}lag44 {c |}{col 15}{res}{space 2}-1.981117{col 27}{space 2} 2.179172{col 38}{space 1}   -0.91{col 47}{space 3}0.415{col 55}{space 4}-8.031467{col 68}{space 3} 4.069234
{txt}{space 8}lag45 {c |}{col 15}{res}{space 2} 2.118547{col 27}{space 2} 3.295857{col 38}{space 1}    0.64{col 47}{space 3}0.555{col 55}{space 4}-7.032219{col 68}{space 3} 11.26931
{txt}{space 8}lag46 {c |}{col 15}{res}{space 2} -2.08729{col 27}{space 2} 1.760781{col 38}{space 1}   -1.19{col 47}{space 3}0.301{col 55}{space 4}-6.976003{col 68}{space 3} 2.801422
{txt}{space 8}lag47 {c |}{col 15}{res}{space 2}  4.10124{col 27}{space 2} 2.289527{col 38}{space 1}    1.79{col 47}{space 3}0.148{col 55}{space 4}-2.255505{col 68}{space 3} 10.45798
{txt}{space 8}lag48 {c |}{col 15}{res}{space 2} .6662565{col 27}{space 2} 3.058219{col 38}{space 1}    0.22{col 47}{space 3}0.838{col 55}{space 4}-7.824721{col 68}{space 3} 9.157234
{txt}{space 8}lag49 {c |}{col 15}{res}{space 2}-.0987061{col 27}{space 2} 4.636482{col 38}{space 1}   -0.02{col 47}{space 3}0.984{col 55}{space 4}-12.97164{col 68}{space 3} 12.77423
{txt}{space 8}lag50 {c |}{col 15}{res}{space 2} -6.24428{col 27}{space 2} 3.632475{col 38}{space 1}   -1.72{col 47}{space 3}0.161{col 55}{space 4}-16.32965{col 68}{space 3} 3.841088
{txt}{space 8}lag51 {c |}{col 15}{res}{space 2}-3.313807{col 27}{space 2} 1.815691{col 38}{space 1}   -1.83{col 47}{space 3}0.142{col 55}{space 4}-8.354975{col 68}{space 3}  1.72736
{txt}{space 8}lag52 {c |}{col 15}{res}{space 2} .2643454{col 27}{space 2} 2.338714{col 38}{space 1}    0.11{col 47}{space 3}0.915{col 55}{space 4}-6.228966{col 68}{space 3} 6.757657
{txt}{space 8}lag53 {c |}{col 15}{res}{space 2}-7.163257{col 27}{space 2} 2.112495{col 38}{space 1}   -3.39{col 47}{space 3}0.028{col 55}{space 4}-13.02848{col 68}{space 3}-1.298032
{txt}{space 8}lag54 {c |}{col 15}{res}{space 2}-.7191622{col 27}{space 2} 1.800894{col 38}{space 1}   -0.40{col 47}{space 3}0.710{col 55}{space 4}-5.719246{col 68}{space 3} 4.280921
{txt}{space 8}lag55 {c |}{col 15}{res}{space 2}-3.288697{col 27}{space 2} 3.423893{col 38}{space 1}   -0.96{col 47}{space 3}0.391{col 55}{space 4}-12.79495{col 68}{space 3} 6.217553
{txt}{space 8}lag56 {c |}{col 15}{res}{space 2} 5.579449{col 27}{space 2} 3.190696{col 38}{space 1}    1.75{col 47}{space 3}0.155{col 55}{space 4}-3.279343{col 68}{space 3} 14.43824
{txt}{space 8}lag57 {c |}{col 15}{res}{space 2} 2.076462{col 27}{space 2} 3.532222{col 38}{space 1}    0.59{col 47}{space 3}0.588{col 55}{space 4}-7.730557{col 68}{space 3} 11.88348
{txt}{space 8}lag58 {c |}{col 15}{res}{space 2}-.6949756{col 27}{space 2} 2.431323{col 38}{space 1}   -0.29{col 47}{space 3}0.789{col 55}{space 4} -7.44541{col 68}{space 3} 6.055459
{txt}{space 8}lag59 {c |}{col 15}{res}{space 2} 4.337402{col 27}{space 2} 2.596516{col 38}{space 1}    1.67{col 47}{space 3}0.170{col 55}{space 4}-2.871682{col 68}{space 3} 11.54649
{txt}{space 8}lag60 {c |}{col 15}{res}{space 2} 5.447051{col 27}{space 2} 2.238019{col 38}{space 1}    2.43{col 47}{space 3}0.072{col 55}{space 4} -.766685{col 68}{space 3} 11.66079
{txt}{space 8}lag61 {c |}{col 15}{res}{space 2} -3.25966{col 27}{space 2} 4.692947{col 38}{space 1}   -0.69{col 47}{space 3}0.526{col 55}{space 4}-16.28937{col 68}{space 3} 9.770049
{txt}{space 8}lag62 {c |}{col 15}{res}{space 2}-6.000784{col 27}{space 2} 1.929313{col 38}{space 1}   -3.11{col 47}{space 3}0.036{col 55}{space 4}-11.35741{col 68}{space 3}-.6441536
{txt}{space 8}lag63 {c |}{col 15}{res}{space 2}-5.617003{col 27}{space 2} 4.096651{col 38}{space 1}   -1.37{col 47}{space 3}0.242{col 55}{space 4}-16.99113{col 68}{space 3} 5.757123
{txt}{space 8}lag64 {c |}{col 15}{res}{space 2}-7.656926{col 27}{space 2} 2.839229{col 38}{space 1}   -2.70{col 47}{space 3}0.054{col 55}{space 4}-15.53989{col 68}{space 3} .2260367
{txt}{space 8}lag65 {c |}{col 15}{res}{space 2}-13.36827{col 27}{space 2} 4.534056{col 38}{space 1}   -2.95{col 47}{space 3}0.042{col 55}{space 4}-25.95682{col 68}{space 3}-.7797102
{txt}{space 8}lag66 {c |}{col 15}{res}{space 2} 2.060948{col 27}{space 2} 1.300799{col 38}{space 1}    1.58{col 47}{space 3}0.188{col 55}{space 4}-1.550648{col 68}{space 3} 5.672544
{txt}{space 8}lag67 {c |}{col 15}{res}{space 2} .8315626{col 27}{space 2} 3.051101{col 38}{space 1}    0.27{col 47}{space 3}0.799{col 55}{space 4}-7.639651{col 68}{space 3} 9.302776
{txt}{space 8}lag68 {c |}{col 15}{res}{space 2}  .673834{col 27}{space 2} 3.718356{col 38}{space 1}    0.18{col 47}{space 3}0.865{col 55}{space 4}-9.649977{col 68}{space 3} 10.99765
{txt}{space 8}lag69 {c |}{col 15}{res}{space 2}  -9.9619{col 27}{space 2}  1.81107{col 38}{space 1}   -5.50{col 47}{space 3}0.005{col 55}{space 4}-14.99024{col 68}{space 3}-4.933564
{txt}{space 8}lag70 {c |}{col 15}{res}{space 2}  -4.5653{col 27}{space 2} 4.240374{col 38}{space 1}   -1.08{col 47}{space 3}0.342{col 55}{space 4}-16.33847{col 68}{space 3} 7.207866
{txt}{space 8}lag71 {c |}{col 15}{res}{space 2}-4.667621{col 27}{space 2} 3.315933{col 38}{space 1}   -1.41{col 47}{space 3}0.232{col 55}{space 4}-13.87413{col 68}{space 3} 4.538885
{txt}{space 8}lag72 {c |}{col 15}{res}{space 2}-6.144421{col 27}{space 2} 3.395501{col 38}{space 1}   -1.81{col 47}{space 3}0.145{col 55}{space 4}-15.57184{col 68}{space 3} 3.283001
{txt}{space 8}lag73 {c |}{col 15}{res}{space 2}-.3255389{col 27}{space 2} 5.728492{col 38}{space 1}   -0.06{col 47}{space 3}0.957{col 55}{space 4}-16.23038{col 68}{space 3}  15.5793
{txt}{space 8}lag74 {c |}{col 15}{res}{space 2}-.3726222{col 27}{space 2} 3.853079{col 38}{space 1}   -0.10{col 47}{space 3}0.928{col 55}{space 4}-11.07048{col 68}{space 3} 10.32524
{txt}{space 8}lag75 {c |}{col 15}{res}{space 2} .3351763{col 27}{space 2} 4.333251{col 38}{space 1}    0.08{col 47}{space 3}0.942{col 55}{space 4}-11.69586{col 68}{space 3} 12.36621
{txt}{space 8}lag76 {c |}{col 15}{res}{space 2}-1.109208{col 27}{space 2} 4.700307{col 38}{space 1}   -0.24{col 47}{space 3}0.825{col 55}{space 4}-14.15935{col 68}{space 3} 11.94094
{txt}{space 8}lag77 {c |}{col 15}{res}{space 2}-4.131961{col 27}{space 2} 3.901456{col 38}{space 1}   -1.06{col 47}{space 3}0.349{col 55}{space 4}-14.96414{col 68}{space 3} 6.700218
{txt}{space 8}lag78 {c |}{col 15}{res}{space 2}-4.173804{col 27}{space 2} 4.508093{col 38}{space 1}   -0.93{col 47}{space 3}0.407{col 55}{space 4}-16.69028{col 68}{space 3}  8.34267
{txt}{space 8}lag79 {c |}{col 15}{res}{space 2}-5.870999{col 27}{space 2} 3.573187{col 38}{space 1}   -1.64{col 47}{space 3}0.176{col 55}{space 4}-15.79176{col 68}{space 3} 4.049758
{txt}{space 8}lag80 {c |}{col 15}{res}{space 2} -1.97965{col 27}{space 2} 5.077538{col 38}{space 1}   -0.39{col 47}{space 3}0.716{col 55}{space 4}-16.07716{col 68}{space 3} 12.11786
{txt}{space 8}lag81 {c |}{col 15}{res}{space 2}-4.891211{col 27}{space 2} 3.449065{col 38}{space 1}   -1.42{col 47}{space 3}0.229{col 55}{space 4}-14.46735{col 68}{space 3} 4.684929
{txt}{space 8}lag82 {c |}{col 15}{res}{space 2}-8.343207{col 27}{space 2} 2.306284{col 38}{space 1}   -3.62{col 47}{space 3}0.022{col 55}{space 4}-14.74648{col 68}{space 3}-1.939937
{txt}{space 8}lag83 {c |}{col 15}{res}{space 2} 3.221696{col 27}{space 2}  3.18611{col 38}{space 1}    1.01{col 47}{space 3}0.369{col 55}{space 4}-5.624364{col 68}{space 3} 12.06776
{txt}{space 8}lag84 {c |}{col 15}{res}{space 2} 1.861581{col 27}{space 2} 4.363074{col 38}{space 1}    0.43{col 47}{space 3}0.692{col 55}{space 4}-10.25226{col 68}{space 3} 13.97542
{txt}{space 8}lag85 {c |}{col 15}{res}{space 2}-4.035683{col 27}{space 2}  4.27227{col 38}{space 1}   -0.94{col 47}{space 3}0.398{col 55}{space 4}-15.89741{col 68}{space 3}  7.82604
{txt}{space 8}lag86 {c |}{col 15}{res}{space 2}-4.380587{col 27}{space 2} 4.512691{col 38}{space 1}   -0.97{col 47}{space 3}0.387{col 55}{space 4}-16.90983{col 68}{space 3} 8.148651
{txt}{space 8}lag87 {c |}{col 15}{res}{space 2}-4.271204{col 27}{space 2} 4.551115{col 38}{space 1}   -0.94{col 47}{space 3}0.401{col 55}{space 4}-16.90712{col 68}{space 3} 8.364716
{txt}{space 8}lag88 {c |}{col 15}{res}{space 2} -2.45319{col 27}{space 2} 3.810243{col 38}{space 1}   -0.64{col 47}{space 3}0.555{col 55}{space 4}-13.03212{col 68}{space 3}  8.12574
{txt}{space 8}lag89 {c |}{col 15}{res}{space 2} .7625645{col 27}{space 2} 3.822102{col 38}{space 1}    0.20{col 47}{space 3}0.852{col 55}{space 4}-9.849291{col 68}{space 3} 11.37442
{txt}{space 8}lag90 {c |}{col 15}{res}{space 2}-.0278175{col 27}{space 2} 2.993235{col 38}{space 1}   -0.01{col 47}{space 3}0.993{col 55}{space 4}-8.338369{col 68}{space 3} 8.282734
{txt}{space 8}lag91 {c |}{col 15}{res}{space 2}-1.164121{col 27}{space 2}  4.50757{col 38}{space 1}   -0.26{col 47}{space 3}0.809{col 55}{space 4}-13.67914{col 68}{space 3}  11.3509
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}-126.3447{col 27}{space 2} 24.16244{col 38}{space 1}   -5.23{col 47}{space 3}0.006{col 55}{space 4}-193.4304{col 68}{space 3}-59.25899
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}   regionid1{col 14}{c |}{space 1}        5{col 27}{space 1}        5{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}        date{col 14}{c |}{space 1}     5267{col 27}{space 1}        1{col 39}{result}{space 1}     5266{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. graph export "results/EventStudy-MiddayElec.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/simonpostler/Desktop/applied-econometrics-dst-master-2/results/EventStudy-MiddayElec.png{rm}
saved as
PNG
format
{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/6h/778gphg5533gk87_wkb11wqh0000gn/T//SD01922.000000"
{txt}
{com}. use "data/06-half-hourly.dta", clear
{txt}
{com}. gen timevar = .
{txt}(1,264,072 missing values generated)

{com}. replace timevar = days_into_dst if dst_here_anytime == 1
{txt}(1,011,256 real changes made)

{com}. drop if dst_start !=1 //DST start so only July to December direction
{txt}(614,512 observations deleted)

{com}. 
. eventdd co2_g_per_capita_vs_midday public_holiday c.temperature##c.temperature solar_exposure wind_3 [aweight = population], timevar(timevar) method(hdfe, absorb(regionid1 date) cluster(regionid1)) graph_op(ytitle("Co2 kg per capita") xtitle("Days until DST transition") title("Event Study - CO2 - Midday Normalised - DST Start Direction"))
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}{txt}warning: missing F statistic; dropped variables due to collinearity or too few clusters
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}   649,560
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F( 189,      4)}{col 67}=          {res}.
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.2331
{txt}{col 51}Adj R-squared{col 67}= {res}    0.2297
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0161
{txt}{col 1}Number of clusters ({res}regionid1{txt}) {col 30}= {res}         5{txt}{col 51}Root MSE{col 67}= {res}   56.8062

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}co2_g_per_c~y{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
public_holi~y {c |}{col 15}{res}{space 2} 8.010644{col 27}{space 2} 3.457371{col 38}{space 1}    2.32{col 47}{space 3}0.081{col 55}{space 4}-1.588555{col 68}{space 3} 17.60984
{txt}{space 2}temperature {c |}{col 15}{res}{space 2} 9.431763{col 27}{space 2} 1.673127{col 38}{space 1}    5.64{col 47}{space 3}0.005{col 55}{space 4} 4.786418{col 68}{space 3} 14.07711
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2}-.1942189{col 27}{space 2}  .030184{col 38}{space 1}   -6.43{col 47}{space 3}0.003{col 55}{space 4}-.2780231{col 68}{space 3}-.1104146
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2} 2.820122{col 27}{space 2} .6959485{col 38}{space 1}    4.05{col 47}{space 3}0.015{col 55}{space 4} .8878588{col 68}{space 3} 4.752384
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2}-1.931804{col 27}{space 2} .5212213{col 38}{space 1}   -3.71{col 47}{space 3}0.021{col 55}{space 4}-3.378946{col 68}{space 3}-.4846611
{txt}{space 7}lead94 {c |}{col 15}{res}{space 2} 11.74472{col 27}{space 2} 5.106089{col 38}{space 1}    2.30{col 47}{space 3}0.083{col 55}{space 4}-2.432054{col 68}{space 3}  25.9215
{txt}{space 7}lead93 {c |}{col 15}{res}{space 2} 4.190901{col 27}{space 2} 7.326302{col 38}{space 1}    0.57{col 47}{space 3}0.598{col 55}{space 4}-16.15017{col 68}{space 3} 24.53198
{txt}{space 7}lead92 {c |}{col 15}{res}{space 2} 15.00887{col 27}{space 2} 3.599107{col 38}{space 1}    4.17{col 47}{space 3}0.014{col 55}{space 4} 5.016147{col 68}{space 3}  25.0016
{txt}{space 7}lead91 {c |}{col 15}{res}{space 2} 9.667244{col 27}{space 2} 11.27603{col 38}{space 1}    0.86{col 47}{space 3}0.440{col 55}{space 4}-21.64005{col 68}{space 3} 40.97453
{txt}{space 7}lead90 {c |}{col 15}{res}{space 2} 8.545253{col 27}{space 2} 2.252143{col 38}{space 1}    3.79{col 47}{space 3}0.019{col 55}{space 4}   2.2923{col 68}{space 3} 14.79821
{txt}{space 7}lead89 {c |}{col 15}{res}{space 2} 9.911761{col 27}{space 2} 2.785545{col 38}{space 1}    3.56{col 47}{space 3}0.024{col 55}{space 4} 2.177847{col 68}{space 3} 17.64568
{txt}{space 7}lead88 {c |}{col 15}{res}{space 2} 11.45851{col 27}{space 2} 4.395984{col 38}{space 1}    2.61{col 47}{space 3}0.060{col 55}{space 4}-.7466966{col 68}{space 3} 23.66372
{txt}{space 7}lead87 {c |}{col 15}{res}{space 2} 8.754381{col 27}{space 2}  2.23429{col 38}{space 1}    3.92{col 47}{space 3}0.017{col 55}{space 4} 2.550998{col 68}{space 3} 14.95776
{txt}{space 7}lead86 {c |}{col 15}{res}{space 2} 1.300551{col 27}{space 2} 4.815352{col 38}{space 1}    0.27{col 47}{space 3}0.800{col 55}{space 4}-12.06901{col 68}{space 3} 14.67011
{txt}{space 7}lead85 {c |}{col 15}{res}{space 2} .8158454{col 27}{space 2} 8.614498{col 38}{space 1}    0.09{col 47}{space 3}0.929{col 55}{space 4}-23.10184{col 68}{space 3} 24.73353
{txt}{space 7}lead84 {c |}{col 15}{res}{space 2} 6.566612{col 27}{space 2}  10.2259{col 38}{space 1}    0.64{col 47}{space 3}0.556{col 55}{space 4}-21.82505{col 68}{space 3} 34.95827
{txt}{space 7}lead83 {c |}{col 15}{res}{space 2} .4614041{col 27}{space 2} 6.516748{col 38}{space 1}    0.07{col 47}{space 3}0.947{col 55}{space 4}-17.63199{col 68}{space 3}  18.5548
{txt}{space 7}lead82 {c |}{col 15}{res}{space 2}-3.564267{col 27}{space 2} 6.842762{col 38}{space 1}   -0.52{col 47}{space 3}0.630{col 55}{space 4}-22.56282{col 68}{space 3} 15.43429
{txt}{space 7}lead81 {c |}{col 15}{res}{space 2}-.3911652{col 27}{space 2}  2.49267{col 38}{space 1}   -0.16{col 47}{space 3}0.883{col 55}{space 4}-7.311925{col 68}{space 3} 6.529595
{txt}{space 7}lead80 {c |}{col 15}{res}{space 2}-6.526914{col 27}{space 2} 8.010821{col 38}{space 1}   -0.81{col 47}{space 3}0.461{col 55}{space 4}-28.76852{col 68}{space 3} 15.71469
{txt}{space 7}lead79 {c |}{col 15}{res}{space 2}-.5619561{col 27}{space 2} 7.667476{col 38}{space 1}   -0.07{col 47}{space 3}0.945{col 55}{space 4}-21.85028{col 68}{space 3} 20.72637
{txt}{space 7}lead78 {c |}{col 15}{res}{space 2} 3.894221{col 27}{space 2} 10.05946{col 38}{space 1}    0.39{col 47}{space 3}0.718{col 55}{space 4}-24.03533{col 68}{space 3} 31.82377
{txt}{space 7}lead77 {c |}{col 15}{res}{space 2} 10.72698{col 27}{space 2}  7.77848{col 38}{space 1}    1.38{col 47}{space 3}0.240{col 55}{space 4}-10.86954{col 68}{space 3} 32.32351
{txt}{space 7}lead76 {c |}{col 15}{res}{space 2} 2.466555{col 27}{space 2} 4.696101{col 38}{space 1}    0.53{col 47}{space 3}0.627{col 55}{space 4}-10.57191{col 68}{space 3} 15.50502
{txt}{space 7}lead75 {c |}{col 15}{res}{space 2} 1.161523{col 27}{space 2} 8.537113{col 38}{space 1}    0.14{col 47}{space 3}0.898{col 55}{space 4} -22.5413{col 68}{space 3} 24.86435
{txt}{space 7}lead74 {c |}{col 15}{res}{space 2} 3.531519{col 27}{space 2} 7.862854{col 38}{space 1}    0.45{col 47}{space 3}0.677{col 55}{space 4}-18.29926{col 68}{space 3}  25.3623
{txt}{space 7}lead73 {c |}{col 15}{res}{space 2} 7.076836{col 27}{space 2} 4.239453{col 38}{space 1}    1.67{col 47}{space 3}0.170{col 55}{space 4}-4.693773{col 68}{space 3} 18.84744
{txt}{space 7}lead72 {c |}{col 15}{res}{space 2} 12.12426{col 27}{space 2} 7.566493{col 38}{space 1}    1.60{col 47}{space 3}0.184{col 55}{space 4}-8.883697{col 68}{space 3} 33.13221
{txt}{space 7}lead71 {c |}{col 15}{res}{space 2} 9.979713{col 27}{space 2} 6.320829{col 38}{space 1}    1.58{col 47}{space 3}0.190{col 55}{space 4}-7.569722{col 68}{space 3} 27.52915
{txt}{space 7}lead70 {c |}{col 15}{res}{space 2} 9.954367{col 27}{space 2} 6.744915{col 38}{space 1}    1.48{col 47}{space 3}0.214{col 55}{space 4} -8.77252{col 68}{space 3} 28.68125
{txt}{space 7}lead69 {c |}{col 15}{res}{space 2} 6.732597{col 27}{space 2} 8.326543{col 38}{space 1}    0.81{col 47}{space 3}0.464{col 55}{space 4}-16.38559{col 68}{space 3} 29.85079
{txt}{space 7}lead68 {c |}{col 15}{res}{space 2} 5.330527{col 27}{space 2} 13.01695{col 38}{space 1}    0.41{col 47}{space 3}0.703{col 55}{space 4}-30.81033{col 68}{space 3} 41.47138
{txt}{space 7}lead67 {c |}{col 15}{res}{space 2} .8479876{col 27}{space 2}  12.6418{col 38}{space 1}    0.07{col 47}{space 3}0.950{col 55}{space 4}-34.25129{col 68}{space 3} 35.94726
{txt}{space 7}lead66 {c |}{col 15}{res}{space 2} 7.636959{col 27}{space 2} 12.58959{col 38}{space 1}    0.61{col 47}{space 3}0.577{col 55}{space 4}-27.31733{col 68}{space 3} 42.59125
{txt}{space 7}lead65 {c |}{col 15}{res}{space 2}  1.58318{col 27}{space 2} 15.50563{col 38}{space 1}    0.10{col 47}{space 3}0.924{col 55}{space 4}-41.46735{col 68}{space 3} 44.63371
{txt}{space 7}lead64 {c |}{col 15}{res}{space 2}  7.07651{col 27}{space 2} 8.842469{col 38}{space 1}    0.80{col 47}{space 3}0.468{col 55}{space 4}-17.47412{col 68}{space 3} 31.62714
{txt}{space 7}lead63 {c |}{col 15}{res}{space 2} 8.559734{col 27}{space 2} 6.326314{col 38}{space 1}    1.35{col 47}{space 3}0.247{col 55}{space 4} -9.00493{col 68}{space 3}  26.1244
{txt}{space 7}lead62 {c |}{col 15}{res}{space 2} 7.118838{col 27}{space 2} 3.596406{col 38}{space 1}    1.98{col 47}{space 3}0.119{col 55}{space 4}-2.866387{col 68}{space 3} 17.10406
{txt}{space 7}lead61 {c |}{col 15}{res}{space 2} 9.359013{col 27}{space 2} 11.17555{col 38}{space 1}    0.84{col 47}{space 3}0.449{col 55}{space 4}-21.66929{col 68}{space 3} 40.38732
{txt}{space 7}lead60 {c |}{col 15}{res}{space 2} 7.378272{col 27}{space 2} 7.845744{col 38}{space 1}    0.94{col 47}{space 3}0.400{col 55}{space 4}-14.40501{col 68}{space 3} 29.16155
{txt}{space 7}lead59 {c |}{col 15}{res}{space 2} 1.558882{col 27}{space 2}  7.76014{col 38}{space 1}    0.20{col 47}{space 3}0.851{col 55}{space 4}-19.98672{col 68}{space 3} 23.10448
{txt}{space 7}lead58 {c |}{col 15}{res}{space 2} 9.228099{col 27}{space 2} 8.428843{col 38}{space 1}    1.09{col 47}{space 3}0.335{col 55}{space 4}-14.17412{col 68}{space 3} 32.63032
{txt}{space 7}lead57 {c |}{col 15}{res}{space 2} 4.369742{col 27}{space 2} 6.442087{col 38}{space 1}    0.68{col 47}{space 3}0.535{col 55}{space 4}-13.51636{col 68}{space 3} 22.25584
{txt}{space 7}lead56 {c |}{col 15}{res}{space 2} 12.69073{col 27}{space 2} 4.763784{col 38}{space 1}    2.66{col 47}{space 3}0.056{col 55}{space 4}-.5356576{col 68}{space 3} 25.91711
{txt}{space 7}lead55 {c |}{col 15}{res}{space 2} 4.086734{col 27}{space 2} 7.623375{col 38}{space 1}    0.54{col 47}{space 3}0.620{col 55}{space 4}-17.07915{col 68}{space 3} 25.25262
{txt}{space 7}lead54 {c |}{col 15}{res}{space 2} 9.235399{col 27}{space 2} 8.546887{col 38}{space 1}    1.08{col 47}{space 3}0.341{col 55}{space 4}-14.49456{col 68}{space 3} 32.96536
{txt}{space 7}lead53 {c |}{col 15}{res}{space 2} 6.149996{col 27}{space 2} 6.896465{col 38}{space 1}    0.89{col 47}{space 3}0.423{col 55}{space 4}-12.99766{col 68}{space 3} 25.29765
{txt}{space 7}lead52 {c |}{col 15}{res}{space 2} 1.366444{col 27}{space 2} 14.31215{col 38}{space 1}    0.10{col 47}{space 3}0.929{col 55}{space 4}-38.37044{col 68}{space 3} 41.10333
{txt}{space 7}lead51 {c |}{col 15}{res}{space 2}-.1199282{col 27}{space 2} 5.918143{col 38}{space 1}   -0.02{col 47}{space 3}0.985{col 55}{space 4}-16.55133{col 68}{space 3} 16.31147
{txt}{space 7}lead50 {c |}{col 15}{res}{space 2} 7.384829{col 27}{space 2} 7.274865{col 38}{space 1}    1.02{col 47}{space 3}0.367{col 55}{space 4}-12.81343{col 68}{space 3} 27.58309
{txt}{space 7}lead49 {c |}{col 15}{res}{space 2} 1.687172{col 27}{space 2} 2.546115{col 38}{space 1}    0.66{col 47}{space 3}0.544{col 55}{space 4}-5.381975{col 68}{space 3}  8.75632
{txt}{space 7}lead48 {c |}{col 15}{res}{space 2}-1.685463{col 27}{space 2} 7.340688{col 38}{space 1}   -0.23{col 47}{space 3}0.830{col 55}{space 4}-22.06648{col 68}{space 3} 18.69555
{txt}{space 7}lead47 {c |}{col 15}{res}{space 2} 1.425128{col 27}{space 2}  8.09011{col 38}{space 1}    0.18{col 47}{space 3}0.869{col 55}{space 4}-21.03662{col 68}{space 3} 23.88687
{txt}{space 7}lead46 {c |}{col 15}{res}{space 2}  3.53884{col 27}{space 2} 9.269952{col 38}{space 1}    0.38{col 47}{space 3}0.722{col 55}{space 4}-22.19867{col 68}{space 3} 29.27635
{txt}{space 7}lead45 {c |}{col 15}{res}{space 2}  2.77262{col 27}{space 2} 8.004865{col 38}{space 1}    0.35{col 47}{space 3}0.747{col 55}{space 4}-19.45245{col 68}{space 3} 24.99769
{txt}{space 7}lead44 {c |}{col 15}{res}{space 2} 1.097456{col 27}{space 2}  8.84995{col 38}{space 1}    0.12{col 47}{space 3}0.907{col 55}{space 4}-23.47394{col 68}{space 3} 25.66886
{txt}{space 7}lead43 {c |}{col 15}{res}{space 2} 3.787066{col 27}{space 2} 5.612355{col 38}{space 1}    0.67{col 47}{space 3}0.537{col 55}{space 4}-11.79533{col 68}{space 3} 19.36946
{txt}{space 7}lead42 {c |}{col 15}{res}{space 2} 9.209688{col 27}{space 2} 2.215176{col 38}{space 1}    4.16{col 47}{space 3}0.014{col 55}{space 4} 3.059373{col 68}{space 3}    15.36
{txt}{space 7}lead41 {c |}{col 15}{res}{space 2} 5.455659{col 27}{space 2} 5.961062{col 38}{space 1}    0.92{col 47}{space 3}0.412{col 55}{space 4} -11.0949{col 68}{space 3} 22.00622
{txt}{space 7}lead40 {c |}{col 15}{res}{space 2} .4293976{col 27}{space 2} 5.803293{col 38}{space 1}    0.07{col 47}{space 3}0.945{col 55}{space 4}-15.68313{col 68}{space 3} 16.54192
{txt}{space 7}lead39 {c |}{col 15}{res}{space 2} 2.328799{col 27}{space 2} 8.932801{col 38}{space 1}    0.26{col 47}{space 3}0.807{col 55}{space 4}-22.47263{col 68}{space 3} 27.13023
{txt}{space 7}lead38 {c |}{col 15}{res}{space 2} 2.409977{col 27}{space 2} 6.511247{col 38}{space 1}    0.37{col 47}{space 3}0.730{col 55}{space 4}-15.66814{col 68}{space 3}  20.4881
{txt}{space 7}lead37 {c |}{col 15}{res}{space 2} 6.004839{col 27}{space 2} 6.189283{col 38}{space 1}    0.97{col 47}{space 3}0.387{col 55}{space 4}-11.17937{col 68}{space 3} 23.18904
{txt}{space 7}lead36 {c |}{col 15}{res}{space 2} 10.67747{col 27}{space 2} 4.364407{col 38}{space 1}    2.45{col 47}{space 3}0.071{col 55}{space 4}-1.440069{col 68}{space 3} 22.79501
{txt}{space 7}lead35 {c |}{col 15}{res}{space 2} 10.35127{col 27}{space 2} 5.784932{col 38}{space 1}    1.79{col 47}{space 3}0.148{col 55}{space 4}-5.710281{col 68}{space 3} 26.41281
{txt}{space 7}lead34 {c |}{col 15}{res}{space 2} 2.918995{col 27}{space 2} 5.310985{col 38}{space 1}    0.55{col 47}{space 3}0.612{col 55}{space 4}-11.82666{col 68}{space 3} 17.66465
{txt}{space 7}lead33 {c |}{col 15}{res}{space 2} 4.544943{col 27}{space 2} 7.042359{col 38}{space 1}    0.65{col 47}{space 3}0.554{col 55}{space 4}-15.00778{col 68}{space 3} 24.09767
{txt}{space 7}lead32 {c |}{col 15}{res}{space 2} 4.451499{col 27}{space 2} 7.414038{col 38}{space 1}    0.60{col 47}{space 3}0.581{col 55}{space 4}-16.13317{col 68}{space 3} 25.03617
{txt}{space 7}lead31 {c |}{col 15}{res}{space 2} 1.473654{col 27}{space 2} 4.772991{col 38}{space 1}    0.31{col 47}{space 3}0.773{col 55}{space 4}-11.77829{col 68}{space 3}  14.7256
{txt}{space 7}lead30 {c |}{col 15}{res}{space 2} 4.293857{col 27}{space 2} 3.004988{col 38}{space 1}    1.43{col 47}{space 3}0.226{col 55}{space 4}-4.049328{col 68}{space 3} 12.63704
{txt}{space 7}lead29 {c |}{col 15}{res}{space 2} 10.60706{col 27}{space 2} 2.648067{col 38}{space 1}    4.01{col 47}{space 3}0.016{col 55}{space 4} 3.254847{col 68}{space 3} 17.95927
{txt}{space 7}lead28 {c |}{col 15}{res}{space 2} 5.024254{col 27}{space 2} 3.645599{col 38}{space 1}    1.38{col 47}{space 3}0.240{col 55}{space 4}-5.097553{col 68}{space 3} 15.14606
{txt}{space 7}lead27 {c |}{col 15}{res}{space 2} 1.755131{col 27}{space 2} 6.629208{col 38}{space 1}    0.26{col 47}{space 3}0.804{col 55}{space 4} -16.6505{col 68}{space 3} 20.16076
{txt}{space 7}lead26 {c |}{col 15}{res}{space 2} 3.486111{col 27}{space 2} 5.113662{col 38}{space 1}    0.68{col 47}{space 3}0.533{col 55}{space 4}-10.71169{col 68}{space 3} 17.68391
{txt}{space 7}lead25 {c |}{col 15}{res}{space 2} .6096321{col 27}{space 2}  5.97348{col 38}{space 1}    0.10{col 47}{space 3}0.924{col 55}{space 4}-15.97541{col 68}{space 3} 17.19467
{txt}{space 7}lead24 {c |}{col 15}{res}{space 2}-.0038366{col 27}{space 2} 6.181425{col 38}{space 1}   -0.00{col 47}{space 3}1.000{col 55}{space 4}-17.16622{col 68}{space 3} 17.15855
{txt}{space 7}lead23 {c |}{col 15}{res}{space 2} 5.423095{col 27}{space 2} 6.788169{col 38}{space 1}    0.80{col 47}{space 3}0.469{col 55}{space 4}-13.42388{col 68}{space 3} 24.27007
{txt}{space 7}lead22 {c |}{col 15}{res}{space 2}-1.385501{col 27}{space 2} 7.275381{col 38}{space 1}   -0.19{col 47}{space 3}0.858{col 55}{space 4} -21.5852{col 68}{space 3} 18.81419
{txt}{space 7}lead21 {c |}{col 15}{res}{space 2} 4.698097{col 27}{space 2} 2.800278{col 38}{space 1}    1.68{col 47}{space 3}0.169{col 55}{space 4} -3.07672{col 68}{space 3} 12.47291
{txt}{space 7}lead20 {c |}{col 15}{res}{space 2} 6.771805{col 27}{space 2}  2.39193{col 38}{space 1}    2.83{col 47}{space 3}0.047{col 55}{space 4} .1307425{col 68}{space 3} 13.41287
{txt}{space 7}lead19 {c |}{col 15}{res}{space 2} 1.364182{col 27}{space 2}  5.64135{col 38}{space 1}    0.24{col 47}{space 3}0.821{col 55}{space 4}-14.29872{col 68}{space 3} 17.02708
{txt}{space 7}lead18 {c |}{col 15}{res}{space 2} 10.09723{col 27}{space 2} 3.186842{col 38}{space 1}    3.17{col 47}{space 3}0.034{col 55}{space 4} 1.249142{col 68}{space 3} 18.94532
{txt}{space 7}lead17 {c |}{col 15}{res}{space 2} 6.984877{col 27}{space 2} 3.003233{col 38}{space 1}    2.33{col 47}{space 3}0.081{col 55}{space 4}-1.353436{col 68}{space 3} 15.32319
{txt}{space 7}lead16 {c |}{col 15}{res}{space 2} 3.660113{col 27}{space 2} 2.797722{col 38}{space 1}    1.31{col 47}{space 3}0.261{col 55}{space 4}-4.107609{col 68}{space 3} 11.42784
{txt}{space 7}lead15 {c |}{col 15}{res}{space 2}-3.672315{col 27}{space 2} 1.775163{col 38}{space 1}   -2.07{col 47}{space 3}0.107{col 55}{space 4}-8.600958{col 68}{space 3} 1.256327
{txt}{space 7}lead14 {c |}{col 15}{res}{space 2}-3.556734{col 27}{space 2} 1.821373{col 38}{space 1}   -1.95{col 47}{space 3}0.123{col 55}{space 4}-8.613676{col 68}{space 3} 1.500207
{txt}{space 7}lead13 {c |}{col 15}{res}{space 2} .7670905{col 27}{space 2}  1.80225{col 38}{space 1}    0.43{col 47}{space 3}0.692{col 55}{space 4}-4.236757{col 68}{space 3} 5.770938
{txt}{space 7}lead12 {c |}{col 15}{res}{space 2} 2.213712{col 27}{space 2} 2.466615{col 38}{space 1}    0.90{col 47}{space 3}0.420{col 55}{space 4}-4.634709{col 68}{space 3} 9.062133
{txt}{space 7}lead11 {c |}{col 15}{res}{space 2} 1.104121{col 27}{space 2} 1.977471{col 38}{space 1}    0.56{col 47}{space 3}0.606{col 55}{space 4}-4.386217{col 68}{space 3}  6.59446
{txt}{space 7}lead10 {c |}{col 15}{res}{space 2}-1.987167{col 27}{space 2} 3.424771{col 38}{space 1}   -0.58{col 47}{space 3}0.593{col 55}{space 4}-11.49586{col 68}{space 3} 7.521523
{txt}{space 8}lead9 {c |}{col 15}{res}{space 2} 1.446178{col 27}{space 2} 2.107786{col 38}{space 1}    0.69{col 47}{space 3}0.530{col 55}{space 4}-4.405973{col 68}{space 3} 7.298329
{txt}{space 8}lead8 {c |}{col 15}{res}{space 2} 8.242273{col 27}{space 2} 2.419722{col 38}{space 1}    3.41{col 47}{space 3}0.027{col 55}{space 4} 1.524049{col 68}{space 3}  14.9605
{txt}{space 8}lead7 {c |}{col 15}{res}{space 2} 6.791959{col 27}{space 2} 1.594789{col 38}{space 1}    4.26{col 47}{space 3}0.013{col 55}{space 4} 2.364116{col 68}{space 3}  11.2198
{txt}{space 8}lead6 {c |}{col 15}{res}{space 2}-.9458158{col 27}{space 2} 1.790731{col 38}{space 1}   -0.53{col 47}{space 3}0.625{col 55}{space 4}-5.917682{col 68}{space 3}  4.02605
{txt}{space 8}lead5 {c |}{col 15}{res}{space 2}-5.209156{col 27}{space 2} 2.931166{col 38}{space 1}   -1.78{col 47}{space 3}0.150{col 55}{space 4}-13.34738{col 68}{space 3} 2.929066
{txt}{space 8}lead4 {c |}{col 15}{res}{space 2} 2.748794{col 27}{space 2} .8842195{col 38}{space 1}    3.11{col 47}{space 3}0.036{col 55}{space 4} .2938066{col 68}{space 3} 5.203781
{txt}{space 8}lead3 {c |}{col 15}{res}{space 2} 3.375574{col 27}{space 2} 1.959595{col 38}{space 1}    1.72{col 47}{space 3}0.160{col 55}{space 4}-2.065134{col 68}{space 3} 8.816281
{txt}{space 8}lead2 {c |}{col 15}{res}{space 2} 4.129047{col 27}{space 2} 1.476611{col 38}{space 1}    2.80{col 47}{space 3}0.049{col 55}{space 4} .0293184{col 68}{space 3} 8.228775
{txt}{space 9}lag0 {c |}{col 15}{res}{space 2} 1.607956{col 27}{space 2} .8588449{col 38}{space 1}    1.87{col 47}{space 3}0.134{col 55}{space 4}-.7765801{col 68}{space 3} 3.992492
{txt}{space 9}lag1 {c |}{col 15}{res}{space 2} -1.01735{col 27}{space 2} .9490965{col 38}{space 1}   -1.07{col 47}{space 3}0.344{col 55}{space 4}-3.652464{col 68}{space 3} 1.617764
{txt}{space 9}lag2 {c |}{col 15}{res}{space 2}-.1053949{col 27}{space 2} 1.648091{col 38}{space 1}   -0.06{col 47}{space 3}0.952{col 55}{space 4} -4.68123{col 68}{space 3}  4.47044
{txt}{space 9}lag3 {c |}{col 15}{res}{space 2}-4.071191{col 27}{space 2} 2.153839{col 38}{space 1}   -1.89{col 47}{space 3}0.132{col 55}{space 4}-10.05121{col 68}{space 3} 1.908824
{txt}{space 9}lag4 {c |}{col 15}{res}{space 2} 4.246472{col 27}{space 2} 1.601752{col 38}{space 1}    2.65{col 47}{space 3}0.057{col 55}{space 4}-.2007034{col 68}{space 3} 8.693647
{txt}{space 9}lag5 {c |}{col 15}{res}{space 2}   1.0678{col 27}{space 2} 2.656532{col 38}{space 1}    0.40{col 47}{space 3}0.708{col 55}{space 4}-6.307914{col 68}{space 3} 8.443515
{txt}{space 9}lag6 {c |}{col 15}{res}{space 2} 4.573658{col 27}{space 2} 6.712821{col 38}{space 1}    0.68{col 47}{space 3}0.533{col 55}{space 4}-14.06412{col 68}{space 3} 23.21144
{txt}{space 9}lag7 {c |}{col 15}{res}{space 2}  5.20993{col 27}{space 2} 4.389869{col 38}{space 1}    1.19{col 47}{space 3}0.301{col 55}{space 4}-6.978299{col 68}{space 3} 17.39816
{txt}{space 9}lag8 {c |}{col 15}{res}{space 2}  7.28509{col 27}{space 2} 1.543165{col 38}{space 1}    4.72{col 47}{space 3}0.009{col 55}{space 4} 3.000578{col 68}{space 3}  11.5696
{txt}{space 9}lag9 {c |}{col 15}{res}{space 2}  10.7196{col 27}{space 2} 4.360635{col 38}{space 1}    2.46{col 47}{space 3}0.070{col 55}{space 4}-1.387464{col 68}{space 3} 22.82666
{txt}{space 8}lag10 {c |}{col 15}{res}{space 2} 7.617463{col 27}{space 2} 4.446506{col 38}{space 1}    1.71{col 47}{space 3}0.162{col 55}{space 4}-4.728017{col 68}{space 3} 19.96294
{txt}{space 8}lag11 {c |}{col 15}{res}{space 2}-.2933424{col 27}{space 2} 1.062997{col 38}{space 1}   -0.28{col 47}{space 3}0.796{col 55}{space 4}-3.244696{col 68}{space 3} 2.658011
{txt}{space 8}lag12 {c |}{col 15}{res}{space 2} 8.344437{col 27}{space 2} 4.424246{col 38}{space 1}    1.89{col 47}{space 3}0.132{col 55}{space 4}-3.939241{col 68}{space 3} 20.62811
{txt}{space 8}lag13 {c |}{col 15}{res}{space 2} 6.732828{col 27}{space 2} 1.308383{col 38}{space 1}    5.15{col 47}{space 3}0.007{col 55}{space 4} 3.100175{col 68}{space 3} 10.36548
{txt}{space 8}lag14 {c |}{col 15}{res}{space 2} 6.716836{col 27}{space 2} .8505002{col 38}{space 1}    7.90{col 47}{space 3}0.001{col 55}{space 4} 4.355469{col 68}{space 3} 9.078203
{txt}{space 8}lag15 {c |}{col 15}{res}{space 2} 5.040427{col 27}{space 2} 3.642384{col 38}{space 1}    1.38{col 47}{space 3}0.239{col 55}{space 4}-5.072452{col 68}{space 3} 15.15331
{txt}{space 8}lag16 {c |}{col 15}{res}{space 2} 4.316108{col 27}{space 2} 2.297028{col 38}{space 1}    1.88{col 47}{space 3}0.133{col 55}{space 4}-2.061464{col 68}{space 3} 10.69368
{txt}{space 8}lag17 {c |}{col 15}{res}{space 2} 10.93809{col 27}{space 2} 1.770117{col 38}{space 1}    6.18{col 47}{space 3}0.003{col 55}{space 4} 6.023453{col 68}{space 3} 15.85272
{txt}{space 8}lag18 {c |}{col 15}{res}{space 2} 2.778266{col 27}{space 2} 1.781012{col 38}{space 1}    1.56{col 47}{space 3}0.194{col 55}{space 4}-2.166617{col 68}{space 3} 7.723149
{txt}{space 8}lag19 {c |}{col 15}{res}{space 2}-.4698915{col 27}{space 2} 3.259639{col 38}{space 1}   -0.14{col 47}{space 3}0.892{col 55}{space 4}-9.520101{col 68}{space 3} 8.580318
{txt}{space 8}lag20 {c |}{col 15}{res}{space 2} 5.201083{col 27}{space 2} 1.800783{col 38}{space 1}    2.89{col 47}{space 3}0.045{col 55}{space 4} .2013077{col 68}{space 3} 10.20086
{txt}{space 8}lag21 {c |}{col 15}{res}{space 2} 1.832419{col 27}{space 2} 3.066044{col 38}{space 1}    0.60{col 47}{space 3}0.582{col 55}{space 4}-6.680284{col 68}{space 3} 10.34512
{txt}{space 8}lag22 {c |}{col 15}{res}{space 2}-.3023082{col 27}{space 2} 1.507191{col 38}{space 1}   -0.20{col 47}{space 3}0.851{col 55}{space 4}-4.486941{col 68}{space 3} 3.882325
{txt}{space 8}lag23 {c |}{col 15}{res}{space 2} .3888608{col 27}{space 2} 1.788805{col 38}{space 1}    0.22{col 47}{space 3}0.839{col 55}{space 4}-4.577658{col 68}{space 3} 5.355379
{txt}{space 8}lag24 {c |}{col 15}{res}{space 2} 4.554615{col 27}{space 2} 1.040984{col 38}{space 1}    4.38{col 47}{space 3}0.012{col 55}{space 4}  1.66438{col 68}{space 3}  7.44485
{txt}{space 8}lag25 {c |}{col 15}{res}{space 2} 5.265539{col 27}{space 2}   1.1781{col 38}{space 1}    4.47{col 47}{space 3}0.011{col 55}{space 4} 1.994608{col 68}{space 3} 8.536469
{txt}{space 8}lag26 {c |}{col 15}{res}{space 2} 1.728244{col 27}{space 2} 2.002963{col 38}{space 1}    0.86{col 47}{space 3}0.437{col 55}{space 4}-3.832872{col 68}{space 3}  7.28936
{txt}{space 8}lag27 {c |}{col 15}{res}{space 2}-2.390658{col 27}{space 2} 3.753557{col 38}{space 1}   -0.64{col 47}{space 3}0.559{col 55}{space 4} -12.8122{col 68}{space 3} 8.030887
{txt}{space 8}lag28 {c |}{col 15}{res}{space 2} 4.818569{col 27}{space 2} 4.165104{col 38}{space 1}    1.16{col 47}{space 3}0.312{col 55}{space 4}-6.745612{col 68}{space 3} 16.38275
{txt}{space 8}lag29 {c |}{col 15}{res}{space 2} 12.37691{col 27}{space 2}  5.67382{col 38}{space 1}    2.18{col 47}{space 3}0.095{col 55}{space 4}-3.376137{col 68}{space 3} 28.12996
{txt}{space 8}lag30 {c |}{col 15}{res}{space 2}-1.883831{col 27}{space 2} 5.471159{col 38}{space 1}   -0.34{col 47}{space 3}0.748{col 55}{space 4} -17.0742{col 68}{space 3} 13.30654
{txt}{space 8}lag31 {c |}{col 15}{res}{space 2} 1.310695{col 27}{space 2} .6395781{col 38}{space 1}    2.05{col 47}{space 3}0.110{col 55}{space 4} -.465058{col 68}{space 3} 3.086449
{txt}{space 8}lag32 {c |}{col 15}{res}{space 2} .7576377{col 27}{space 2} 2.180697{col 38}{space 1}    0.35{col 47}{space 3}0.746{col 55}{space 4}-5.296948{col 68}{space 3} 6.812223
{txt}{space 8}lag33 {c |}{col 15}{res}{space 2} 2.941804{col 27}{space 2} 2.729475{col 38}{space 1}    1.08{col 47}{space 3}0.342{col 55}{space 4}-4.636432{col 68}{space 3} 10.52004
{txt}{space 8}lag34 {c |}{col 15}{res}{space 2}-4.656812{col 27}{space 2} 2.352983{col 38}{space 1}   -1.98{col 47}{space 3}0.119{col 55}{space 4}-11.18974{col 68}{space 3} 1.876117
{txt}{space 8}lag35 {c |}{col 15}{res}{space 2}   -2.924{col 27}{space 2} 2.547916{col 38}{space 1}   -1.15{col 47}{space 3}0.315{col 55}{space 4}-9.998149{col 68}{space 3} 4.150149
{txt}{space 8}lag36 {c |}{col 15}{res}{space 2}  3.98596{col 27}{space 2} 2.139555{col 38}{space 1}    1.86{col 47}{space 3}0.136{col 55}{space 4}-1.954397{col 68}{space 3} 9.926316
{txt}{space 8}lag37 {c |}{col 15}{res}{space 2} 10.27315{col 27}{space 2} 1.078709{col 38}{space 1}    9.52{col 47}{space 3}0.001{col 55}{space 4} 7.278176{col 68}{space 3} 13.26813
{txt}{space 8}lag38 {c |}{col 15}{res}{space 2}-1.522724{col 27}{space 2} 3.289997{col 38}{space 1}   -0.46{col 47}{space 3}0.668{col 55}{space 4}-10.65722{col 68}{space 3} 7.611773
{txt}{space 8}lag39 {c |}{col 15}{res}{space 2}-2.304183{col 27}{space 2} 1.982912{col 38}{space 1}   -1.16{col 47}{space 3}0.310{col 55}{space 4}-7.809628{col 68}{space 3} 3.201262
{txt}{space 8}lag40 {c |}{col 15}{res}{space 2}-2.923306{col 27}{space 2} 3.220638{col 38}{space 1}   -0.91{col 47}{space 3}0.415{col 55}{space 4}-11.86523{col 68}{space 3} 6.018619
{txt}{space 8}lag41 {c |}{col 15}{res}{space 2} .6898378{col 27}{space 2} 3.884258{col 38}{space 1}    0.18{col 47}{space 3}0.868{col 55}{space 4}-10.09459{col 68}{space 3} 11.47427
{txt}{space 8}lag42 {c |}{col 15}{res}{space 2}-4.043118{col 27}{space 2} 6.076617{col 38}{space 1}   -0.67{col 47}{space 3}0.542{col 55}{space 4}-20.91451{col 68}{space 3} 12.82827
{txt}{space 8}lag43 {c |}{col 15}{res}{space 2}-2.605529{col 27}{space 2} 1.888108{col 38}{space 1}   -1.38{col 47}{space 3}0.240{col 55}{space 4}-7.847756{col 68}{space 3} 2.636699
{txt}{space 8}lag44 {c |}{col 15}{res}{space 2}-1.795159{col 27}{space 2}  3.28399{col 38}{space 1}   -0.55{col 47}{space 3}0.614{col 55}{space 4}-10.91298{col 68}{space 3} 7.322659
{txt}{space 8}lag45 {c |}{col 15}{res}{space 2} 5.127578{col 27}{space 2}  6.48043{col 38}{space 1}    0.79{col 47}{space 3}0.473{col 55}{space 4}-12.86498{col 68}{space 3} 23.12014
{txt}{space 8}lag46 {c |}{col 15}{res}{space 2} 3.612134{col 27}{space 2} 1.283111{col 38}{space 1}    2.82{col 47}{space 3}0.048{col 55}{space 4} .0496464{col 68}{space 3} 7.174621
{txt}{space 8}lag47 {c |}{col 15}{res}{space 2} 6.152503{col 27}{space 2} 2.920432{col 38}{space 1}    2.11{col 47}{space 3}0.103{col 55}{space 4}-1.955917{col 68}{space 3} 14.26092
{txt}{space 8}lag48 {c |}{col 15}{res}{space 2}-3.767751{col 27}{space 2} 6.280553{col 38}{space 1}   -0.60{col 47}{space 3}0.581{col 55}{space 4}-21.20536{col 68}{space 3} 13.66986
{txt}{space 8}lag49 {c |}{col 15}{res}{space 2}-2.016943{col 27}{space 2} 2.606149{col 38}{space 1}   -0.77{col 47}{space 3}0.482{col 55}{space 4}-9.252774{col 68}{space 3} 5.218887
{txt}{space 8}lag50 {c |}{col 15}{res}{space 2}-8.922205{col 27}{space 2} 5.410372{col 38}{space 1}   -1.65{col 47}{space 3}0.174{col 55}{space 4}-23.94381{col 68}{space 3} 6.099397
{txt}{space 8}lag51 {c |}{col 15}{res}{space 2}-8.560822{col 27}{space 2} 3.855581{col 38}{space 1}   -2.22{col 47}{space 3}0.091{col 55}{space 4}-19.26563{col 68}{space 3} 2.143988
{txt}{space 8}lag52 {c |}{col 15}{res}{space 2} 2.773388{col 27}{space 2}  4.75417{col 38}{space 1}    0.58{col 47}{space 3}0.591{col 55}{space 4} -10.4263{col 68}{space 3} 15.97308
{txt}{space 8}lag53 {c |}{col 15}{res}{space 2} -3.60076{col 27}{space 2} 3.931902{col 38}{space 1}   -0.92{col 47}{space 3}0.412{col 55}{space 4}-14.51747{col 68}{space 3}  7.31595
{txt}{space 8}lag54 {c |}{col 15}{res}{space 2} 2.176463{col 27}{space 2} 2.046819{col 38}{space 1}    1.06{col 47}{space 3}0.348{col 55}{space 4}-3.506419{col 68}{space 3} 7.859344
{txt}{space 8}lag55 {c |}{col 15}{res}{space 2}-3.058946{col 27}{space 2} 4.245941{col 38}{space 1}   -0.72{col 47}{space 3}0.511{col 55}{space 4}-14.84757{col 68}{space 3} 8.729675
{txt}{space 8}lag56 {c |}{col 15}{res}{space 2} 9.113021{col 27}{space 2}  2.14392{col 38}{space 1}    4.25{col 47}{space 3}0.013{col 55}{space 4} 3.160545{col 68}{space 3}  15.0655
{txt}{space 8}lag57 {c |}{col 15}{res}{space 2}-1.434475{col 27}{space 2} 3.119316{col 38}{space 1}   -0.46{col 47}{space 3}0.669{col 55}{space 4}-10.09508{col 68}{space 3} 7.226134
{txt}{space 8}lag58 {c |}{col 15}{res}{space 2}-1.545323{col 27}{space 2} 3.091893{col 38}{space 1}   -0.50{col 47}{space 3}0.643{col 55}{space 4}-10.12979{col 68}{space 3} 7.039149
{txt}{space 8}lag59 {c |}{col 15}{res}{space 2} .8471751{col 27}{space 2}  2.73869{col 38}{space 1}    0.31{col 47}{space 3}0.773{col 55}{space 4}-6.756646{col 68}{space 3} 8.450997
{txt}{space 8}lag60 {c |}{col 15}{res}{space 2}-.8975529{col 27}{space 2} 2.236315{col 38}{space 1}   -0.40{col 47}{space 3}0.709{col 55}{space 4}-7.106558{col 68}{space 3} 5.311453
{txt}{space 8}lag61 {c |}{col 15}{res}{space 2} -6.18489{col 27}{space 2} 6.605268{col 38}{space 1}   -0.94{col 47}{space 3}0.402{col 55}{space 4}-24.52406{col 68}{space 3} 12.15427
{txt}{space 8}lag62 {c |}{col 15}{res}{space 2} .8390474{col 27}{space 2}   4.1385{col 38}{space 1}    0.20{col 47}{space 3}0.849{col 55}{space 4}-10.65127{col 68}{space 3} 12.32937
{txt}{space 8}lag63 {c |}{col 15}{res}{space 2} -1.85576{col 27}{space 2} 4.912242{col 38}{space 1}   -0.38{col 47}{space 3}0.725{col 55}{space 4}-15.49433{col 68}{space 3} 11.78281
{txt}{space 8}lag64 {c |}{col 15}{res}{space 2}-1.896328{col 27}{space 2} 5.946352{col 38}{space 1}   -0.32{col 47}{space 3}0.766{col 55}{space 4}-18.40605{col 68}{space 3} 14.61339
{txt}{space 8}lag65 {c |}{col 15}{res}{space 2} -10.1164{col 27}{space 2} 4.703653{col 38}{space 1}   -2.15{col 47}{space 3}0.098{col 55}{space 4}-23.17583{col 68}{space 3} 2.943038
{txt}{space 8}lag66 {c |}{col 15}{res}{space 2} 3.666353{col 27}{space 2} 7.367012{col 38}{space 1}    0.50{col 47}{space 3}0.645{col 55}{space 4}-16.78775{col 68}{space 3} 24.12046
{txt}{space 8}lag67 {c |}{col 15}{res}{space 2} 1.303624{col 27}{space 2} 8.025325{col 38}{space 1}    0.16{col 47}{space 3}0.879{col 55}{space 4}-20.97825{col 68}{space 3}  23.5855
{txt}{space 8}lag68 {c |}{col 15}{res}{space 2} 3.349838{col 27}{space 2} 7.291774{col 38}{space 1}    0.46{col 47}{space 3}0.670{col 55}{space 4}-16.89537{col 68}{space 3} 23.59505
{txt}{space 8}lag69 {c |}{col 15}{res}{space 2}-4.571535{col 27}{space 2} 2.626551{col 38}{space 1}   -1.74{col 47}{space 3}0.157{col 55}{space 4}-11.86401{col 68}{space 3}  2.72094
{txt}{space 8}lag70 {c |}{col 15}{res}{space 2}-5.465138{col 27}{space 2} 5.157031{col 38}{space 1}   -1.06{col 47}{space 3}0.349{col 55}{space 4}-19.78335{col 68}{space 3} 8.853074
{txt}{space 8}lag71 {c |}{col 15}{res}{space 2}-6.757605{col 27}{space 2} 4.614307{col 38}{space 1}   -1.46{col 47}{space 3}0.217{col 55}{space 4}-19.56897{col 68}{space 3} 6.053763
{txt}{space 8}lag72 {c |}{col 15}{res}{space 2}-4.761097{col 27}{space 2} 2.840141{col 38}{space 1}   -1.68{col 47}{space 3}0.169{col 55}{space 4}-12.64659{col 68}{space 3} 3.124397
{txt}{space 8}lag73 {c |}{col 15}{res}{space 2}-5.112718{col 27}{space 2} 4.949466{col 38}{space 1}   -1.03{col 47}{space 3}0.360{col 55}{space 4}-18.85464{col 68}{space 3} 8.629203
{txt}{space 8}lag74 {c |}{col 15}{res}{space 2} -2.92836{col 27}{space 2} 5.855202{col 38}{space 1}   -0.50{col 47}{space 3}0.643{col 55}{space 4}-19.18501{col 68}{space 3} 13.32829
{txt}{space 8}lag75 {c |}{col 15}{res}{space 2} .1996648{col 27}{space 2} 5.749548{col 38}{space 1}    0.03{col 47}{space 3}0.974{col 55}{space 4}-15.76364{col 68}{space 3} 16.16297
{txt}{space 8}lag76 {c |}{col 15}{res}{space 2}-4.239908{col 27}{space 2} 4.190047{col 38}{space 1}   -1.01{col 47}{space 3}0.369{col 55}{space 4}-15.87334{col 68}{space 3} 7.393526
{txt}{space 8}lag77 {c |}{col 15}{res}{space 2}  -7.9293{col 27}{space 2} 3.470353{col 38}{space 1}   -2.28{col 47}{space 3}0.084{col 55}{space 4}-17.56455{col 68}{space 3} 1.705945
{txt}{space 8}lag78 {c |}{col 15}{res}{space 2}-1.347338{col 27}{space 2} 9.687125{col 38}{space 1}   -0.14{col 47}{space 3}0.896{col 55}{space 4}-28.24311{col 68}{space 3} 25.54843
{txt}{space 8}lag79 {c |}{col 15}{res}{space 2}-5.365835{col 27}{space 2} 3.879417{col 38}{space 1}   -1.38{col 47}{space 3}0.239{col 55}{space 4}-16.13682{col 68}{space 3} 5.405154
{txt}{space 8}lag80 {c |}{col 15}{res}{space 2}-1.802591{col 27}{space 2} 3.440263{col 38}{space 1}   -0.52{col 47}{space 3}0.628{col 55}{space 4}-11.35429{col 68}{space 3} 7.749109
{txt}{space 8}lag81 {c |}{col 15}{res}{space 2} 2.305588{col 27}{space 2}  5.84268{col 38}{space 1}    0.39{col 47}{space 3}0.713{col 55}{space 4}-13.91629{col 68}{space 3} 18.52747
{txt}{space 8}lag82 {c |}{col 15}{res}{space 2}-4.231532{col 27}{space 2}  4.24249{col 38}{space 1}   -1.00{col 47}{space 3}0.375{col 55}{space 4}-16.01057{col 68}{space 3} 7.547508
{txt}{space 8}lag83 {c |}{col 15}{res}{space 2} 8.406855{col 27}{space 2} 4.141904{col 38}{space 1}    2.03{col 47}{space 3}0.112{col 55}{space 4}-3.092913{col 68}{space 3} 19.90662
{txt}{space 8}lag84 {c |}{col 15}{res}{space 2} 4.547258{col 27}{space 2}  1.28135{col 38}{space 1}    3.55{col 47}{space 3}0.024{col 55}{space 4} .9896603{col 68}{space 3} 8.104856
{txt}{space 8}lag85 {c |}{col 15}{res}{space 2}-5.425476{col 27}{space 2} 5.263458{col 38}{space 1}   -1.03{col 47}{space 3}0.361{col 55}{space 4}-20.03918{col 68}{space 3} 9.188226
{txt}{space 8}lag86 {c |}{col 15}{res}{space 2}-8.998029{col 27}{space 2} 5.403854{col 38}{space 1}   -1.67{col 47}{space 3}0.171{col 55}{space 4}-24.00153{col 68}{space 3} 6.005476
{txt}{space 8}lag87 {c |}{col 15}{res}{space 2}-5.936232{col 27}{space 2}  7.55934{col 38}{space 1}   -0.79{col 47}{space 3}0.476{col 55}{space 4}-26.92432{col 68}{space 3} 15.05186
{txt}{space 8}lag88 {c |}{col 15}{res}{space 2}-6.238226{col 27}{space 2} 6.325772{col 38}{space 1}   -0.99{col 47}{space 3}0.380{col 55}{space 4}-23.80138{col 68}{space 3} 11.32493
{txt}{space 8}lag89 {c |}{col 15}{res}{space 2} 7.285762{col 27}{space 2} 8.182887{col 38}{space 1}    0.89{col 47}{space 3}0.424{col 55}{space 4}-15.43357{col 68}{space 3}  30.0051
{txt}{space 8}lag90 {c |}{col 15}{res}{space 2}-3.503281{col 27}{space 2}  3.88914{col 38}{space 1}   -0.90{col 47}{space 3}0.419{col 55}{space 4}-14.30126{col 68}{space 3} 7.294702
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}-114.0883{col 27}{space 2} 24.33543{col 38}{space 1}   -4.69{col 47}{space 3}0.009{col 55}{space 4}-181.6543{col 68}{space 3}-46.52232
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}   regionid1{col 14}{c |}{space 1}        5{col 27}{space 1}        5{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}        date{col 14}{c |}{space 1}     2707{col 27}{space 1}        1{col 39}{result}{space 1}     2706{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. graph export "results/EventStudy-MiddayCO2-DST-Start.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/simonpostler/Desktop/applied-econometrics-dst-master-2/results/EventStudy-MiddayCO2-DST-Start.png{rm}
saved as
PNG
format
{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/6h/778gphg5533gk87_wkb11wqh0000gn/T//SD01922.000000"
{txt}
{com}. use "data/06-half-hourly.dta", clear
{txt}
{com}. gen timevar = .
{txt}(1,264,072 missing values generated)

{com}. replace timevar = days_into_dst if dst_here_anytime == 1
{txt}(1,011,256 real changes made)

{com}. drop if dst_start !=0 //DST stop so only January to June direction
{txt}(649,560 observations deleted)

{com}. 
. eventdd co2_g_per_capita_vs_midday public_holiday c.temperature##c.temperature solar_exposure wind_3 [aweight = population], timevar(timevar) method(hdfe, absorb(regionid1 date) cluster(regionid1)) graph_op(ytitle("Co2 kg per capita") xtitle("Days until DST transition") title("Event Study - CO2 - Midday Normalised - DST Stop Direction"))
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}{txt}warning: missing F statistic; dropped variables due to collinearity or too few clusters
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}   614,512
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F( 190,      4)}{col 67}=          {res}.
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.2083
{txt}{col 51}Adj R-squared{col 67}= {res}    0.2047
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0169
{txt}{col 1}Number of clusters ({res}regionid1{txt}) {col 30}= {res}         5{txt}{col 51}Root MSE{col 67}= {res}   57.2855

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}co2_g_per_c~y{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
public_holi~y {c |}{col 15}{res}{space 2} 11.37054{col 27}{space 2} 2.921292{col 38}{space 1}    3.89{col 47}{space 3}0.018{col 55}{space 4} 3.259732{col 68}{space 3} 19.48135
{txt}{space 2}temperature {c |}{col 15}{res}{space 2} 10.71004{col 27}{space 2} 1.367025{col 38}{space 1}    7.83{col 47}{space 3}0.001{col 55}{space 4} 6.914566{col 68}{space 3} 14.50551
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2}-.2151273{col 27}{space 2} .0215265{col 38}{space 1}   -9.99{col 47}{space 3}0.001{col 55}{space 4}-.2748944{col 68}{space 3}-.1553602
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2} 2.698994{col 27}{space 2} .5592476{col 38}{space 1}    4.83{col 47}{space 3}0.008{col 55}{space 4} 1.146274{col 68}{space 3} 4.251714
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2}-.5270479{col 27}{space 2} .9140249{col 38}{space 1}   -0.58{col 47}{space 3}0.595{col 55}{space 4}-3.064788{col 68}{space 3} 2.010692
{txt}{space 7}lead94 {c |}{col 15}{res}{space 2} 1.488412{col 27}{space 2} 7.021298{col 38}{space 1}    0.21{col 47}{space 3}0.842{col 55}{space 4}-18.00584{col 68}{space 3} 20.98266
{txt}{space 7}lead93 {c |}{col 15}{res}{space 2}-14.17003{col 27}{space 2} 3.405975{col 38}{space 1}   -4.16{col 47}{space 3}0.014{col 55}{space 4}-23.62653{col 68}{space 3}-4.713526
{txt}{space 7}lead92 {c |}{col 15}{res}{space 2} 17.43758{col 27}{space 2} 13.57496{col 38}{space 1}    1.28{col 47}{space 3}0.268{col 55}{space 4}-20.25256{col 68}{space 3} 55.12772
{txt}{space 7}lead91 {c |}{col 15}{res}{space 2}-2.570822{col 27}{space 2} 3.030825{col 38}{space 1}   -0.85{col 47}{space 3}0.444{col 55}{space 4}-10.98574{col 68}{space 3} 5.844097
{txt}{space 7}lead90 {c |}{col 15}{res}{space 2} 10.77243{col 27}{space 2} 8.079013{col 38}{space 1}    1.33{col 47}{space 3}0.253{col 55}{space 4} -11.6585{col 68}{space 3} 33.20337
{txt}{space 7}lead89 {c |}{col 15}{res}{space 2} 6.745763{col 27}{space 2} 8.513977{col 38}{space 1}    0.79{col 47}{space 3}0.473{col 55}{space 4}-16.89283{col 68}{space 3} 30.38435
{txt}{space 7}lead88 {c |}{col 15}{res}{space 2} 18.22272{col 27}{space 2} 5.220521{col 38}{space 1}    3.49{col 47}{space 3}0.025{col 55}{space 4} 3.728234{col 68}{space 3} 32.71721
{txt}{space 7}lead87 {c |}{col 15}{res}{space 2} 4.386863{col 27}{space 2} 2.068832{col 38}{space 1}    2.12{col 47}{space 3}0.101{col 55}{space 4}-1.357136{col 68}{space 3} 10.13086
{txt}{space 7}lead86 {c |}{col 15}{res}{space 2} -.980248{col 27}{space 2}  3.69958{col 38}{space 1}   -0.26{col 47}{space 3}0.804{col 55}{space 4}-11.25193{col 68}{space 3} 9.291432
{txt}{space 7}lead85 {c |}{col 15}{res}{space 2}-4.635468{col 27}{space 2} 7.200187{col 38}{space 1}   -0.64{col 47}{space 3}0.555{col 55}{space 4}-24.62639{col 68}{space 3} 15.35546
{txt}{space 7}lead84 {c |}{col 15}{res}{space 2} 8.372274{col 27}{space 2} 10.16484{col 38}{space 1}    0.82{col 47}{space 3}0.456{col 55}{space 4}-19.84985{col 68}{space 3}  36.5944
{txt}{space 7}lead83 {c |}{col 15}{res}{space 2} 4.554071{col 27}{space 2}  7.35681{col 38}{space 1}    0.62{col 47}{space 3}0.569{col 55}{space 4}-15.87171{col 68}{space 3} 24.97985
{txt}{space 7}lead82 {c |}{col 15}{res}{space 2} 3.543466{col 27}{space 2} 4.716836{col 38}{space 1}    0.75{col 47}{space 3}0.494{col 55}{space 4}-9.552569{col 68}{space 3}  16.6395
{txt}{space 7}lead81 {c |}{col 15}{res}{space 2} 1.692034{col 27}{space 2} 6.010757{col 38}{space 1}    0.28{col 47}{space 3}0.792{col 55}{space 4} -14.9965{col 68}{space 3} 18.38057
{txt}{space 7}lead80 {c |}{col 15}{res}{space 2}-8.054126{col 27}{space 2}   8.2675{col 38}{space 1}   -0.97{col 47}{space 3}0.385{col 55}{space 4}-31.00839{col 68}{space 3} 14.90013
{txt}{space 7}lead79 {c |}{col 15}{res}{space 2}-2.474918{col 27}{space 2} 4.870658{col 38}{space 1}   -0.51{col 47}{space 3}0.638{col 55}{space 4}-15.99803{col 68}{space 3}  11.0482
{txt}{space 7}lead78 {c |}{col 15}{res}{space 2} -7.51448{col 27}{space 2} 4.794857{col 38}{space 1}   -1.57{col 47}{space 3}0.192{col 55}{space 4}-20.82714{col 68}{space 3} 5.798177
{txt}{space 7}lead77 {c |}{col 15}{res}{space 2} 3.297162{col 27}{space 2} 5.349201{col 38}{space 1}    0.62{col 47}{space 3}0.571{col 55}{space 4} -11.5546{col 68}{space 3} 18.14892
{txt}{space 7}lead76 {c |}{col 15}{res}{space 2}-3.786349{col 27}{space 2} 6.510725{col 38}{space 1}   -0.58{col 47}{space 3}0.592{col 55}{space 4}-21.86302{col 68}{space 3} 14.29032
{txt}{space 7}lead75 {c |}{col 15}{res}{space 2} -2.48645{col 27}{space 2}  7.70108{col 38}{space 1}   -0.32{col 47}{space 3}0.763{col 55}{space 4}-23.86807{col 68}{space 3} 18.89517
{txt}{space 7}lead74 {c |}{col 15}{res}{space 2} 3.999939{col 27}{space 2} 4.552811{col 38}{space 1}    0.88{col 47}{space 3}0.429{col 55}{space 4}-8.640692{col 68}{space 3} 16.64057
{txt}{space 7}lead73 {c |}{col 15}{res}{space 2}-.1454553{col 27}{space 2} 4.290667{col 38}{space 1}   -0.03{col 47}{space 3}0.975{col 55}{space 4}-12.05826{col 68}{space 3} 11.76735
{txt}{space 7}lead72 {c |}{col 15}{res}{space 2} 1.703892{col 27}{space 2} 5.541316{col 38}{space 1}    0.31{col 47}{space 3}0.774{col 55}{space 4}-13.68127{col 68}{space 3} 17.08905
{txt}{space 7}lead71 {c |}{col 15}{res}{space 2}  2.74054{col 27}{space 2}  6.47495{col 38}{space 1}    0.42{col 47}{space 3}0.694{col 55}{space 4} -15.2368{col 68}{space 3} 20.71788
{txt}{space 7}lead70 {c |}{col 15}{res}{space 2}  6.03824{col 27}{space 2} 5.984911{col 38}{space 1}    1.01{col 47}{space 3}0.370{col 55}{space 4}-10.57854{col 68}{space 3} 22.65502
{txt}{space 7}lead69 {c |}{col 15}{res}{space 2} .4780601{col 27}{space 2} 7.655478{col 38}{space 1}    0.06{col 47}{space 3}0.953{col 55}{space 4}-20.77695{col 68}{space 3} 21.73307
{txt}{space 7}lead68 {c |}{col 15}{res}{space 2}-8.196919{col 27}{space 2} 4.113774{col 38}{space 1}   -1.99{col 47}{space 3}0.117{col 55}{space 4}-19.61859{col 68}{space 3} 3.224747
{txt}{space 7}lead67 {c |}{col 15}{res}{space 2}-4.107058{col 27}{space 2} 4.518557{col 38}{space 1}   -0.91{col 47}{space 3}0.415{col 55}{space 4}-16.65258{col 68}{space 3} 8.438469
{txt}{space 7}lead66 {c |}{col 15}{res}{space 2} .8534353{col 27}{space 2} 2.363662{col 38}{space 1}    0.36{col 47}{space 3}0.736{col 55}{space 4}-5.709143{col 68}{space 3} 7.416013
{txt}{space 7}lead65 {c |}{col 15}{res}{space 2}  -3.0207{col 27}{space 2} 4.319705{col 38}{space 1}   -0.70{col 47}{space 3}0.523{col 55}{space 4}-15.01412{col 68}{space 3} 8.972725
{txt}{space 7}lead64 {c |}{col 15}{res}{space 2} 2.034823{col 27}{space 2} 4.481705{col 38}{space 1}    0.45{col 47}{space 3}0.673{col 55}{space 4}-10.40839{col 68}{space 3} 14.47803
{txt}{space 7}lead63 {c |}{col 15}{res}{space 2} 8.507057{col 27}{space 2} 5.188926{col 38}{space 1}    1.64{col 47}{space 3}0.176{col 55}{space 4} -5.89971{col 68}{space 3} 22.91382
{txt}{space 7}lead62 {c |}{col 15}{res}{space 2} 5.681447{col 27}{space 2} 2.461778{col 38}{space 1}    2.31{col 47}{space 3}0.082{col 55}{space 4}-1.153546{col 68}{space 3} 12.51644
{txt}{space 7}lead61 {c |}{col 15}{res}{space 2} 5.116827{col 27}{space 2} 6.154065{col 38}{space 1}    0.83{col 47}{space 3}0.452{col 55}{space 4} -11.9696{col 68}{space 3} 22.20325
{txt}{space 7}lead60 {c |}{col 15}{res}{space 2} 1.669988{col 27}{space 2} 5.796101{col 38}{space 1}    0.29{col 47}{space 3}0.788{col 55}{space 4}-14.42257{col 68}{space 3} 17.76255
{txt}{space 7}lead59 {c |}{col 15}{res}{space 2} -1.81896{col 27}{space 2} 5.402631{col 38}{space 1}   -0.34{col 47}{space 3}0.753{col 55}{space 4}-16.81907{col 68}{space 3} 13.18115
{txt}{space 7}lead58 {c |}{col 15}{res}{space 2}  -4.6913{col 27}{space 2} 5.096837{col 38}{space 1}   -0.92{col 47}{space 3}0.409{col 55}{space 4}-18.84239{col 68}{space 3} 9.459787
{txt}{space 7}lead57 {c |}{col 15}{res}{space 2}-.5313511{col 27}{space 2} 6.253804{col 38}{space 1}   -0.08{col 47}{space 3}0.936{col 55}{space 4} -17.8947{col 68}{space 3} 16.83199
{txt}{space 7}lead56 {c |}{col 15}{res}{space 2}-2.283377{col 27}{space 2}  7.10603{col 38}{space 1}   -0.32{col 47}{space 3}0.764{col 55}{space 4}-22.01288{col 68}{space 3} 17.44612
{txt}{space 7}lead55 {c |}{col 15}{res}{space 2}  4.23138{col 27}{space 2} 5.865517{col 38}{space 1}    0.72{col 47}{space 3}0.511{col 55}{space 4}-12.05391{col 68}{space 3} 20.51667
{txt}{space 7}lead54 {c |}{col 15}{res}{space 2}-2.493396{col 27}{space 2} 5.586542{col 38}{space 1}   -0.45{col 47}{space 3}0.678{col 55}{space 4}-18.00412{col 68}{space 3} 13.01733
{txt}{space 7}lead53 {c |}{col 15}{res}{space 2} -1.37088{col 27}{space 2} 5.302128{col 38}{space 1}   -0.26{col 47}{space 3}0.809{col 55}{space 4}-16.09195{col 68}{space 3} 13.35019
{txt}{space 7}lead52 {c |}{col 15}{res}{space 2}-4.434721{col 27}{space 2} 7.331442{col 38}{space 1}   -0.60{col 47}{space 3}0.578{col 55}{space 4}-24.79007{col 68}{space 3} 15.92062
{txt}{space 7}lead51 {c |}{col 15}{res}{space 2} .8518001{col 27}{space 2} 5.516872{col 38}{space 1}    0.15{col 47}{space 3}0.885{col 55}{space 4}-14.46549{col 68}{space 3} 16.16909
{txt}{space 7}lead50 {c |}{col 15}{res}{space 2}-2.635462{col 27}{space 2} 4.419173{col 38}{space 1}   -0.60{col 47}{space 3}0.583{col 55}{space 4}-14.90505{col 68}{space 3} 9.634129
{txt}{space 7}lead49 {c |}{col 15}{res}{space 2} -3.28275{col 27}{space 2}  4.52584{col 38}{space 1}   -0.73{col 47}{space 3}0.508{col 55}{space 4} -15.8485{col 68}{space 3} 9.282996
{txt}{space 7}lead48 {c |}{col 15}{res}{space 2}-4.870424{col 27}{space 2} 1.455195{col 38}{space 1}   -3.35{col 47}{space 3}0.029{col 55}{space 4}-8.910693{col 68}{space 3}-.8301552
{txt}{space 7}lead47 {c |}{col 15}{res}{space 2}-10.01965{col 27}{space 2} .5274032{col 38}{space 1}  -19.00{col 47}{space 3}0.000{col 55}{space 4}-11.48396{col 68}{space 3}-8.555349
{txt}{space 7}lead46 {c |}{col 15}{res}{space 2} 2.126538{col 27}{space 2} 4.325074{col 38}{space 1}    0.49{col 47}{space 3}0.649{col 55}{space 4}-9.881791{col 68}{space 3} 14.13487
{txt}{space 7}lead45 {c |}{col 15}{res}{space 2} 5.805046{col 27}{space 2} 2.099241{col 38}{space 1}    2.77{col 47}{space 3}0.051{col 55}{space 4}-.0233814{col 68}{space 3} 11.63347
{txt}{space 7}lead44 {c |}{col 15}{res}{space 2} .4761012{col 27}{space 2} 6.320203{col 38}{space 1}    0.08{col 47}{space 3}0.944{col 55}{space 4} -17.0716{col 68}{space 3}  18.0238
{txt}{space 7}lead43 {c |}{col 15}{res}{space 2}-6.112833{col 27}{space 2} 1.988926{col 38}{space 1}   -3.07{col 47}{space 3}0.037{col 55}{space 4}-11.63498{col 68}{space 3}-.5906889
{txt}{space 7}lead42 {c |}{col 15}{res}{space 2} 2.833515{col 27}{space 2} 3.592076{col 38}{space 1}    0.79{col 47}{space 3}0.474{col 55}{space 4}-7.139687{col 68}{space 3} 12.80672
{txt}{space 7}lead41 {c |}{col 15}{res}{space 2}-1.862547{col 27}{space 2} 3.641343{col 38}{space 1}   -0.51{col 47}{space 3}0.636{col 55}{space 4}-11.97254{col 68}{space 3} 8.247443
{txt}{space 7}lead40 {c |}{col 15}{res}{space 2}-1.455394{col 27}{space 2} 5.583392{col 38}{space 1}   -0.26{col 47}{space 3}0.807{col 55}{space 4}-16.95737{col 68}{space 3} 14.04659
{txt}{space 7}lead39 {c |}{col 15}{res}{space 2}-2.026074{col 27}{space 2} 5.040312{col 38}{space 1}   -0.40{col 47}{space 3}0.708{col 55}{space 4}-16.02022{col 68}{space 3} 11.96808
{txt}{space 7}lead38 {c |}{col 15}{res}{space 2} 5.156986{col 27}{space 2} 1.440813{col 38}{space 1}    3.58{col 47}{space 3}0.023{col 55}{space 4} 1.156647{col 68}{space 3} 9.157325
{txt}{space 7}lead37 {c |}{col 15}{res}{space 2}-1.210674{col 27}{space 2} 1.753037{col 38}{space 1}   -0.69{col 47}{space 3}0.528{col 55}{space 4}-6.077886{col 68}{space 3} 3.656538
{txt}{space 7}lead36 {c |}{col 15}{res}{space 2}-5.110643{col 27}{space 2} 4.768251{col 38}{space 1}   -1.07{col 47}{space 3}0.344{col 55}{space 4}-18.34943{col 68}{space 3} 8.128146
{txt}{space 7}lead35 {c |}{col 15}{res}{space 2} 7.754414{col 27}{space 2} 3.329647{col 38}{space 1}    2.33{col 47}{space 3}0.080{col 55}{space 4}-1.490167{col 68}{space 3}   16.999
{txt}{space 7}lead34 {c |}{col 15}{res}{space 2} .5892555{col 27}{space 2} 5.428315{col 38}{space 1}    0.11{col 47}{space 3}0.919{col 55}{space 4}-14.48216{col 68}{space 3} 15.66067
{txt}{space 7}lead33 {c |}{col 15}{res}{space 2}-.7568643{col 27}{space 2}  1.15704{col 38}{space 1}   -0.65{col 47}{space 3}0.549{col 55}{space 4}-3.969321{col 68}{space 3} 2.455592
{txt}{space 7}lead32 {c |}{col 15}{res}{space 2} .1549715{col 27}{space 2} 2.251427{col 38}{space 1}    0.07{col 47}{space 3}0.948{col 55}{space 4}-6.095993{col 68}{space 3} 6.405936
{txt}{space 7}lead31 {c |}{col 15}{res}{space 2}-.0363731{col 27}{space 2} 3.654117{col 38}{space 1}   -0.01{col 47}{space 3}0.993{col 55}{space 4}-10.18183{col 68}{space 3} 10.10908
{txt}{space 7}lead30 {c |}{col 15}{res}{space 2} 1.594485{col 27}{space 2} 3.275867{col 38}{space 1}    0.49{col 47}{space 3}0.652{col 55}{space 4}-7.500779{col 68}{space 3} 10.68975
{txt}{space 7}lead29 {c |}{col 15}{res}{space 2} 1.969829{col 27}{space 2}  3.48525{col 38}{space 1}    0.57{col 47}{space 3}0.602{col 55}{space 4}-7.706777{col 68}{space 3} 11.64644
{txt}{space 7}lead28 {c |}{col 15}{res}{space 2} 2.693098{col 27}{space 2} 3.777757{col 38}{space 1}    0.71{col 47}{space 3}0.515{col 55}{space 4}-7.795636{col 68}{space 3} 13.18183
{txt}{space 7}lead27 {c |}{col 15}{res}{space 2} 6.607202{col 27}{space 2} 2.543737{col 38}{space 1}    2.60{col 47}{space 3}0.060{col 55}{space 4}-.4553431{col 68}{space 3} 13.66975
{txt}{space 7}lead26 {c |}{col 15}{res}{space 2}  2.48634{col 27}{space 2} 4.423866{col 38}{space 1}    0.56{col 47}{space 3}0.604{col 55}{space 4}-9.796281{col 68}{space 3} 14.76896
{txt}{space 7}lead25 {c |}{col 15}{res}{space 2}-6.133302{col 27}{space 2} 1.727485{col 38}{space 1}   -3.55{col 47}{space 3}0.024{col 55}{space 4}-10.92957{col 68}{space 3}-1.337035
{txt}{space 7}lead24 {c |}{col 15}{res}{space 2}-1.798926{col 27}{space 2} 1.807307{col 38}{space 1}   -1.00{col 47}{space 3}0.376{col 55}{space 4}-6.816816{col 68}{space 3} 3.218963
{txt}{space 7}lead23 {c |}{col 15}{res}{space 2}-2.268729{col 27}{space 2}  3.32993{col 38}{space 1}   -0.68{col 47}{space 3}0.533{col 55}{space 4} -11.5141{col 68}{space 3} 6.976638
{txt}{space 7}lead22 {c |}{col 15}{res}{space 2}-2.802958{col 27}{space 2} 3.248444{col 38}{space 1}   -0.86{col 47}{space 3}0.437{col 55}{space 4}-11.82208{col 68}{space 3} 6.216168
{txt}{space 7}lead21 {c |}{col 15}{res}{space 2}  -4.4285{col 27}{space 2} 4.755426{col 38}{space 1}   -0.93{col 47}{space 3}0.404{col 55}{space 4}-17.63168{col 68}{space 3} 8.774681
{txt}{space 7}lead20 {c |}{col 15}{res}{space 2}-1.348171{col 27}{space 2} 4.153892{col 38}{space 1}   -0.32{col 47}{space 3}0.762{col 55}{space 4}-12.88123{col 68}{space 3} 10.18488
{txt}{space 7}lead19 {c |}{col 15}{res}{space 2} -5.48991{col 27}{space 2} 4.619921{col 38}{space 1}   -1.19{col 47}{space 3}0.300{col 55}{space 4}-18.31687{col 68}{space 3} 7.337048
{txt}{space 7}lead18 {c |}{col 15}{res}{space 2}-2.574188{col 27}{space 2} 1.289632{col 38}{space 1}   -2.00{col 47}{space 3}0.117{col 55}{space 4}-6.154781{col 68}{space 3} 1.006404
{txt}{space 7}lead17 {c |}{col 15}{res}{space 2}-7.500754{col 27}{space 2} .9353181{col 38}{space 1}   -8.02{col 47}{space 3}0.001{col 55}{space 4}-10.09761{col 68}{space 3}-4.903894
{txt}{space 7}lead16 {c |}{col 15}{res}{space 2}-3.933897{col 27}{space 2} .4272071{col 38}{space 1}   -9.21{col 47}{space 3}0.001{col 55}{space 4}-5.120014{col 68}{space 3} -2.74778
{txt}{space 7}lead15 {c |}{col 15}{res}{space 2}-9.039892{col 27}{space 2} .3985529{col 38}{space 1}  -22.68{col 47}{space 3}0.000{col 55}{space 4}-10.14645{col 68}{space 3}-7.933331
{txt}{space 7}lead14 {c |}{col 15}{res}{space 2}-2.509536{col 27}{space 2}  2.08412{col 38}{space 1}   -1.20{col 47}{space 3}0.295{col 55}{space 4}-8.295981{col 68}{space 3} 3.276909
{txt}{space 7}lead13 {c |}{col 15}{res}{space 2} 4.771459{col 27}{space 2} .7531907{col 38}{space 1}    6.33{col 47}{space 3}0.003{col 55}{space 4} 2.680267{col 68}{space 3} 6.862652
{txt}{space 7}lead12 {c |}{col 15}{res}{space 2}-6.328641{col 27}{space 2} 3.541144{col 38}{space 1}   -1.79{col 47}{space 3}0.148{col 55}{space 4}-16.16043{col 68}{space 3}  3.50315
{txt}{space 7}lead11 {c |}{col 15}{res}{space 2}-5.698593{col 27}{space 2} 3.052348{col 38}{space 1}   -1.87{col 47}{space 3}0.135{col 55}{space 4}-14.17327{col 68}{space 3} 2.776083
{txt}{space 7}lead10 {c |}{col 15}{res}{space 2}-8.145543{col 27}{space 2} 3.069775{col 38}{space 1}   -2.65{col 47}{space 3}0.057{col 55}{space 4}-16.66861{col 68}{space 3} .3775193
{txt}{space 8}lead9 {c |}{col 15}{res}{space 2}-7.128003{col 27}{space 2} 4.600744{col 38}{space 1}   -1.55{col 47}{space 3}0.196{col 55}{space 4}-19.90171{col 68}{space 3} 5.645709
{txt}{space 8}lead8 {c |}{col 15}{res}{space 2}-2.968686{col 27}{space 2} 3.150383{col 38}{space 1}   -0.94{col 47}{space 3}0.399{col 55}{space 4}-11.71555{col 68}{space 3} 5.778179
{txt}{space 8}lead7 {c |}{col 15}{res}{space 2}-1.815546{col 27}{space 2} 3.467659{col 38}{space 1}   -0.52{col 47}{space 3}0.628{col 55}{space 4}-11.44331{col 68}{space 3}  7.81222
{txt}{space 8}lead6 {c |}{col 15}{res}{space 2}-6.190774{col 27}{space 2}  2.99432{col 38}{space 1}   -2.07{col 47}{space 3}0.108{col 55}{space 4}-14.50434{col 68}{space 3} 2.122792
{txt}{space 8}lead5 {c |}{col 15}{res}{space 2} -10.7074{col 27}{space 2} 1.912671{col 38}{space 1}   -5.60{col 47}{space 3}0.005{col 55}{space 4}-16.01783{col 68}{space 3}-5.396977
{txt}{space 8}lead4 {c |}{col 15}{res}{space 2}-10.68059{col 27}{space 2} 4.780697{col 38}{space 1}   -2.23{col 47}{space 3}0.089{col 55}{space 4}-23.95393{col 68}{space 3} 2.592756
{txt}{space 8}lead3 {c |}{col 15}{res}{space 2}-16.33116{col 27}{space 2} 4.457752{col 38}{space 1}   -3.66{col 47}{space 3}0.022{col 55}{space 4}-28.70786{col 68}{space 3}-3.954456
{txt}{space 8}lead2 {c |}{col 15}{res}{space 2}-6.671818{col 27}{space 2} 3.823775{col 38}{space 1}   -1.74{col 47}{space 3}0.156{col 55}{space 4}-17.28832{col 68}{space 3} 3.944684
{txt}{space 9}lag0 {c |}{col 15}{res}{space 2}-4.913917{col 27}{space 2} 2.138352{col 38}{space 1}   -2.30{col 47}{space 3}0.083{col 55}{space 4}-10.85094{col 68}{space 3} 1.023101
{txt}{space 9}lag1 {c |}{col 15}{res}{space 2}-6.280858{col 27}{space 2} 3.147072{col 38}{space 1}   -2.00{col 47}{space 3}0.117{col 55}{space 4}-15.01853{col 68}{space 3} 2.456815
{txt}{space 9}lag2 {c |}{col 15}{res}{space 2}-5.977695{col 27}{space 2} 4.342048{col 38}{space 1}   -1.38{col 47}{space 3}0.241{col 55}{space 4}-18.03315{col 68}{space 3} 6.077764
{txt}{space 9}lag3 {c |}{col 15}{res}{space 2}-1.661602{col 27}{space 2} 4.968815{col 38}{space 1}   -0.33{col 47}{space 3}0.755{col 55}{space 4}-15.45724{col 68}{space 3} 12.13404
{txt}{space 9}lag4 {c |}{col 15}{res}{space 2}-.3340049{col 27}{space 2} 5.507201{col 38}{space 1}   -0.06{col 47}{space 3}0.955{col 55}{space 4}-15.62445{col 68}{space 3} 14.95644
{txt}{space 9}lag5 {c |}{col 15}{res}{space 2}-1.429087{col 27}{space 2} 4.952912{col 38}{space 1}   -0.29{col 47}{space 3}0.787{col 55}{space 4}-15.18058{col 68}{space 3}  12.3224
{txt}{space 9}lag6 {c |}{col 15}{res}{space 2}-6.488012{col 27}{space 2} 3.559216{col 38}{space 1}   -1.82{col 47}{space 3}0.142{col 55}{space 4}-16.36998{col 68}{space 3} 3.393957
{txt}{space 9}lag7 {c |}{col 15}{res}{space 2}-4.287028{col 27}{space 2} .3908605{col 38}{space 1}  -10.97{col 47}{space 3}0.000{col 55}{space 4}-5.372231{col 68}{space 3}-3.201825
{txt}{space 9}lag8 {c |}{col 15}{res}{space 2} 4.865945{col 27}{space 2} 5.775596{col 38}{space 1}    0.84{col 47}{space 3}0.447{col 55}{space 4}-11.16968{col 68}{space 3} 20.90157
{txt}{space 9}lag9 {c |}{col 15}{res}{space 2}-1.072399{col 27}{space 2} 4.049642{col 38}{space 1}   -0.26{col 47}{space 3}0.804{col 55}{space 4}-12.31601{col 68}{space 3} 10.17121
{txt}{space 8}lag10 {c |}{col 15}{res}{space 2} -7.41907{col 27}{space 2} 3.720702{col 38}{space 1}   -1.99{col 47}{space 3}0.117{col 55}{space 4}-17.74939{col 68}{space 3} 2.911256
{txt}{space 8}lag11 {c |}{col 15}{res}{space 2}-1.169408{col 27}{space 2} 6.302116{col 38}{space 1}   -0.19{col 47}{space 3}0.862{col 55}{space 4}-18.66689{col 68}{space 3} 16.32807
{txt}{space 8}lag12 {c |}{col 15}{res}{space 2}-6.834458{col 27}{space 2}  4.47674{col 38}{space 1}   -1.53{col 47}{space 3}0.202{col 55}{space 4}-19.26388{col 68}{space 3} 5.594966
{txt}{space 8}lag13 {c |}{col 15}{res}{space 2}-3.550484{col 27}{space 2} 3.037466{col 38}{space 1}   -1.17{col 47}{space 3}0.307{col 55}{space 4}-11.98384{col 68}{space 3} 4.882872
{txt}{space 8}lag14 {c |}{col 15}{res}{space 2}-4.441703{col 27}{space 2} 3.404696{col 38}{space 1}   -1.30{col 47}{space 3}0.262{col 55}{space 4}-13.89466{col 68}{space 3} 5.011249
{txt}{space 8}lag15 {c |}{col 15}{res}{space 2}-4.389016{col 27}{space 2}  2.53462{col 38}{space 1}   -1.73{col 47}{space 3}0.158{col 55}{space 4}-11.42625{col 68}{space 3} 2.648216
{txt}{space 8}lag16 {c |}{col 15}{res}{space 2} 1.521936{col 27}{space 2} 3.087666{col 38}{space 1}    0.49{col 47}{space 3}0.648{col 55}{space 4}-7.050799{col 68}{space 3} 10.09467
{txt}{space 8}lag17 {c |}{col 15}{res}{space 2} 1.048939{col 27}{space 2} 3.299937{col 38}{space 1}    0.32{col 47}{space 3}0.766{col 55}{space 4}-8.113156{col 68}{space 3} 10.21103
{txt}{space 8}lag18 {c |}{col 15}{res}{space 2}-5.465511{col 27}{space 2} 2.574942{col 38}{space 1}   -2.12{col 47}{space 3}0.101{col 55}{space 4} -12.6147{col 68}{space 3} 1.683675
{txt}{space 8}lag19 {c |}{col 15}{res}{space 2}-6.997965{col 27}{space 2} 1.920642{col 38}{space 1}   -3.64{col 47}{space 3}0.022{col 55}{space 4}-12.33052{col 68}{space 3}-1.665406
{txt}{space 8}lag20 {c |}{col 15}{res}{space 2}-3.533302{col 27}{space 2} 1.661416{col 38}{space 1}   -2.13{col 47}{space 3}0.101{col 55}{space 4}-8.146132{col 68}{space 3} 1.079527
{txt}{space 8}lag21 {c |}{col 15}{res}{space 2}-1.636275{col 27}{space 2} 7.469626{col 38}{space 1}   -0.22{col 47}{space 3}0.837{col 55}{space 4}-22.37528{col 68}{space 3} 19.10273
{txt}{space 8}lag22 {c |}{col 15}{res}{space 2}-.1743161{col 27}{space 2} 5.296312{col 38}{space 1}   -0.03{col 47}{space 3}0.975{col 55}{space 4}-14.87924{col 68}{space 3}  14.5306
{txt}{space 8}lag23 {c |}{col 15}{res}{space 2} -.761067{col 27}{space 2} 1.794018{col 38}{space 1}   -0.42{col 47}{space 3}0.693{col 55}{space 4} -5.74206{col 68}{space 3} 4.219926
{txt}{space 8}lag24 {c |}{col 15}{res}{space 2}-4.261737{col 27}{space 2} 4.726224{col 38}{space 1}   -0.90{col 47}{space 3}0.418{col 55}{space 4}-17.38384{col 68}{space 3} 8.860365
{txt}{space 8}lag25 {c |}{col 15}{res}{space 2}-9.369323{col 27}{space 2} 6.613996{col 38}{space 1}   -1.42{col 47}{space 3}0.230{col 55}{space 4}-27.73272{col 68}{space 3} 8.994074
{txt}{space 8}lag26 {c |}{col 15}{res}{space 2}-5.596798{col 27}{space 2} 4.599374{col 38}{space 1}   -1.22{col 47}{space 3}0.291{col 55}{space 4}-18.36671{col 68}{space 3} 7.173112
{txt}{space 8}lag27 {c |}{col 15}{res}{space 2}-4.815477{col 27}{space 2} 4.011626{col 38}{space 1}   -1.20{col 47}{space 3}0.296{col 55}{space 4}-15.95354{col 68}{space 3} 6.322582
{txt}{space 8}lag28 {c |}{col 15}{res}{space 2}-3.657612{col 27}{space 2}  5.20923{col 38}{space 1}   -0.70{col 47}{space 3}0.521{col 55}{space 4}-18.12075{col 68}{space 3} 10.80553
{txt}{space 8}lag29 {c |}{col 15}{res}{space 2}-9.291133{col 27}{space 2} 3.545509{col 38}{space 1}   -2.62{col 47}{space 3}0.059{col 55}{space 4}-19.13504{col 68}{space 3}  .552778
{txt}{space 8}lag30 {c |}{col 15}{res}{space 2}-5.362831{col 27}{space 2} 4.910155{col 38}{space 1}   -1.09{col 47}{space 3}0.336{col 55}{space 4}-18.99561{col 68}{space 3} 8.269944
{txt}{space 8}lag31 {c |}{col 15}{res}{space 2}-10.93156{col 27}{space 2} 1.101109{col 38}{space 1}   -9.93{col 47}{space 3}0.001{col 55}{space 4}-13.98873{col 68}{space 3}-7.874394
{txt}{space 8}lag32 {c |}{col 15}{res}{space 2}-3.915227{col 27}{space 2} 3.672019{col 38}{space 1}   -1.07{col 47}{space 3}0.346{col 55}{space 4}-14.11039{col 68}{space 3} 6.279931
{txt}{space 8}lag33 {c |}{col 15}{res}{space 2}-12.65575{col 27}{space 2} 4.532802{col 38}{space 1}   -2.79{col 47}{space 3}0.049{col 55}{space 4}-25.24083{col 68}{space 3}-.0706764
{txt}{space 8}lag34 {c |}{col 15}{res}{space 2}-10.93481{col 27}{space 2} 3.135166{col 38}{space 1}   -3.49{col 47}{space 3}0.025{col 55}{space 4}-19.63942{col 68}{space 3}-2.230194
{txt}{space 8}lag35 {c |}{col 15}{res}{space 2}-7.748926{col 27}{space 2} 3.804983{col 38}{space 1}   -2.04{col 47}{space 3}0.111{col 55}{space 4}-18.31325{col 68}{space 3}   2.8154
{txt}{space 8}lag36 {c |}{col 15}{res}{space 2}-5.742876{col 27}{space 2} 2.759268{col 38}{space 1}   -2.08{col 47}{space 3}0.106{col 55}{space 4}-13.40383{col 68}{space 3} 1.918082
{txt}{space 8}lag37 {c |}{col 15}{res}{space 2}-1.602409{col 27}{space 2} 7.459496{col 38}{space 1}   -0.21{col 47}{space 3}0.840{col 55}{space 4}-22.31329{col 68}{space 3} 19.10847
{txt}{space 8}lag38 {c |}{col 15}{res}{space 2}-6.951321{col 27}{space 2} 6.271915{col 38}{space 1}   -1.11{col 47}{space 3}0.330{col 55}{space 4}-24.36495{col 68}{space 3} 10.46231
{txt}{space 8}lag39 {c |}{col 15}{res}{space 2}-8.860135{col 27}{space 2} 6.011834{col 38}{space 1}   -1.47{col 47}{space 3}0.215{col 55}{space 4}-25.55166{col 68}{space 3} 7.831392
{txt}{space 8}lag40 {c |}{col 15}{res}{space 2}-7.243897{col 27}{space 2} 9.057095{col 38}{space 1}   -0.80{col 47}{space 3}0.469{col 55}{space 4}-32.39042{col 68}{space 3} 17.90263
{txt}{space 8}lag41 {c |}{col 15}{res}{space 2} -9.07839{col 27}{space 2} 8.545306{col 38}{space 1}   -1.06{col 47}{space 3}0.348{col 55}{space 4}-32.80396{col 68}{space 3} 14.64718
{txt}{space 8}lag42 {c |}{col 15}{res}{space 2} .8127896{col 27}{space 2} 7.416119{col 38}{space 1}    0.11{col 47}{space 3}0.918{col 55}{space 4}-19.77766{col 68}{space 3} 21.40324
{txt}{space 8}lag43 {c |}{col 15}{res}{space 2}-14.45471{col 27}{space 2} 4.818963{col 38}{space 1}   -3.00{col 47}{space 3}0.040{col 55}{space 4} -27.8343{col 68}{space 3}-1.075124
{txt}{space 8}lag44 {c |}{col 15}{res}{space 2} -9.16067{col 27}{space 2} 8.781628{col 38}{space 1}   -1.04{col 47}{space 3}0.356{col 55}{space 4}-33.54238{col 68}{space 3} 15.22104
{txt}{space 8}lag45 {c |}{col 15}{res}{space 2}  -8.3219{col 27}{space 2}  2.74323{col 38}{space 1}   -3.03{col 47}{space 3}0.039{col 55}{space 4}-15.93833{col 68}{space 3}-.7054721
{txt}{space 8}lag46 {c |}{col 15}{res}{space 2}-8.109809{col 27}{space 2} 5.432192{col 38}{space 1}   -1.49{col 47}{space 3}0.210{col 55}{space 4}-23.19199{col 68}{space 3} 6.972374
{txt}{space 8}lag47 {c |}{col 15}{res}{space 2}-5.235529{col 27}{space 2} 6.673644{col 38}{space 1}   -0.78{col 47}{space 3}0.477{col 55}{space 4}-23.76454{col 68}{space 3} 13.29348
{txt}{space 8}lag48 {c |}{col 15}{res}{space 2}-8.664185{col 27}{space 2} 6.284275{col 38}{space 1}   -1.38{col 47}{space 3}0.240{col 55}{space 4}-26.11213{col 68}{space 3} 8.783761
{txt}{space 8}lag49 {c |}{col 15}{res}{space 2}-18.23607{col 27}{space 2} 5.236414{col 38}{space 1}   -3.48{col 47}{space 3}0.025{col 55}{space 4}-32.77469{col 68}{space 3}-3.697457
{txt}{space 8}lag50 {c |}{col 15}{res}{space 2}-11.02539{col 27}{space 2} 2.215033{col 38}{space 1}   -4.98{col 47}{space 3}0.008{col 55}{space 4}-17.17531{col 68}{space 3}-4.875473
{txt}{space 8}lag51 {c |}{col 15}{res}{space 2}-1.193233{col 27}{space 2} 3.995429{col 38}{space 1}   -0.30{col 47}{space 3}0.780{col 55}{space 4}-12.28632{col 68}{space 3} 9.899856
{txt}{space 8}lag52 {c |}{col 15}{res}{space 2}-7.821558{col 27}{space 2} 3.533683{col 38}{space 1}   -2.21{col 47}{space 3}0.091{col 55}{space 4}-17.63263{col 68}{space 3} 1.989518
{txt}{space 8}lag53 {c |}{col 15}{res}{space 2}-13.45736{col 27}{space 2} 7.025183{col 38}{space 1}   -1.92{col 47}{space 3}0.128{col 55}{space 4} -32.9624{col 68}{space 3}  6.04767
{txt}{space 8}lag54 {c |}{col 15}{res}{space 2} -8.70028{col 27}{space 2} 5.346196{col 38}{space 1}   -1.63{col 47}{space 3}0.179{col 55}{space 4} -23.5437{col 68}{space 3} 6.143139
{txt}{space 8}lag55 {c |}{col 15}{res}{space 2}-13.03417{col 27}{space 2} 6.187242{col 38}{space 1}   -2.11{col 47}{space 3}0.103{col 55}{space 4} -30.2127{col 68}{space 3} 4.144371
{txt}{space 8}lag56 {c |}{col 15}{res}{space 2}-10.85534{col 27}{space 2} 1.359749{col 38}{space 1}   -7.98{col 47}{space 3}0.001{col 55}{space 4}-14.63061{col 68}{space 3}-7.080068
{txt}{space 8}lag57 {c |}{col 15}{res}{space 2}-5.428811{col 27}{space 2} 6.718327{col 38}{space 1}   -0.81{col 47}{space 3}0.464{col 55}{space 4}-24.08188{col 68}{space 3} 13.22426
{txt}{space 8}lag58 {c |}{col 15}{res}{space 2}-8.795143{col 27}{space 2} 3.681417{col 38}{space 1}   -2.39{col 47}{space 3}0.075{col 55}{space 4} -19.0164{col 68}{space 3} 1.426109
{txt}{space 8}lag59 {c |}{col 15}{res}{space 2}-6.886898{col 27}{space 2} 4.463041{col 38}{space 1}   -1.54{col 47}{space 3}0.198{col 55}{space 4}-19.27829{col 68}{space 3} 5.504489
{txt}{space 8}lag60 {c |}{col 15}{res}{space 2}-5.088275{col 27}{space 2} 8.421319{col 38}{space 1}   -0.60{col 47}{space 3}0.578{col 55}{space 4}-28.46961{col 68}{space 3} 18.29306
{txt}{space 8}lag61 {c |}{col 15}{res}{space 2} -4.83646{col 27}{space 2} 8.530345{col 38}{space 1}   -0.57{col 47}{space 3}0.601{col 55}{space 4}-28.52049{col 68}{space 3} 18.84757
{txt}{space 8}lag62 {c |}{col 15}{res}{space 2}-11.96741{col 27}{space 2} 7.404596{col 38}{space 1}   -1.62{col 47}{space 3}0.181{col 55}{space 4}-32.52586{col 68}{space 3} 8.591048
{txt}{space 8}lag63 {c |}{col 15}{res}{space 2}-15.04256{col 27}{space 2}  10.0329{col 38}{space 1}   -1.50{col 47}{space 3}0.208{col 55}{space 4}-42.89834{col 68}{space 3} 12.81323
{txt}{space 8}lag64 {c |}{col 15}{res}{space 2}-16.88256{col 27}{space 2} 3.426936{col 38}{space 1}   -4.93{col 47}{space 3}0.008{col 55}{space 4}-26.39726{col 68}{space 3}-7.367859
{txt}{space 8}lag65 {c |}{col 15}{res}{space 2}-22.62154{col 27}{space 2} 6.494285{col 38}{space 1}   -3.48{col 47}{space 3}0.025{col 55}{space 4}-40.65256{col 68}{space 3}-4.590511
{txt}{space 8}lag66 {c |}{col 15}{res}{space 2}-8.097404{col 27}{space 2} 2.958026{col 38}{space 1}   -2.74{col 47}{space 3}0.052{col 55}{space 4} -16.3102{col 68}{space 3} .1153933
{txt}{space 8}lag67 {c |}{col 15}{res}{space 2}-1.345784{col 27}{space 2} 8.049841{col 38}{space 1}   -0.17{col 47}{space 3}0.875{col 55}{space 4}-23.69573{col 68}{space 3} 21.00416
{txt}{space 8}lag68 {c |}{col 15}{res}{space 2}-5.067951{col 27}{space 2} 6.360234{col 38}{space 1}   -0.80{col 47}{space 3}0.470{col 55}{space 4}-22.72679{col 68}{space 3} 12.59089
{txt}{space 8}lag69 {c |}{col 15}{res}{space 2}-12.69402{col 27}{space 2} 5.970016{col 38}{space 1}   -2.13{col 47}{space 3}0.101{col 55}{space 4}-29.26944{col 68}{space 3}   3.8814
{txt}{space 8}lag70 {c |}{col 15}{res}{space 2}-8.771563{col 27}{space 2} 4.709815{col 38}{space 1}   -1.86{col 47}{space 3}0.136{col 55}{space 4}-21.84811{col 68}{space 3} 4.304979
{txt}{space 8}lag71 {c |}{col 15}{res}{space 2}-13.45661{col 27}{space 2} 3.314263{col 38}{space 1}   -4.06{col 47}{space 3}0.015{col 55}{space 4}-22.65848{col 68}{space 3}-4.254742
{txt}{space 8}lag72 {c |}{col 15}{res}{space 2}-6.492324{col 27}{space 2} 8.208685{col 38}{space 1}   -0.79{col 47}{space 3}0.473{col 55}{space 4}-29.28329{col 68}{space 3} 16.29864
{txt}{space 8}lag73 {c |}{col 15}{res}{space 2}  -2.6276{col 27}{space 2} 9.231816{col 38}{space 1}   -0.28{col 47}{space 3}0.790{col 55}{space 4}-28.25923{col 68}{space 3} 23.00403
{txt}{space 8}lag74 {c |}{col 15}{res}{space 2}-8.507937{col 27}{space 2} 8.243979{col 38}{space 1}   -1.03{col 47}{space 3}0.360{col 55}{space 4}-31.39689{col 68}{space 3} 14.38102
{txt}{space 8}lag75 {c |}{col 15}{res}{space 2}-7.878642{col 27}{space 2} 9.634839{col 38}{space 1}   -0.82{col 47}{space 3}0.459{col 55}{space 4}-34.62924{col 68}{space 3} 18.87196
{txt}{space 8}lag76 {c |}{col 15}{res}{space 2}-10.02517{col 27}{space 2} 5.420206{col 38}{space 1}   -1.85{col 47}{space 3}0.138{col 55}{space 4}-25.07407{col 68}{space 3} 5.023733
{txt}{space 8}lag77 {c |}{col 15}{res}{space 2}-15.94858{col 27}{space 2} 3.098532{col 38}{space 1}   -5.15{col 47}{space 3}0.007{col 55}{space 4}-24.55149{col 68}{space 3} -7.34568
{txt}{space 8}lag78 {c |}{col 15}{res}{space 2}-10.30867{col 27}{space 2} 4.881723{col 38}{space 1}   -2.11{col 47}{space 3}0.102{col 55}{space 4}-23.86251{col 68}{space 3} 3.245161
{txt}{space 8}lag79 {c |}{col 15}{res}{space 2}-4.736249{col 27}{space 2} 9.273491{col 38}{space 1}   -0.51{col 47}{space 3}0.636{col 55}{space 4}-30.48359{col 68}{space 3} 21.01109
{txt}{space 8}lag80 {c |}{col 15}{res}{space 2}-2.523965{col 27}{space 2} 11.02764{col 38}{space 1}   -0.23{col 47}{space 3}0.830{col 55}{space 4}-33.14161{col 68}{space 3} 28.09368
{txt}{space 8}lag81 {c |}{col 15}{res}{space 2}-8.815501{col 27}{space 2} 7.287243{col 38}{space 1}   -1.21{col 47}{space 3}0.293{col 55}{space 4}-29.04813{col 68}{space 3} 11.41713
{txt}{space 8}lag82 {c |}{col 15}{res}{space 2}-14.00612{col 27}{space 2} 5.782282{col 38}{space 1}   -2.42{col 47}{space 3}0.073{col 55}{space 4}-30.06031{col 68}{space 3} 2.048071
{txt}{space 8}lag83 {c |}{col 15}{res}{space 2}-4.883189{col 27}{space 2} 6.244715{col 38}{space 1}   -0.78{col 47}{space 3}0.478{col 55}{space 4} -22.2213{col 68}{space 3} 12.45492
{txt}{space 8}lag84 {c |}{col 15}{res}{space 2}-8.545875{col 27}{space 2} 5.640785{col 38}{space 1}   -1.52{col 47}{space 3}0.204{col 55}{space 4} -24.2072{col 68}{space 3} 7.115453
{txt}{space 8}lag85 {c |}{col 15}{res}{space 2}-8.154306{col 27}{space 2} 5.016292{col 38}{space 1}   -1.63{col 47}{space 3}0.179{col 55}{space 4}-22.08177{col 68}{space 3} 5.773154
{txt}{space 8}lag86 {c |}{col 15}{res}{space 2}-9.730558{col 27}{space 2} 4.049113{col 38}{space 1}   -2.40{col 47}{space 3}0.074{col 55}{space 4} -20.9727{col 68}{space 3} 1.511581
{txt}{space 8}lag87 {c |}{col 15}{res}{space 2}-8.793708{col 27}{space 2} 6.564672{col 38}{space 1}   -1.34{col 47}{space 3}0.251{col 55}{space 4}-27.02016{col 68}{space 3} 9.432744
{txt}{space 8}lag88 {c |}{col 15}{res}{space 2}-10.62919{col 27}{space 2} 6.827043{col 38}{space 1}   -1.56{col 47}{space 3}0.194{col 55}{space 4} -29.5841{col 68}{space 3} 8.325722
{txt}{space 8}lag89 {c |}{col 15}{res}{space 2}-6.993346{col 27}{space 2} 5.798141{col 38}{space 1}   -1.21{col 47}{space 3}0.294{col 55}{space 4}-23.09157{col 68}{space 3} 9.104875
{txt}{space 8}lag90 {c |}{col 15}{res}{space 2}-10.53168{col 27}{space 2} 6.957146{col 38}{space 1}   -1.51{col 47}{space 3}0.205{col 55}{space 4}-29.84782{col 68}{space 3} 8.784449
{txt}{space 8}lag91 {c |}{col 15}{res}{space 2}-11.77373{col 27}{space 2}  4.96162{col 38}{space 1}   -2.37{col 47}{space 3}0.077{col 55}{space 4} -25.5494{col 68}{space 3} 2.001934
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}-136.3275{col 27}{space 2} 22.72377{col 38}{space 1}   -6.00{col 47}{space 3}0.004{col 55}{space 4}-199.4189{col 68}{space 3}-73.23623
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}   regionid1{col 14}{c |}{space 1}        5{col 27}{space 1}        5{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}        date{col 14}{c |}{space 1}     2560{col 27}{space 1}        1{col 39}{result}{space 1}     2559{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. graph export "results/EventStudy-MiddayCO2-DST-Stop.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/simonpostler/Desktop/applied-econometrics-dst-master-2/results/EventStudy-MiddayCO2-DST-Stop.png{rm}
saved as
PNG
format
{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/6h/778gphg5533gk87_wkb11wqh0000gn/T//SD01922.000000"
{txt}
{com}. use "data/06-half-hourly.dta", clear
{txt}
{com}. gen timevar = .
{txt}(1,264,072 missing values generated)

{com}. replace timevar = days_into_dst if dst_here_anytime == 1
{txt}(1,011,256 real changes made)

{com}. drop if regionid == "TAS1"
{txt}(252,814 observations deleted)

{com}. 
. eventdd co2_g_per_capita_vs_midday public_holiday c.temperature##c.temperature solar_exposure wind_3  [aweight = population], timevar(timevar) method(hdfe, absorb(regionid1 date) cluster(regionid1)) graph_op(ytitle("Co2 g per capita") xtitle("Days until DST transition") title("Event Study - CO2 - Midday - w/o Tasmania"))
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}{txt}warning: missing F statistic; dropped variables due to collinearity or too few clusters
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,011,258
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F( 190,      3)}{col 67}=          {res}.
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.2299
{txt}{col 51}Adj R-squared{col 67}= {res}    0.2257
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0164
{txt}{col 1}Number of clusters ({res}regionid1{txt}) {col 30}= {res}         4{txt}{col 51}Root MSE{col 67}= {res}   57.5918

{txt}{ralign 79:(Std. err. adjusted for {res:4} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}co2_g_per_c~y{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
public_holi~y {c |}{col 15}{res}{space 2} 8.876928{col 27}{space 2} 2.278607{col 38}{space 1}    3.90{col 47}{space 3}0.030{col 55}{space 4} 1.625384{col 68}{space 3} 16.12847
{txt}{space 2}temperature {c |}{col 15}{res}{space 2} 10.47568{col 27}{space 2} 1.490091{col 38}{space 1}    7.03{col 47}{space 3}0.006{col 55}{space 4} 5.733543{col 68}{space 3} 15.21781
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2} -.211414{col 27}{space 2} .0258373{col 38}{space 1}   -8.18{col 47}{space 3}0.004{col 55}{space 4}-.2936399{col 68}{space 3} -.129188
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2} 2.923252{col 27}{space 2} .6385483{col 38}{space 1}    4.58{col 47}{space 3}0.020{col 55}{space 4} .8911067{col 68}{space 3} 4.955398
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2}-1.153495{col 27}{space 2} .5572003{col 38}{space 1}   -2.07{col 47}{space 3}0.130{col 55}{space 4}-2.926755{col 68}{space 3} .6197644
{txt}{space 7}lead94 {c |}{col 15}{res}{space 2} 6.968636{col 27}{space 2} 5.610126{col 38}{space 1}    1.24{col 47}{space 3}0.302{col 55}{space 4}-10.88529{col 68}{space 3} 24.82256
{txt}{space 7}lead93 {c |}{col 15}{res}{space 2}-4.810137{col 27}{space 2} 4.390516{col 38}{space 1}   -1.10{col 47}{space 3}0.353{col 55}{space 4}-18.78272{col 68}{space 3} 9.162443
{txt}{space 7}lead92 {c |}{col 15}{res}{space 2} 17.41046{col 27}{space 2} 7.726676{col 38}{space 1}    2.25{col 47}{space 3}0.110{col 55}{space 4}-7.179273{col 68}{space 3} 42.00019
{txt}{space 7}lead91 {c |}{col 15}{res}{space 2} 7.644464{col 27}{space 2} 10.07948{col 38}{space 1}    0.76{col 47}{space 3}0.503{col 55}{space 4}-24.43295{col 68}{space 3} 39.72188
{txt}{space 7}lead90 {c |}{col 15}{res}{space 2} 10.09274{col 27}{space 2} 4.869964{col 38}{space 1}    2.07{col 47}{space 3}0.130{col 55}{space 4}-5.405655{col 68}{space 3} 25.59114
{txt}{space 7}lead89 {c |}{col 15}{res}{space 2} 8.704169{col 27}{space 2} 4.685959{col 38}{space 1}    1.86{col 47}{space 3}0.160{col 55}{space 4}-6.208646{col 68}{space 3} 23.61698
{txt}{space 7}lead88 {c |}{col 15}{res}{space 2} 15.25849{col 27}{space 2} 4.523634{col 38}{space 1}    3.37{col 47}{space 3}0.043{col 55}{space 4} .8622727{col 68}{space 3} 29.65472
{txt}{space 7}lead87 {c |}{col 15}{res}{space 2} 7.174661{col 27}{space 2} 1.779131{col 38}{space 1}    4.03{col 47}{space 3}0.027{col 55}{space 4} 1.512671{col 68}{space 3} 12.83665
{txt}{space 7}lead86 {c |}{col 15}{res}{space 2} .5376069{col 27}{space 2} 3.959422{col 38}{space 1}    0.14{col 47}{space 3}0.901{col 55}{space 4}-12.06304{col 68}{space 3} 13.13826
{txt}{space 7}lead85 {c |}{col 15}{res}{space 2}-1.241366{col 27}{space 2} 7.826409{col 38}{space 1}   -0.16{col 47}{space 3}0.884{col 55}{space 4}-26.14849{col 68}{space 3} 23.66576
{txt}{space 7}lead84 {c |}{col 15}{res}{space 2} 8.147005{col 27}{space 2}  10.2859{col 38}{space 1}    0.79{col 47}{space 3}0.486{col 55}{space 4}-24.58733{col 68}{space 3} 40.88134
{txt}{space 7}lead83 {c |}{col 15}{res}{space 2} 3.004965{col 27}{space 2} 6.918491{col 38}{space 1}    0.43{col 47}{space 3}0.693{col 55}{space 4}-19.01276{col 68}{space 3} 25.02269
{txt}{space 7}lead82 {c |}{col 15}{res}{space 2} .4402675{col 27}{space 2} 5.217678{col 38}{space 1}    0.08{col 47}{space 3}0.938{col 55}{space 4}-16.16471{col 68}{space 3} 17.04525
{txt}{space 7}lead81 {c |}{col 15}{res}{space 2} 1.269734{col 27}{space 2} 3.522583{col 38}{space 1}    0.36{col 47}{space 3}0.742{col 55}{space 4}-9.940696{col 68}{space 3} 12.48016
{txt}{space 7}lead80 {c |}{col 15}{res}{space 2}-6.764456{col 27}{space 2} 8.270267{col 38}{space 1}   -0.82{col 47}{space 3}0.473{col 55}{space 4}-33.08414{col 68}{space 3} 19.55523
{txt}{space 7}lead79 {c |}{col 15}{res}{space 2}-.9680191{col 27}{space 2} 6.299768{col 38}{space 1}   -0.15{col 47}{space 3}0.888{col 55}{space 4}-21.01669{col 68}{space 3} 19.08065
{txt}{space 7}lead78 {c |}{col 15}{res}{space 2}-.8950052{col 27}{space 2} 7.327028{col 38}{space 1}   -0.12{col 47}{space 3}0.911{col 55}{space 4}-24.21288{col 68}{space 3} 22.42287
{txt}{space 7}lead77 {c |}{col 15}{res}{space 2} 8.255105{col 27}{space 2} 5.573899{col 38}{space 1}    1.48{col 47}{space 3}0.235{col 55}{space 4}-9.483529{col 68}{space 3} 25.99374
{txt}{space 7}lead76 {c |}{col 15}{res}{space 2}-.1303719{col 27}{space 2}  5.24442{col 38}{space 1}   -0.02{col 47}{space 3}0.982{col 55}{space 4}-16.82046{col 68}{space 3} 16.55971
{txt}{space 7}lead75 {c |}{col 15}{res}{space 2}-.0836424{col 27}{space 2} 8.044433{col 38}{space 1}   -0.01{col 47}{space 3}0.992{col 55}{space 4}-25.68462{col 68}{space 3} 25.51733
{txt}{space 7}lead74 {c |}{col 15}{res}{space 2} 4.226118{col 27}{space 2} 5.799493{col 38}{space 1}    0.73{col 47}{space 3}0.519{col 55}{space 4}-14.23046{col 68}{space 3} 22.68269
{txt}{space 7}lead73 {c |}{col 15}{res}{space 2}  4.16383{col 27}{space 2} 3.707246{col 38}{space 1}    1.12{col 47}{space 3}0.343{col 55}{space 4}-7.634282{col 68}{space 3} 15.96194
{txt}{space 7}lead72 {c |}{col 15}{res}{space 2} 7.654652{col 27}{space 2} 6.315545{col 38}{space 1}    1.21{col 47}{space 3}0.312{col 55}{space 4}-12.44423{col 68}{space 3} 27.75354
{txt}{space 7}lead71 {c |}{col 15}{res}{space 2}   7.8667{col 27}{space 2} 5.361798{col 38}{space 1}    1.47{col 47}{space 3}0.239{col 55}{space 4}-9.196935{col 68}{space 3} 24.93034
{txt}{space 7}lead70 {c |}{col 15}{res}{space 2} 8.909608{col 27}{space 2} 6.141099{col 38}{space 1}    1.45{col 47}{space 3}0.243{col 55}{space 4}-10.63411{col 68}{space 3} 28.45333
{txt}{space 7}lead69 {c |}{col 15}{res}{space 2} 4.272391{col 27}{space 2}   7.7742{col 38}{space 1}    0.55{col 47}{space 3}0.621{col 55}{space 4}-20.46858{col 68}{space 3} 29.01336
{txt}{space 7}lead68 {c |}{col 15}{res}{space 2}-.5405268{col 27}{space 2} 8.333005{col 38}{space 1}   -0.06{col 47}{space 3}0.952{col 55}{space 4}-27.05987{col 68}{space 3} 25.97881
{txt}{space 7}lead67 {c |}{col 15}{res}{space 2}-.7958794{col 27}{space 2} 8.779011{col 38}{space 1}   -0.09{col 47}{space 3}0.933{col 55}{space 4}-28.73461{col 68}{space 3} 27.14285
{txt}{space 7}lead66 {c |}{col 15}{res}{space 2}  5.08721{col 27}{space 2} 7.187504{col 38}{space 1}    0.71{col 47}{space 3}0.530{col 55}{space 4}-17.78664{col 68}{space 3} 27.96106
{txt}{space 7}lead65 {c |}{col 15}{res}{space 2} -.053484{col 27}{space 2} 8.680615{col 38}{space 1}   -0.01{col 47}{space 3}0.995{col 55}{space 4}-27.67908{col 68}{space 3} 27.57211
{txt}{space 7}lead64 {c |}{col 15}{res}{space 2} 5.603212{col 27}{space 2}  6.39109{col 38}{space 1}    0.88{col 47}{space 3}0.445{col 55}{space 4}-14.73609{col 68}{space 3} 25.94251
{txt}{space 7}lead63 {c |}{col 15}{res}{space 2} 9.256948{col 27}{space 2} 5.021272{col 38}{space 1}    1.84{col 47}{space 3}0.162{col 55}{space 4}-6.722981{col 68}{space 3} 25.23688
{txt}{space 7}lead62 {c |}{col 15}{res}{space 2} 6.909543{col 27}{space 2}  2.38152{col 38}{space 1}    2.90{col 47}{space 3}0.062{col 55}{space 4}-.6695168{col 68}{space 3}  14.4886
{txt}{space 7}lead61 {c |}{col 15}{res}{space 2} 7.965018{col 27}{space 2} 6.304392{col 38}{space 1}    1.26{col 47}{space 3}0.296{col 55}{space 4}-12.09837{col 68}{space 3} 28.02841
{txt}{space 7}lead60 {c |}{col 15}{res}{space 2} 5.083102{col 27}{space 2} 6.407105{col 38}{space 1}    0.79{col 47}{space 3}0.486{col 55}{space 4}-15.30717{col 68}{space 3} 25.47337
{txt}{space 7}lead59 {c |}{col 15}{res}{space 2} .6299541{col 27}{space 2} 6.423264{col 38}{space 1}    0.10{col 47}{space 3}0.928{col 55}{space 4}-19.81174{col 68}{space 3} 21.07165
{txt}{space 7}lead58 {c |}{col 15}{res}{space 2} 2.985855{col 27}{space 2} 6.485506{col 38}{space 1}    0.46{col 47}{space 3}0.677{col 55}{space 4}-17.65392{col 68}{space 3} 23.62563
{txt}{space 7}lead57 {c |}{col 15}{res}{space 2} 2.683454{col 27}{space 2} 5.179111{col 38}{space 1}    0.52{col 47}{space 3}0.640{col 55}{space 4}-13.79879{col 68}{space 3}  19.1657
{txt}{space 7}lead56 {c |}{col 15}{res}{space 2} 6.283305{col 27}{space 2} 5.635335{col 38}{space 1}    1.11{col 47}{space 3}0.346{col 55}{space 4}-11.65085{col 68}{space 3} 24.21745
{txt}{space 7}lead55 {c |}{col 15}{res}{space 2} 4.989282{col 27}{space 2} 6.242523{col 38}{space 1}    0.80{col 47}{space 3}0.483{col 55}{space 4}-14.87721{col 68}{space 3} 24.85578
{txt}{space 7}lead54 {c |}{col 15}{res}{space 2} 4.100547{col 27}{space 2} 6.555419{col 38}{space 1}    0.63{col 47}{space 3}0.576{col 55}{space 4}-16.76172{col 68}{space 3} 24.96282
{txt}{space 7}lead53 {c |}{col 15}{res}{space 2} 3.110701{col 27}{space 2} 5.766878{col 38}{space 1}    0.54{col 47}{space 3}0.627{col 55}{space 4}-15.24208{col 68}{space 3} 21.46348
{txt}{space 7}lead52 {c |}{col 15}{res}{space 2}-.9559838{col 27}{space 2} 10.74708{col 38}{space 1}   -0.09{col 47}{space 3}0.935{col 55}{space 4}-35.15799{col 68}{space 3} 33.24602
{txt}{space 7}lead51 {c |}{col 15}{res}{space 2} 1.023078{col 27}{space 2} 5.501815{col 38}{space 1}    0.19{col 47}{space 3}0.864{col 55}{space 4}-16.48615{col 68}{space 3} 18.53231
{txt}{space 7}lead50 {c |}{col 15}{res}{space 2} 2.849864{col 27}{space 2} 5.573982{col 38}{space 1}    0.51{col 47}{space 3}0.644{col 55}{space 4}-14.88903{col 68}{space 3} 20.58876
{txt}{space 7}lead49 {c |}{col 15}{res}{space 2}-.0315438{col 27}{space 2} 2.648392{col 38}{space 1}   -0.01{col 47}{space 3}0.991{col 55}{space 4} -8.45991{col 68}{space 3} 8.396822
{txt}{space 7}lead48 {c |}{col 15}{res}{space 2} -2.47348{col 27}{space 2} 3.326247{col 38}{space 1}   -0.74{col 47}{space 3}0.511{col 55}{space 4}-13.05908{col 68}{space 3} 8.112123
{txt}{space 7}lead47 {c |}{col 15}{res}{space 2}-3.409098{col 27}{space 2}   4.1029{col 38}{space 1}   -0.83{col 47}{space 3}0.467{col 55}{space 4}-16.46636{col 68}{space 3} 9.648161
{txt}{space 7}lead46 {c |}{col 15}{res}{space 2} 3.191498{col 27}{space 2} 6.636768{col 38}{space 1}    0.48{col 47}{space 3}0.663{col 55}{space 4}-17.92966{col 68}{space 3} 24.31265
{txt}{space 7}lead45 {c |}{col 15}{res}{space 2} 4.438435{col 27}{space 2} 4.572431{col 38}{space 1}    0.97{col 47}{space 3}0.403{col 55}{space 4}-10.11308{col 68}{space 3} 18.98995
{txt}{space 7}lead44 {c |}{col 15}{res}{space 2} 1.157461{col 27}{space 2} 7.573622{col 38}{space 1}    0.15{col 47}{space 3}0.888{col 55}{space 4}-22.94518{col 68}{space 3} 25.26011
{txt}{space 7}lead43 {c |}{col 15}{res}{space 2}-.4892511{col 27}{space 2} 3.485894{col 38}{space 1}   -0.14{col 47}{space 3}0.897{col 55}{space 4}-11.58292{col 68}{space 3} 10.60442
{txt}{space 7}lead42 {c |}{col 15}{res}{space 2} 6.925993{col 27}{space 2} 1.362668{col 38}{space 1}    5.08{col 47}{space 3}0.015{col 55}{space 4} 2.589375{col 68}{space 3} 11.26261
{txt}{space 7}lead41 {c |}{col 15}{res}{space 2} 2.515672{col 27}{space 2} 3.877111{col 38}{space 1}    0.65{col 47}{space 3}0.563{col 55}{space 4}-9.823026{col 68}{space 3} 14.85437
{txt}{space 7}lead40 {c |}{col 15}{res}{space 2} .1373868{col 27}{space 2} 5.696049{col 38}{space 1}    0.02{col 47}{space 3}0.982{col 55}{space 4}-17.98998{col 68}{space 3} 18.26476
{txt}{space 7}lead39 {c |}{col 15}{res}{space 2} .6343528{col 27}{space 2} 6.780257{col 38}{space 1}    0.09{col 47}{space 3}0.931{col 55}{space 4}-20.94345{col 68}{space 3} 22.21216
{txt}{space 7}lead38 {c |}{col 15}{res}{space 2} 4.084309{col 27}{space 2} 3.945955{col 38}{space 1}    1.04{col 47}{space 3}0.377{col 55}{space 4}-8.473481{col 68}{space 3}  16.6421
{txt}{space 7}lead37 {c |}{col 15}{res}{space 2} 3.044476{col 27}{space 2} 3.947412{col 38}{space 1}    0.77{col 47}{space 3}0.497{col 55}{space 4}-9.517951{col 68}{space 3}  15.6069
{txt}{space 7}lead36 {c |}{col 15}{res}{space 2} 3.581263{col 27}{space 2} 4.452408{col 38}{space 1}    0.80{col 47}{space 3}0.480{col 55}{space 4}-10.58829{col 68}{space 3} 17.75081
{txt}{space 7}lead35 {c |}{col 15}{res}{space 2}  9.88067{col 27}{space 2} 4.279115{col 38}{space 1}    2.31{col 47}{space 3}0.104{col 55}{space 4}-3.737383{col 68}{space 3} 23.49872
{txt}{space 7}lead34 {c |}{col 15}{res}{space 2}   2.4296{col 27}{space 2} 5.208992{col 38}{space 1}    0.47{col 47}{space 3}0.673{col 55}{space 4}-14.14774{col 68}{space 3} 19.00694
{txt}{space 7}lead33 {c |}{col 15}{res}{space 2} 2.299688{col 27}{space 2} 3.860871{col 38}{space 1}    0.60{col 47}{space 3}0.593{col 55}{space 4}-9.987325{col 68}{space 3}  14.5867
{txt}{space 7}lead32 {c |}{col 15}{res}{space 2} 2.564178{col 27}{space 2} 4.262267{col 38}{space 1}    0.60{col 47}{space 3}0.590{col 55}{space 4}-11.00026{col 68}{space 3} 16.12861
{txt}{space 7}lead31 {c |}{col 15}{res}{space 2} .9775705{col 27}{space 2} 3.001192{col 38}{space 1}    0.33{col 47}{space 3}0.766{col 55}{space 4}-8.573562{col 68}{space 3}  10.5287
{txt}{space 7}lead30 {c |}{col 15}{res}{space 2} 3.670406{col 27}{space 2} 2.452446{col 38}{space 1}    1.50{col 47}{space 3}0.231{col 55}{space 4}-4.134372{col 68}{space 3} 11.47518
{txt}{space 7}lead29 {c |}{col 15}{res}{space 2} 5.947638{col 27}{space 2} 2.926344{col 38}{space 1}    2.03{col 47}{space 3}0.135{col 55}{space 4}-3.365295{col 68}{space 3} 15.26057
{txt}{space 7}lead28 {c |}{col 15}{res}{space 2} 4.545117{col 27}{space 2} 3.482254{col 38}{space 1}    1.31{col 47}{space 3}0.283{col 55}{space 4}-6.536969{col 68}{space 3}  15.6272
{txt}{space 7}lead27 {c |}{col 15}{res}{space 2} 4.382553{col 27}{space 2} 2.532655{col 38}{space 1}    1.73{col 47}{space 3}0.182{col 55}{space 4}-3.677486{col 68}{space 3} 12.44259
{txt}{space 7}lead26 {c |}{col 15}{res}{space 2} 3.409312{col 27}{space 2} 4.386832{col 38}{space 1}    0.78{col 47}{space 3}0.494{col 55}{space 4}-10.55154{col 68}{space 3} 17.37017
{txt}{space 7}lead25 {c |}{col 15}{res}{space 2}-2.465566{col 27}{space 2} 2.258048{col 38}{space 1}   -1.09{col 47}{space 3}0.355{col 55}{space 4}-9.651682{col 68}{space 3}  4.72055
{txt}{space 7}lead24 {c |}{col 15}{res}{space 2}-.7909475{col 27}{space 2} 3.168811{col 38}{space 1}   -0.25{col 47}{space 3}0.819{col 55}{space 4}-10.87552{col 68}{space 3} 9.293623
{txt}{space 7}lead23 {c |}{col 15}{res}{space 2} 2.144297{col 27}{space 2} 2.637369{col 38}{space 1}    0.81{col 47}{space 3}0.476{col 55}{space 4}-6.248988{col 68}{space 3} 10.53758
{txt}{space 7}lead22 {c |}{col 15}{res}{space 2}-1.837134{col 27}{space 2} 2.088852{col 38}{space 1}   -0.88{col 47}{space 3}0.444{col 55}{space 4}-8.484792{col 68}{space 3} 4.810524
{txt}{space 7}lead21 {c |}{col 15}{res}{space 2} 1.024159{col 27}{space 2} 2.091162{col 38}{space 1}    0.49{col 47}{space 3}0.658{col 55}{space 4}-5.630853{col 68}{space 3} 7.679171
{txt}{space 7}lead20 {c |}{col 15}{res}{space 2} 3.286221{col 27}{space 2} 2.867391{col 38}{space 1}    1.15{col 47}{space 3}0.335{col 55}{space 4}-5.839098{col 68}{space 3} 12.41154
{txt}{space 7}lead19 {c |}{col 15}{res}{space 2}-1.680917{col 27}{space 2} .8232009{col 38}{space 1}   -2.04{col 47}{space 3}0.134{col 55}{space 4}-4.300709{col 68}{space 3}  .938876
{txt}{space 7}lead18 {c |}{col 15}{res}{space 2} 4.108475{col 27}{space 2}  1.09408{col 38}{space 1}    3.76{col 47}{space 3}0.033{col 55}{space 4} .6266231{col 68}{space 3} 7.590328
{txt}{space 7}lead17 {c |}{col 15}{res}{space 2} .2712481{col 27}{space 2} 1.111346{col 38}{space 1}    0.24{col 47}{space 3}0.823{col 55}{space 4} -3.26555{col 68}{space 3} 3.808046
{txt}{space 7}lead16 {c |}{col 15}{res}{space 2} .1473211{col 27}{space 2} 1.302396{col 38}{space 1}    0.11{col 47}{space 3}0.917{col 55}{space 4}-3.997484{col 68}{space 3} 4.292127
{txt}{space 7}lead15 {c |}{col 15}{res}{space 2}-6.157712{col 27}{space 2} .9170841{col 38}{space 1}   -6.71{col 47}{space 3}0.007{col 55}{space 4}-9.076283{col 68}{space 3}-3.239141
{txt}{space 7}lead14 {c |}{col 15}{res}{space 2} -2.65091{col 27}{space 2} 1.427361{col 38}{space 1}   -1.86{col 47}{space 3}0.160{col 55}{space 4}-7.193411{col 68}{space 3} 1.891591
{txt}{space 7}lead13 {c |}{col 15}{res}{space 2} 2.936222{col 27}{space 2} .9202845{col 38}{space 1}    3.19{col 47}{space 3}0.050{col 55}{space 4} .0074656{col 68}{space 3} 5.864978
{txt}{space 7}lead12 {c |}{col 15}{res}{space 2}-1.831499{col 27}{space 2} 1.586894{col 38}{space 1}   -1.15{col 47}{space 3}0.332{col 55}{space 4}-6.881705{col 68}{space 3} 3.218707
{txt}{space 7}lead11 {c |}{col 15}{res}{space 2}-2.165671{col 27}{space 2} 1.582677{col 38}{space 1}   -1.37{col 47}{space 3}0.265{col 55}{space 4}-7.202457{col 68}{space 3} 2.871115
{txt}{space 7}lead10 {c |}{col 15}{res}{space 2}-4.977492{col 27}{space 2} 2.104496{col 38}{space 1}   -2.37{col 47}{space 3}0.099{col 55}{space 4}-11.67494{col 68}{space 3} 1.719953
{txt}{space 8}lead9 {c |}{col 15}{res}{space 2}-2.691431{col 27}{space 2}  1.18821{col 38}{space 1}   -2.27{col 47}{space 3}0.108{col 55}{space 4}-6.472846{col 68}{space 3} 1.089983
{txt}{space 8}lead8 {c |}{col 15}{res}{space 2} 2.989795{col 27}{space 2} 2.470199{col 38}{space 1}    1.21{col 47}{space 3}0.313{col 55}{space 4}-4.871482{col 68}{space 3} 10.85107
{txt}{space 8}lead7 {c |}{col 15}{res}{space 2} 3.136637{col 27}{space 2}  2.45617{col 38}{space 1}    1.28{col 47}{space 3}0.291{col 55}{space 4}-4.679992{col 68}{space 3} 10.95327
{txt}{space 8}lead6 {c |}{col 15}{res}{space 2}-3.528403{col 27}{space 2} .8856523{col 38}{space 1}   -3.98{col 47}{space 3}0.028{col 55}{space 4}-6.346944{col 68}{space 3}-.7098626
{txt}{space 8}lead5 {c |}{col 15}{res}{space 2}-8.031224{col 27}{space 2} 1.823151{col 38}{space 1}   -4.41{col 47}{space 3}0.022{col 55}{space 4} -13.8333{col 68}{space 3}-2.229143
{txt}{space 8}lead4 {c |}{col 15}{res}{space 2}-3.797366{col 27}{space 2}  2.16436{col 38}{space 1}   -1.75{col 47}{space 3}0.178{col 55}{space 4}-10.68532{col 68}{space 3} 3.090593
{txt}{space 8}lead3 {c |}{col 15}{res}{space 2}-6.295567{col 27}{space 2} 1.485474{col 38}{space 1}   -4.24{col 47}{space 3}0.024{col 55}{space 4}-11.02301{col 68}{space 3}-1.568125
{txt}{space 8}lead2 {c |}{col 15}{res}{space 2}-1.170955{col 27}{space 2} 2.326869{col 38}{space 1}   -0.50{col 47}{space 3}0.649{col 55}{space 4} -8.57609{col 68}{space 3} 6.234179
{txt}{space 9}lag0 {c |}{col 15}{res}{space 2}-1.381133{col 27}{space 2}  .498982{col 38}{space 1}   -2.77{col 47}{space 3}0.070{col 55}{space 4}-2.969117{col 68}{space 3} .2068504
{txt}{space 9}lag1 {c |}{col 15}{res}{space 2}-3.611404{col 27}{space 2} 1.567737{col 38}{space 1}   -2.30{col 47}{space 3}0.105{col 55}{space 4}-8.600641{col 68}{space 3} 1.377834
{txt}{space 9}lag2 {c |}{col 15}{res}{space 2}-2.740854{col 27}{space 2} 1.743055{col 38}{space 1}   -1.57{col 47}{space 3}0.214{col 55}{space 4}-8.288032{col 68}{space 3} 2.806324
{txt}{space 9}lag3 {c |}{col 15}{res}{space 2}-2.976927{col 27}{space 2} 3.898509{col 38}{space 1}   -0.76{col 47}{space 3}0.501{col 55}{space 4}-15.38372{col 68}{space 3}  9.42987
{txt}{space 9}lag4 {c |}{col 15}{res}{space 2} 2.092845{col 27}{space 2} 3.912477{col 38}{space 1}    0.53{col 47}{space 3}0.630{col 55}{space 4} -10.3584{col 68}{space 3} 14.54409
{txt}{space 9}lag5 {c |}{col 15}{res}{space 2}-.1368723{col 27}{space 2} 3.524105{col 38}{space 1}   -0.04{col 47}{space 3}0.971{col 55}{space 4}-11.35215{col 68}{space 3}  11.0784
{txt}{space 9}lag6 {c |}{col 15}{res}{space 2}-.7839437{col 27}{space 2} 5.530257{col 38}{space 1}   -0.14{col 47}{space 3}0.896{col 55}{space 4}-18.38369{col 68}{space 3}  16.8158
{txt}{space 9}lag7 {c |}{col 15}{res}{space 2} .7482455{col 27}{space 2} 2.614395{col 38}{space 1}    0.29{col 47}{space 3}0.793{col 55}{space 4}-7.571926{col 68}{space 3} 9.068417
{txt}{space 9}lag8 {c |}{col 15}{res}{space 2} 6.060553{col 27}{space 2} 3.897036{col 38}{space 1}    1.56{col 47}{space 3}0.218{col 55}{space 4}-6.341556{col 68}{space 3} 18.46266
{txt}{space 9}lag9 {c |}{col 15}{res}{space 2} 4.976053{col 27}{space 2} 4.394418{col 38}{space 1}    1.13{col 47}{space 3}0.340{col 55}{space 4}-9.008947{col 68}{space 3} 18.96105
{txt}{space 8}lag10 {c |}{col 15}{res}{space 2} .3445494{col 27}{space 2} 4.327787{col 38}{space 1}    0.08{col 47}{space 3}0.942{col 55}{space 4} -13.4284{col 68}{space 3}  14.1175
{txt}{space 8}lag11 {c |}{col 15}{res}{space 2}-.9589008{col 27}{space 2} 3.130858{col 38}{space 1}   -0.31{col 47}{space 3}0.779{col 55}{space 4}-10.92269{col 68}{space 3} 9.004888
{txt}{space 8}lag12 {c |}{col 15}{res}{space 2} .8244116{col 27}{space 2} 4.821555{col 38}{space 1}    0.17{col 47}{space 3}0.875{col 55}{space 4}-14.51993{col 68}{space 3} 16.16875
{txt}{space 8}lag13 {c |}{col 15}{res}{space 2}  1.72113{col 27}{space 2} 2.312656{col 38}{space 1}    0.74{col 47}{space 3}0.511{col 55}{space 4}-5.638774{col 68}{space 3} 9.081034
{txt}{space 8}lag14 {c |}{col 15}{res}{space 2} 1.490598{col 27}{space 2} 2.472903{col 38}{space 1}    0.60{col 47}{space 3}0.589{col 55}{space 4}-6.379284{col 68}{space 3}  9.36048
{txt}{space 8}lag15 {c |}{col 15}{res}{space 2} .4503856{col 27}{space 2} 3.369503{col 38}{space 1}    0.13{col 47}{space 3}0.902{col 55}{space 4}-10.27288{col 68}{space 3} 11.17365
{txt}{space 8}lag16 {c |}{col 15}{res}{space 2} 2.804554{col 27}{space 2} 1.164736{col 38}{space 1}    2.41{col 47}{space 3}0.095{col 55}{space 4}-.9021544{col 68}{space 3} 6.511262
{txt}{space 8}lag17 {c |}{col 15}{res}{space 2} 5.919787{col 27}{space 2} 1.666836{col 38}{space 1}    3.55{col 47}{space 3}0.038{col 55}{space 4} .6151705{col 68}{space 3}  11.2244
{txt}{space 8}lag18 {c |}{col 15}{res}{space 2}-1.640825{col 27}{space 2} 2.094062{col 38}{space 1}   -0.78{col 47}{space 3}0.490{col 55}{space 4}-8.305065{col 68}{space 3} 5.023415
{txt}{space 8}lag19 {c |}{col 15}{res}{space 2}-4.008467{col 27}{space 2} 2.307663{col 38}{space 1}   -1.74{col 47}{space 3}0.181{col 55}{space 4}-11.35248{col 68}{space 3} 3.335547
{txt}{space 8}lag20 {c |}{col 15}{res}{space 2} 1.267905{col 27}{space 2} 2.035883{col 38}{space 1}    0.62{col 47}{space 3}0.578{col 55}{space 4}-5.211184{col 68}{space 3} 7.746993
{txt}{space 8}lag21 {c |}{col 15}{res}{space 2} .5054702{col 27}{space 2}  5.62481{col 38}{space 1}    0.09{col 47}{space 3}0.934{col 55}{space 4}-17.39518{col 68}{space 3} 18.40612
{txt}{space 8}lag22 {c |}{col 15}{res}{space 2}-.1593152{col 27}{space 2} 2.885592{col 38}{space 1}   -0.06{col 47}{space 3}0.959{col 55}{space 4}-9.342557{col 68}{space 3} 9.023926
{txt}{space 8}lag23 {c |}{col 15}{res}{space 2}-.8279958{col 27}{space 2} 1.088003{col 38}{space 1}   -0.76{col 47}{space 3}0.502{col 55}{space 4}-4.290507{col 68}{space 3} 2.634515
{txt}{space 8}lag24 {c |}{col 15}{res}{space 2}-.2320796{col 27}{space 2} 2.726653{col 38}{space 1}   -0.09{col 47}{space 3}0.938{col 55}{space 4}-8.909506{col 68}{space 3} 8.445346
{txt}{space 8}lag25 {c |}{col 15}{res}{space 2} -2.00311{col 27}{space 2} 3.803404{col 38}{space 1}   -0.53{col 47}{space 3}0.635{col 55}{space 4}-14.10724{col 68}{space 3} 10.10102
{txt}{space 8}lag26 {c |}{col 15}{res}{space 2}-2.195126{col 27}{space 2} 3.050232{col 38}{space 1}   -0.72{col 47}{space 3}0.524{col 55}{space 4}-11.90233{col 68}{space 3} 7.512073
{txt}{space 8}lag27 {c |}{col 15}{res}{space 2}-3.470411{col 27}{space 2} 4.482971{col 38}{space 1}   -0.77{col 47}{space 3}0.495{col 55}{space 4}-17.73722{col 68}{space 3}  10.7964
{txt}{space 8}lag28 {c |}{col 15}{res}{space 2} .8119102{col 27}{space 2} 5.059277{col 38}{space 1}    0.16{col 47}{space 3}0.883{col 55}{space 4}-15.28897{col 68}{space 3} 16.91279
{txt}{space 8}lag29 {c |}{col 15}{res}{space 2} 1.863785{col 27}{space 2} 4.714226{col 38}{space 1}    0.40{col 47}{space 3}0.719{col 55}{space 4}-13.13899{col 68}{space 3} 16.86655
{txt}{space 8}lag30 {c |}{col 15}{res}{space 2}-3.902542{col 27}{space 2} 5.386009{col 38}{space 1}   -0.72{col 47}{space 3}0.521{col 55}{space 4}-21.04323{col 68}{space 3} 13.23814
{txt}{space 8}lag31 {c |}{col 15}{res}{space 2}-4.617418{col 27}{space 2} .4175271{col 38}{space 1}  -11.06{col 47}{space 3}0.002{col 55}{space 4}-5.946176{col 68}{space 3} -3.28866
{txt}{space 8}lag32 {c |}{col 15}{res}{space 2}-1.568444{col 27}{space 2} 2.994863{col 38}{space 1}   -0.52{col 47}{space 3}0.637{col 55}{space 4}-11.09943{col 68}{space 3} 7.962547
{txt}{space 8}lag33 {c |}{col 15}{res}{space 2}-5.022122{col 27}{space 2} 3.729761{col 38}{space 1}   -1.35{col 47}{space 3}0.271{col 55}{space 4}-16.89189{col 68}{space 3} 6.847643
{txt}{space 8}lag34 {c |}{col 15}{res}{space 2}-7.978894{col 27}{space 2}  2.43607{col 38}{space 1}   -3.28{col 47}{space 3}0.047{col 55}{space 4}-15.73156{col 68}{space 3}-.2262304
{txt}{space 8}lag35 {c |}{col 15}{res}{space 2}-5.323305{col 27}{space 2} 3.190886{col 38}{space 1}   -1.67{col 47}{space 3}0.194{col 55}{space 4}-15.47813{col 68}{space 3} 4.831517
{txt}{space 8}lag36 {c |}{col 15}{res}{space 2}-1.106679{col 27}{space 2} 1.993847{col 38}{space 1}   -0.56{col 47}{space 3}0.618{col 55}{space 4}-7.451989{col 68}{space 3} 5.238631
{txt}{space 8}lag37 {c |}{col 15}{res}{space 2} 4.266395{col 27}{space 2} 4.291672{col 38}{space 1}    0.99{col 47}{space 3}0.393{col 55}{space 4} -9.39162{col 68}{space 3} 17.92441
{txt}{space 8}lag38 {c |}{col 15}{res}{space 2}-4.403611{col 27}{space 2} 2.916004{col 38}{space 1}   -1.51{col 47}{space 3}0.228{col 55}{space 4}-13.68364{col 68}{space 3} 4.876415
{txt}{space 8}lag39 {c |}{col 15}{res}{space 2}-6.019198{col 27}{space 2} 3.244248{col 38}{space 1}   -1.86{col 47}{space 3}0.161{col 55}{space 4}-16.34384{col 68}{space 3} 4.305446
{txt}{space 8}lag40 {c |}{col 15}{res}{space 2}-5.513124{col 27}{space 2} 6.258214{col 38}{space 1}   -0.88{col 47}{space 3}0.443{col 55}{space 4}-25.42955{col 68}{space 3}  14.4033
{txt}{space 8}lag41 {c |}{col 15}{res}{space 2}-4.471937{col 27}{space 2} 6.288997{col 38}{space 1}   -0.71{col 47}{space 3}0.528{col 55}{space 4}-24.48633{col 68}{space 3} 15.54246
{txt}{space 8}lag42 {c |}{col 15}{res}{space 2}-2.076311{col 27}{space 2} 7.201273{col 38}{space 1}   -0.29{col 47}{space 3}0.792{col 55}{space 4}-24.99398{col 68}{space 3} 20.84135
{txt}{space 8}lag43 {c |}{col 15}{res}{space 2}-8.670821{col 27}{space 2} 3.323153{col 38}{space 1}   -2.61{col 47}{space 3}0.080{col 55}{space 4}-19.24658{col 68}{space 3} 1.904933
{txt}{space 8}lag44 {c |}{col 15}{res}{space 2}-5.835821{col 27}{space 2} 3.741013{col 38}{space 1}   -1.56{col 47}{space 3}0.217{col 55}{space 4}-17.74139{col 68}{space 3} 6.069752
{txt}{space 8}lag45 {c |}{col 15}{res}{space 2}-1.926924{col 27}{space 2} 4.754568{col 38}{space 1}   -0.41{col 47}{space 3}0.712{col 55}{space 4}-17.05808{col 68}{space 3} 13.20423
{txt}{space 8}lag46 {c |}{col 15}{res}{space 2}-2.641829{col 27}{space 2} 3.145329{col 38}{space 1}   -0.84{col 47}{space 3}0.463{col 55}{space 4}-12.65167{col 68}{space 3} 7.368012
{txt}{space 8}lag47 {c |}{col 15}{res}{space 2} .3832628{col 27}{space 2} 4.908334{col 38}{space 1}    0.08{col 47}{space 3}0.943{col 55}{space 4}-15.23725{col 68}{space 3} 16.00377
{txt}{space 8}lag48 {c |}{col 15}{res}{space 2}-6.451287{col 27}{space 2} 6.585157{col 38}{space 1}   -0.98{col 47}{space 3}0.399{col 55}{space 4}-27.40819{col 68}{space 3} 14.50562
{txt}{space 8}lag49 {c |}{col 15}{res}{space 2}-10.14651{col 27}{space 2} 3.663476{col 38}{space 1}   -2.77{col 47}{space 3}0.070{col 55}{space 4}-21.80533{col 68}{space 3} 1.512304
{txt}{space 8}lag50 {c |}{col 15}{res}{space 2}-10.33187{col 27}{space 2} 3.780884{col 38}{space 1}   -2.73{col 47}{space 3}0.072{col 55}{space 4}-22.36433{col 68}{space 3} 1.700588
{txt}{space 8}lag51 {c |}{col 15}{res}{space 2}-5.302801{col 27}{space 2} 4.046219{col 38}{space 1}   -1.31{col 47}{space 3}0.281{col 55}{space 4}-18.17967{col 68}{space 3} 7.574072
{txt}{space 8}lag52 {c |}{col 15}{res}{space 2}-2.900428{col 27}{space 2} 4.238557{col 38}{space 1}   -0.68{col 47}{space 3}0.543{col 55}{space 4}-16.38941{col 68}{space 3} 10.58855
{txt}{space 8}lag53 {c |}{col 15}{res}{space 2}-9.094871{col 27}{space 2} 5.790151{col 38}{space 1}   -1.57{col 47}{space 3}0.214{col 55}{space 4}-27.52172{col 68}{space 3} 9.331974
{txt}{space 8}lag54 {c |}{col 15}{res}{space 2}-3.727553{col 27}{space 2} 2.934704{col 38}{space 1}   -1.27{col 47}{space 3}0.294{col 55}{space 4}-13.06709{col 68}{space 3} 5.611983
{txt}{space 8}lag55 {c |}{col 15}{res}{space 2}-8.435947{col 27}{space 2} 5.334227{col 38}{space 1}   -1.58{col 47}{space 3}0.212{col 55}{space 4}-25.41184{col 68}{space 3} 8.539943
{txt}{space 8}lag56 {c |}{col 15}{res}{space 2}-.8106501{col 27}{space 2} 1.987593{col 38}{space 1}   -0.41{col 47}{space 3}0.711{col 55}{space 4}-7.136057{col 68}{space 3} 5.514757
{txt}{space 8}lag57 {c |}{col 15}{res}{space 2}-3.740963{col 27}{space 2} 4.575437{col 38}{space 1}   -0.82{col 47}{space 3}0.473{col 55}{space 4}-18.30204{col 68}{space 3} 10.82012
{txt}{space 8}lag58 {c |}{col 15}{res}{space 2}-5.949343{col 27}{space 2} 2.865372{col 38}{space 1}   -2.08{col 47}{space 3}0.129{col 55}{space 4}-15.06823{col 68}{space 3} 3.169548
{txt}{space 8}lag59 {c |}{col 15}{res}{space 2}-3.449077{col 27}{space 2} 3.443989{col 38}{space 1}   -1.00{col 47}{space 3}0.390{col 55}{space 4}-14.40939{col 68}{space 3} 7.511233
{txt}{space 8}lag60 {c |}{col 15}{res}{space 2}-3.789816{col 27}{space 2} 4.524678{col 38}{space 1}   -0.84{col 47}{space 3}0.464{col 55}{space 4}-18.18936{col 68}{space 3} 10.60973
{txt}{space 8}lag61 {c |}{col 15}{res}{space 2}-6.147227{col 27}{space 2} 7.195542{col 38}{space 1}   -0.85{col 47}{space 3}0.456{col 55}{space 4}-29.04665{col 68}{space 3}  16.7522
{txt}{space 8}lag62 {c |}{col 15}{res}{space 2}-6.263746{col 27}{space 2} 5.975704{col 38}{space 1}   -1.05{col 47}{space 3}0.372{col 55}{space 4} -25.2811{col 68}{space 3} 12.75361
{txt}{space 8}lag63 {c |}{col 15}{res}{space 2}-9.259143{col 27}{space 2} 8.015517{col 38}{space 1}   -1.16{col 47}{space 3}0.332{col 55}{space 4}-34.76809{col 68}{space 3} 16.24981
{txt}{space 8}lag64 {c |}{col 15}{res}{space 2}-10.27149{col 27}{space 2}    3.947{col 38}{space 1}   -2.60{col 47}{space 3}0.080{col 55}{space 4}-22.83261{col 68}{space 3} 2.289622
{txt}{space 8}lag65 {c |}{col 15}{res}{space 2} -17.3484{col 27}{space 2} 5.716556{col 38}{space 1}   -3.03{col 47}{space 3}0.056{col 55}{space 4}-35.54103{col 68}{space 3} .8442292
{txt}{space 8}lag66 {c |}{col 15}{res}{space 2}-3.074283{col 27}{space 2} 5.039647{col 38}{space 1}   -0.61{col 47}{space 3}0.585{col 55}{space 4}-19.11269{col 68}{space 3} 12.96412
{txt}{space 8}lag67 {c |}{col 15}{res}{space 2}-.8406965{col 27}{space 2} 8.470159{col 38}{space 1}   -0.10{col 47}{space 3}0.927{col 55}{space 4}-27.79652{col 68}{space 3} 26.11513
{txt}{space 8}lag68 {c |}{col 15}{res}{space 2}-1.877899{col 27}{space 2} 7.180844{col 38}{space 1}   -0.26{col 47}{space 3}0.811{col 55}{space 4}-24.73055{col 68}{space 3} 20.97475
{txt}{space 8}lag69 {c |}{col 15}{res}{space 2}-9.483075{col 27}{space 2} 3.362548{col 38}{space 1}   -2.82{col 47}{space 3}0.067{col 55}{space 4} -20.1842{col 68}{space 3} 1.218052
{txt}{space 8}lag70 {c |}{col 15}{res}{space 2}-7.630519{col 27}{space 2} 4.383151{col 38}{space 1}   -1.74{col 47}{space 3}0.180{col 55}{space 4}-21.57966{col 68}{space 3} 6.318623
{txt}{space 8}lag71 {c |}{col 15}{res}{space 2}-10.91265{col 27}{space 2} 3.903433{col 38}{space 1}   -2.80{col 47}{space 3}0.068{col 55}{space 4}-23.33511{col 68}{space 3}  1.50982
{txt}{space 8}lag72 {c |}{col 15}{res}{space 2}-6.399699{col 27}{space 2} 5.397839{col 38}{space 1}   -1.19{col 47}{space 3}0.321{col 55}{space 4}-23.57803{col 68}{space 3} 10.77863
{txt}{space 8}lag73 {c |}{col 15}{res}{space 2}-4.368801{col 27}{space 2} 7.375264{col 38}{space 1}   -0.59{col 47}{space 3}0.595{col 55}{space 4}-27.84018{col 68}{space 3} 19.10258
{txt}{space 8}lag74 {c |}{col 15}{res}{space 2}-6.422927{col 27}{space 2} 6.953323{col 38}{space 1}   -0.92{col 47}{space 3}0.424{col 55}{space 4} -28.5515{col 68}{space 3} 15.70565
{txt}{space 8}lag75 {c |}{col 15}{res}{space 2}-4.585189{col 27}{space 2} 7.945193{col 38}{space 1}   -0.58{col 47}{space 3}0.604{col 55}{space 4}-29.87034{col 68}{space 3} 20.69996
{txt}{space 8}lag76 {c |}{col 15}{res}{space 2}-7.832273{col 27}{space 2} 4.677759{col 38}{space 1}   -1.67{col 47}{space 3}0.193{col 55}{space 4}-22.71899{col 68}{space 3} 7.054445
{txt}{space 8}lag77 {c |}{col 15}{res}{space 2}-12.45863{col 27}{space 2} 2.671468{col 38}{space 1}   -4.66{col 47}{space 3}0.019{col 55}{space 4}-20.96043{col 68}{space 3}-3.956823
{txt}{space 8}lag78 {c |}{col 15}{res}{space 2} -6.42562{col 27}{space 2} 7.203957{col 38}{space 1}   -0.89{col 47}{space 3}0.438{col 55}{space 4}-29.35183{col 68}{space 3} 16.50059
{txt}{space 8}lag79 {c |}{col 15}{res}{space 2}-5.778614{col 27}{space 2} 6.766704{col 38}{space 1}   -0.85{col 47}{space 3}0.456{col 55}{space 4}-27.31329{col 68}{space 3} 15.75606
{txt}{space 8}lag80 {c |}{col 15}{res}{space 2}-2.597003{col 27}{space 2}  7.48861{col 38}{space 1}   -0.35{col 47}{space 3}0.752{col 55}{space 4} -26.4291{col 68}{space 3}  21.2351
{txt}{space 8}lag81 {c |}{col 15}{res}{space 2}-3.875905{col 27}{space 2} 6.957673{col 38}{space 1}   -0.56{col 47}{space 3}0.616{col 55}{space 4}-26.01833{col 68}{space 3} 18.26652
{txt}{space 8}lag82 {c |}{col 15}{res}{space 2}-9.744336{col 27}{space 2} 5.071686{col 38}{space 1}   -1.92{col 47}{space 3}0.150{col 55}{space 4} -25.8847{col 68}{space 3} 6.396031
{txt}{space 8}lag83 {c |}{col 15}{res}{space 2} 1.206521{col 27}{space 2} 4.985137{col 38}{space 1}    0.24{col 47}{space 3}0.824{col 55}{space 4}-14.65841{col 68}{space 3} 17.07145
{txt}{space 8}lag84 {c |}{col 15}{res}{space 2}-2.171756{col 27}{space 2} 3.346839{col 38}{space 1}   -0.65{col 47}{space 3}0.563{col 55}{space 4}-12.82289{col 68}{space 3}  8.47938
{txt}{space 8}lag85 {c |}{col 15}{res}{space 2} -7.48313{col 27}{space 2} 5.476732{col 38}{space 1}   -1.37{col 47}{space 3}0.265{col 55}{space 4}-24.91254{col 68}{space 3} 9.946277
{txt}{space 8}lag86 {c |}{col 15}{res}{space 2}-10.37415{col 27}{space 2} 4.672981{col 38}{space 1}   -2.22{col 47}{space 3}0.113{col 55}{space 4}-25.24566{col 68}{space 3} 4.497364
{txt}{space 8}lag87 {c |}{col 15}{res}{space 2}-8.267106{col 27}{space 2} 6.848704{col 38}{space 1}   -1.21{col 47}{space 3}0.314{col 55}{space 4}-30.06274{col 68}{space 3} 13.52853
{txt}{space 8}lag88 {c |}{col 15}{res}{space 2}-9.422653{col 27}{space 2} 5.992827{col 38}{space 1}   -1.57{col 47}{space 3}0.214{col 55}{space 4} -28.4945{col 68}{space 3} 9.649196
{txt}{space 8}lag89 {c |}{col 15}{res}{space 2}-.7395868{col 27}{space 2} 6.665641{col 38}{space 1}   -0.11{col 47}{space 3}0.919{col 55}{space 4}-21.95263{col 68}{space 3} 20.47346
{txt}{space 8}lag90 {c |}{col 15}{res}{space 2}-7.910717{col 27}{space 2} 4.399243{col 38}{space 1}   -1.80{col 47}{space 3}0.170{col 55}{space 4}-21.91107{col 68}{space 3} 6.089636
{txt}{space 8}lag91 {c |}{col 15}{res}{space 2}-9.422188{col 27}{space 2} 5.405936{col 38}{space 1}   -1.74{col 47}{space 3}0.180{col 55}{space 4}-26.62629{col 68}{space 3} 7.781914
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}-131.6351{col 27}{space 2} 23.05655{col 38}{space 1}   -5.71{col 47}{space 3}0.011{col 55}{space 4}-205.0113{col 68}{space 3}-58.25886
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}   regionid1{col 14}{c |}{space 1}        4{col 27}{space 1}        4{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}        date{col 14}{c |}{space 1}     5267{col 27}{space 1}        1{col 39}{result}{space 1}     5266{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. graph export "results/EventStudy-MiddayCo2-Dropping-Tasmania.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/simonpostler/Desktop/applied-econometrics-dst-master-2/results/EventStudy-MiddayCo2-Dropping-Tasmania.png{rm}
saved as
PNG
format
{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/6h/778gphg5533gk87_wkb11wqh0000gn/T//SD01922.000000"
{txt}
{com}. eventdd energy_wh_per_capita_vs_midday public_holiday c.temperature##c.temperature solar_exposure wind_3  [aweight = population], timevar(timevar) method(hdfe, absorb(regionid1 date) cluster(regionid1)) graph_op(ytitle("Wh energy p.c.") xtitle("Days until DST transition") title("Event Study - Energy - Midday - w/o Tasmania"))
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}{txt}warning: missing F statistic; dropped variables due to collinearity or too few clusters
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,011,258
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F( 190,      3)}{col 67}=          {res}.
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.2081
{txt}{col 51}Adj R-squared{col 67}= {res}    0.2038
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0150
{txt}{col 1}Number of clusters ({res}regionid1{txt}) {col 30}= {res}         4{txt}{col 51}Root MSE{col 67}= {res}   64.6808

{txt}{ralign 79:(Std. err. adjusted for {res:4} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}energy_wh_p~y{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
public_holi~y {c |}{col 15}{res}{space 2} 9.600304{col 27}{space 2}  2.47093{col 38}{space 1}    3.89{col 47}{space 3}0.030{col 55}{space 4} 1.736702{col 68}{space 3} 17.46391
{txt}{space 2}temperature {c |}{col 15}{res}{space 2} 11.12038{col 27}{space 2} 1.218245{col 38}{space 1}    9.13{col 47}{space 3}0.003{col 55}{space 4}  7.24338{col 68}{space 3} 14.99738
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2}-.2262089{col 27}{space 2} .0197675{col 38}{space 1}  -11.44{col 47}{space 3}0.001{col 55}{space 4}-.2891178{col 68}{space 3}   -.1633
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2} 2.501117{col 27}{space 2} .6119212{col 38}{space 1}    4.09{col 47}{space 3}0.026{col 55}{space 4} .5537103{col 68}{space 3} 4.448523
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2}-2.081447{col 27}{space 2} 1.041635{col 38}{space 1}   -2.00{col 47}{space 3}0.140{col 55}{space 4}-5.396395{col 68}{space 3} 1.233502
{txt}{space 7}lead94 {c |}{col 15}{res}{space 2} 2.377411{col 27}{space 2} 14.06448{col 38}{space 1}    0.17{col 47}{space 3}0.877{col 55}{space 4}-42.38205{col 68}{space 3} 47.13687
{txt}{space 7}lead93 {c |}{col 15}{res}{space 2} -4.91144{col 27}{space 2} 2.233633{col 38}{space 1}   -2.20{col 47}{space 3}0.115{col 55}{space 4}-12.01986{col 68}{space 3} 2.196975
{txt}{space 7}lead92 {c |}{col 15}{res}{space 2} 9.911256{col 27}{space 2} 4.029302{col 38}{space 1}    2.46{col 47}{space 3}0.091{col 55}{space 4}-2.911783{col 68}{space 3} 22.73429
{txt}{space 7}lead91 {c |}{col 15}{res}{space 2} 12.32509{col 27}{space 2} 9.328568{col 38}{space 1}    1.32{col 47}{space 3}0.278{col 55}{space 4}-17.36257{col 68}{space 3} 42.01276
{txt}{space 7}lead90 {c |}{col 15}{res}{space 2} 7.791668{col 27}{space 2} 6.073435{col 38}{space 1}    1.28{col 47}{space 3}0.290{col 55}{space 4}-11.53671{col 68}{space 3} 27.12005
{txt}{space 7}lead89 {c |}{col 15}{res}{space 2} 5.305367{col 27}{space 2} 7.152388{col 38}{space 1}    0.74{col 47}{space 3}0.512{col 55}{space 4}-17.45672{col 68}{space 3} 28.06746
{txt}{space 7}lead88 {c |}{col 15}{res}{space 2} 11.92154{col 27}{space 2} 4.203979{col 38}{space 1}    2.84{col 47}{space 3}0.066{col 55}{space 4}-1.457403{col 68}{space 3} 25.30047
{txt}{space 7}lead87 {c |}{col 15}{res}{space 2} 7.070835{col 27}{space 2}   6.5327{col 38}{space 1}    1.08{col 47}{space 3}0.358{col 55}{space 4}-13.71913{col 68}{space 3}  27.8608
{txt}{space 7}lead86 {c |}{col 15}{res}{space 2} 2.712799{col 27}{space 2} 6.084624{col 38}{space 1}    0.45{col 47}{space 3}0.686{col 55}{space 4}-16.65119{col 68}{space 3} 22.07679
{txt}{space 7}lead85 {c |}{col 15}{res}{space 2} 1.713644{col 27}{space 2} 8.344331{col 38}{space 1}    0.21{col 47}{space 3}0.850{col 55}{space 4}-24.84174{col 68}{space 3} 28.26903
{txt}{space 7}lead84 {c |}{col 15}{res}{space 2} 11.64265{col 27}{space 2} 9.063374{col 38}{space 1}    1.28{col 47}{space 3}0.289{col 55}{space 4}-17.20106{col 68}{space 3} 40.48635
{txt}{space 7}lead83 {c |}{col 15}{res}{space 2} 2.899468{col 27}{space 2} 5.905403{col 38}{space 1}    0.49{col 47}{space 3}0.657{col 55}{space 4}-15.89416{col 68}{space 3}  21.6931
{txt}{space 7}lead82 {c |}{col 15}{res}{space 2} 1.024295{col 27}{space 2} 4.851124{col 38}{space 1}    0.21{col 47}{space 3}0.846{col 55}{space 4}-14.41415{col 68}{space 3} 16.46274
{txt}{space 7}lead81 {c |}{col 15}{res}{space 2}-2.434677{col 27}{space 2} 4.208248{col 38}{space 1}   -0.58{col 47}{space 3}0.603{col 55}{space 4} -15.8272{col 68}{space 3} 10.95785
{txt}{space 7}lead80 {c |}{col 15}{res}{space 2}-7.059367{col 27}{space 2} 6.302125{col 38}{space 1}   -1.12{col 47}{space 3}0.344{col 55}{space 4}-27.11554{col 68}{space 3} 12.99681
{txt}{space 7}lead79 {c |}{col 15}{res}{space 2} .0267497{col 27}{space 2} 5.994105{col 38}{space 1}    0.00{col 47}{space 3}0.997{col 55}{space 4}-19.04917{col 68}{space 3} 19.10267
{txt}{space 7}lead78 {c |}{col 15}{res}{space 2} 2.700443{col 27}{space 2} 6.147346{col 38}{space 1}    0.44{col 47}{space 3}0.690{col 55}{space 4}-16.86316{col 68}{space 3} 22.26404
{txt}{space 7}lead77 {c |}{col 15}{res}{space 2} 11.39963{col 27}{space 2} 4.273307{col 38}{space 1}    2.67{col 47}{space 3}0.076{col 55}{space 4}-2.199941{col 68}{space 3}  24.9992
{txt}{space 7}lead76 {c |}{col 15}{res}{space 2} 3.614977{col 27}{space 2} 5.384126{col 38}{space 1}    0.67{col 47}{space 3}0.550{col 55}{space 4}-13.51971{col 68}{space 3} 20.74967
{txt}{space 7}lead75 {c |}{col 15}{res}{space 2} 3.300413{col 27}{space 2} 8.675019{col 38}{space 1}    0.38{col 47}{space 3}0.729{col 55}{space 4}-24.30737{col 68}{space 3} 30.90819
{txt}{space 7}lead74 {c |}{col 15}{res}{space 2} 4.031094{col 27}{space 2} 8.347539{col 38}{space 1}    0.48{col 47}{space 3}0.662{col 55}{space 4} -22.5345{col 68}{space 3} 30.59669
{txt}{space 7}lead73 {c |}{col 15}{res}{space 2} 4.854516{col 27}{space 2} 6.116926{col 38}{space 1}    0.79{col 47}{space 3}0.485{col 55}{space 4}-14.61227{col 68}{space 3}  24.3213
{txt}{space 7}lead72 {c |}{col 15}{res}{space 2} 9.691752{col 27}{space 2} 6.724239{col 38}{space 1}    1.44{col 47}{space 3}0.245{col 55}{space 4}-11.70778{col 68}{space 3} 31.09128
{txt}{space 7}lead71 {c |}{col 15}{res}{space 2} 10.01204{col 27}{space 2} 5.419855{col 38}{space 1}    1.85{col 47}{space 3}0.162{col 55}{space 4}-7.236355{col 68}{space 3} 27.26044
{txt}{space 7}lead70 {c |}{col 15}{res}{space 2} 12.02975{col 27}{space 2} 5.770098{col 38}{space 1}    2.08{col 47}{space 3}0.128{col 55}{space 4}-6.333273{col 68}{space 3} 30.39278
{txt}{space 7}lead69 {c |}{col 15}{res}{space 2} 6.438105{col 27}{space 2} 8.343888{col 38}{space 1}    0.77{col 47}{space 3}0.497{col 55}{space 4}-20.11587{col 68}{space 3} 32.99208
{txt}{space 7}lead68 {c |}{col 15}{res}{space 2} .5186443{col 27}{space 2} 8.455995{col 38}{space 1}    0.06{col 47}{space 3}0.955{col 55}{space 4}-26.39211{col 68}{space 3} 27.42939
{txt}{space 7}lead67 {c |}{col 15}{res}{space 2} .3006311{col 27}{space 2} 9.361866{col 38}{space 1}    0.03{col 47}{space 3}0.976{col 55}{space 4}  -29.493{col 68}{space 3} 30.09427
{txt}{space 7}lead66 {c |}{col 15}{res}{space 2} 1.502516{col 27}{space 2}  8.52582{col 38}{space 1}    0.18{col 47}{space 3}0.871{col 55}{space 4}-25.63045{col 68}{space 3} 28.63548
{txt}{space 7}lead65 {c |}{col 15}{res}{space 2} .9635026{col 27}{space 2} 8.553175{col 38}{space 1}    0.11{col 47}{space 3}0.917{col 55}{space 4}-26.25652{col 68}{space 3} 28.18352
{txt}{space 7}lead64 {c |}{col 15}{res}{space 2}  5.03205{col 27}{space 2} 5.722846{col 38}{space 1}    0.88{col 47}{space 3}0.444{col 55}{space 4} -13.1806{col 68}{space 3}  23.2447
{txt}{space 7}lead63 {c |}{col 15}{res}{space 2} 11.28124{col 27}{space 2}  5.41091{col 38}{space 1}    2.08{col 47}{space 3}0.128{col 55}{space 4}-5.938685{col 68}{space 3} 28.50117
{txt}{space 7}lead62 {c |}{col 15}{res}{space 2} 6.301609{col 27}{space 2} 2.984365{col 38}{space 1}    2.11{col 47}{space 3}0.125{col 55}{space 4}-3.195973{col 68}{space 3} 15.79919
{txt}{space 7}lead61 {c |}{col 15}{res}{space 2} 9.132127{col 27}{space 2} 5.035376{col 38}{space 1}    1.81{col 47}{space 3}0.167{col 55}{space 4}-6.892687{col 68}{space 3} 25.15694
{txt}{space 7}lead60 {c |}{col 15}{res}{space 2} 8.302635{col 27}{space 2} 6.773379{col 38}{space 1}    1.23{col 47}{space 3}0.308{col 55}{space 4}-13.25328{col 68}{space 3} 29.85855
{txt}{space 7}lead59 {c |}{col 15}{res}{space 2} 4.488056{col 27}{space 2} 7.775303{col 38}{space 1}    0.58{col 47}{space 3}0.604{col 55}{space 4}-20.25643{col 68}{space 3} 29.23254
{txt}{space 7}lead58 {c |}{col 15}{res}{space 2} 4.492482{col 27}{space 2} 9.013764{col 38}{space 1}    0.50{col 47}{space 3}0.652{col 55}{space 4}-24.19334{col 68}{space 3}  33.1783
{txt}{space 7}lead57 {c |}{col 15}{res}{space 2} 2.674198{col 27}{space 2} 6.738853{col 38}{space 1}    0.40{col 47}{space 3}0.718{col 55}{space 4}-18.77184{col 68}{space 3} 24.12023
{txt}{space 7}lead56 {c |}{col 15}{res}{space 2} 10.73647{col 27}{space 2} 5.470525{col 38}{space 1}    1.96{col 47}{space 3}0.144{col 55}{space 4}-6.673177{col 68}{space 3} 28.14613
{txt}{space 7}lead55 {c |}{col 15}{res}{space 2} 8.768166{col 27}{space 2} 5.617842{col 38}{space 1}    1.56{col 47}{space 3}0.216{col 55}{space 4}-9.110314{col 68}{space 3} 26.64665
{txt}{space 7}lead54 {c |}{col 15}{res}{space 2}  6.79633{col 27}{space 2} 6.277266{col 38}{space 1}    1.08{col 47}{space 3}0.358{col 55}{space 4}-13.18073{col 68}{space 3} 26.77339
{txt}{space 7}lead53 {c |}{col 15}{res}{space 2} 2.225464{col 27}{space 2} 6.497729{col 38}{space 1}    0.34{col 47}{space 3}0.755{col 55}{space 4}-18.45321{col 68}{space 3} 22.90414
{txt}{space 7}lead52 {c |}{col 15}{res}{space 2} .3902858{col 27}{space 2} 8.494933{col 38}{space 1}    0.05{col 47}{space 3}0.966{col 55}{space 4}-26.64438{col 68}{space 3} 27.42496
{txt}{space 7}lead51 {c |}{col 15}{res}{space 2}-4.018247{col 27}{space 2} 7.091189{col 38}{space 1}   -0.57{col 47}{space 3}0.611{col 55}{space 4}-26.58558{col 68}{space 3} 18.54908
{txt}{space 7}lead50 {c |}{col 15}{res}{space 2} 3.835902{col 27}{space 2} 4.020803{col 38}{space 1}    0.95{col 47}{space 3}0.410{col 55}{space 4}-8.960089{col 68}{space 3} 16.63189
{txt}{space 7}lead49 {c |}{col 15}{res}{space 2}-.2864389{col 27}{space 2} 3.482007{col 38}{space 1}   -0.08{col 47}{space 3}0.940{col 55}{space 4}-11.36774{col 68}{space 3} 10.79486
{txt}{space 7}lead48 {c |}{col 15}{res}{space 2}-3.737446{col 27}{space 2} 3.694187{col 38}{space 1}   -1.01{col 47}{space 3}0.386{col 55}{space 4}  -15.494{col 68}{space 3} 8.019106
{txt}{space 7}lead47 {c |}{col 15}{res}{space 2}-4.846695{col 27}{space 2} 4.827259{col 38}{space 1}   -1.00{col 47}{space 3}0.389{col 55}{space 4}-20.20919{col 68}{space 3}  10.5158
{txt}{space 7}lead46 {c |}{col 15}{res}{space 2} 4.533251{col 27}{space 2} 7.031017{col 38}{space 1}    0.64{col 47}{space 3}0.565{col 55}{space 4}-17.84258{col 68}{space 3} 26.90908
{txt}{space 7}lead45 {c |}{col 15}{res}{space 2} 2.479858{col 27}{space 2}  4.45124{col 38}{space 1}    0.56{col 47}{space 3}0.616{col 55}{space 4}-11.68597{col 68}{space 3} 16.64569
{txt}{space 7}lead44 {c |}{col 15}{res}{space 2}-1.095577{col 27}{space 2} 5.748276{col 38}{space 1}   -0.19{col 47}{space 3}0.861{col 55}{space 4}-19.38916{col 68}{space 3}   17.198
{txt}{space 7}lead43 {c |}{col 15}{res}{space 2}-1.235677{col 27}{space 2} 4.900928{col 38}{space 1}   -0.25{col 47}{space 3}0.817{col 55}{space 4}-16.83262{col 68}{space 3} 14.36126
{txt}{space 7}lead42 {c |}{col 15}{res}{space 2} 5.165446{col 27}{space 2} 1.930272{col 38}{space 1}    2.68{col 47}{space 3}0.075{col 55}{space 4}-.9775409{col 68}{space 3} 11.30843
{txt}{space 7}lead41 {c |}{col 15}{res}{space 2} 4.533034{col 27}{space 2} 2.499811{col 38}{space 1}    1.81{col 47}{space 3}0.167{col 55}{space 4}-3.422481{col 68}{space 3} 12.48855
{txt}{space 7}lead40 {c |}{col 15}{res}{space 2} 3.346982{col 27}{space 2} 4.383866{col 38}{space 1}    0.76{col 47}{space 3}0.501{col 55}{space 4}-10.60444{col 68}{space 3}  17.2984
{txt}{space 7}lead39 {c |}{col 15}{res}{space 2}-1.620906{col 27}{space 2} 6.858484{col 38}{space 1}   -0.24{col 47}{space 3}0.828{col 55}{space 4}-23.44766{col 68}{space 3} 20.20585
{txt}{space 7}lead38 {c |}{col 15}{res}{space 2} 4.467227{col 27}{space 2} 5.637973{col 38}{space 1}    0.79{col 47}{space 3}0.486{col 55}{space 4}-13.47532{col 68}{space 3} 22.40977
{txt}{space 7}lead37 {c |}{col 15}{res}{space 2}  4.10296{col 27}{space 2} 4.277987{col 38}{space 1}    0.96{col 47}{space 3}0.408{col 55}{space 4}-9.511504{col 68}{space 3} 17.71742
{txt}{space 7}lead36 {c |}{col 15}{res}{space 2} 1.513137{col 27}{space 2} 3.416677{col 38}{space 1}    0.44{col 47}{space 3}0.688{col 55}{space 4}-9.360254{col 68}{space 3} 12.38653
{txt}{space 7}lead35 {c |}{col 15}{res}{space 2} 10.43579{col 27}{space 2} 5.318394{col 38}{space 1}    1.96{col 47}{space 3}0.145{col 55}{space 4} -6.48971{col 68}{space 3}  27.3613
{txt}{space 7}lead34 {c |}{col 15}{res}{space 2} 2.413368{col 27}{space 2} 5.794928{col 38}{space 1}    0.42{col 47}{space 3}0.705{col 55}{space 4}-16.02868{col 68}{space 3} 20.85542
{txt}{space 7}lead33 {c |}{col 15}{res}{space 2}-1.043554{col 27}{space 2} 5.866242{col 38}{space 1}   -0.18{col 47}{space 3}0.870{col 55}{space 4}-19.71255{col 68}{space 3} 17.62544
{txt}{space 7}lead32 {c |}{col 15}{res}{space 2} 3.274281{col 27}{space 2} 4.327284{col 38}{space 1}    0.76{col 47}{space 3}0.504{col 55}{space 4}-10.49707{col 68}{space 3} 17.04563
{txt}{space 7}lead31 {c |}{col 15}{res}{space 2} 1.455623{col 27}{space 2} 2.816287{col 38}{space 1}    0.52{col 47}{space 3}0.641{col 55}{space 4}-7.507059{col 68}{space 3} 10.41831
{txt}{space 7}lead30 {c |}{col 15}{res}{space 2} 2.277703{col 27}{space 2} 2.800762{col 38}{space 1}    0.81{col 47}{space 3}0.476{col 55}{space 4}-6.635571{col 68}{space 3} 11.19098
{txt}{space 7}lead29 {c |}{col 15}{res}{space 2} 6.499149{col 27}{space 2} 3.352783{col 38}{space 1}    1.94{col 47}{space 3}0.148{col 55}{space 4}-4.170903{col 68}{space 3}  17.1692
{txt}{space 7}lead28 {c |}{col 15}{res}{space 2} 7.879688{col 27}{space 2} 2.934558{col 38}{space 1}    2.69{col 47}{space 3}0.075{col 55}{space 4}-1.459384{col 68}{space 3} 17.21876
{txt}{space 7}lead27 {c |}{col 15}{res}{space 2} 5.299918{col 27}{space 2} 2.834231{col 38}{space 1}    1.87{col 47}{space 3}0.158{col 55}{space 4}-3.719871{col 68}{space 3} 14.31971
{txt}{space 7}lead26 {c |}{col 15}{res}{space 2} .4573029{col 27}{space 2} 4.574459{col 38}{space 1}    0.10{col 47}{space 3}0.927{col 55}{space 4}-14.10067{col 68}{space 3} 15.01527
{txt}{space 7}lead25 {c |}{col 15}{res}{space 2}-2.039448{col 27}{space 2}  2.24142{col 38}{space 1}   -0.91{col 47}{space 3}0.430{col 55}{space 4}-9.172648{col 68}{space 3} 5.093751
{txt}{space 7}lead24 {c |}{col 15}{res}{space 2}-.0199185{col 27}{space 2} 3.334516{col 38}{space 1}   -0.01{col 47}{space 3}0.996{col 55}{space 4}-10.63184{col 68}{space 3}   10.592
{txt}{space 7}lead23 {c |}{col 15}{res}{space 2} 2.544138{col 27}{space 2} 3.382716{col 38}{space 1}    0.75{col 47}{space 3}0.507{col 55}{space 4}-8.221176{col 68}{space 3} 13.30945
{txt}{space 7}lead22 {c |}{col 15}{res}{space 2} -1.44253{col 27}{space 2}  2.79724{col 38}{space 1}   -0.52{col 47}{space 3}0.642{col 55}{space 4} -10.3446{col 68}{space 3} 7.459536
{txt}{space 7}lead21 {c |}{col 15}{res}{space 2} 2.782791{col 27}{space 2} 2.418872{col 38}{space 1}    1.15{col 47}{space 3}0.333{col 55}{space 4}-4.915139{col 68}{space 3} 10.48072
{txt}{space 7}lead20 {c |}{col 15}{res}{space 2} 5.013833{col 27}{space 2} 3.174789{col 38}{space 1}    1.58{col 47}{space 3}0.212{col 55}{space 4}-5.089763{col 68}{space 3} 15.11743
{txt}{space 7}lead19 {c |}{col 15}{res}{space 2}-1.936923{col 27}{space 2} 1.314402{col 38}{space 1}   -1.47{col 47}{space 3}0.237{col 55}{space 4}-6.119938{col 68}{space 3} 2.246091
{txt}{space 7}lead18 {c |}{col 15}{res}{space 2} 1.969097{col 27}{space 2} 1.805614{col 38}{space 1}    1.09{col 47}{space 3}0.355{col 55}{space 4}-3.777173{col 68}{space 3} 7.715366
{txt}{space 7}lead17 {c |}{col 15}{res}{space 2}-.5324826{col 27}{space 2} 1.588715{col 38}{space 1}   -0.34{col 47}{space 3}0.760{col 55}{space 4}-5.588483{col 68}{space 3} 4.523517
{txt}{space 7}lead16 {c |}{col 15}{res}{space 2}-2.150541{col 27}{space 2} 3.712731{col 38}{space 1}   -0.58{col 47}{space 3}0.603{col 55}{space 4}-13.96611{col 68}{space 3} 9.665025
{txt}{space 7}lead15 {c |}{col 15}{res}{space 2}-3.747266{col 27}{space 2} 2.875841{col 38}{space 1}   -1.30{col 47}{space 3}0.284{col 55}{space 4}-12.89947{col 68}{space 3} 5.404943
{txt}{space 7}lead14 {c |}{col 15}{res}{space 2}-2.627469{col 27}{space 2} 2.254751{col 38}{space 1}   -1.17{col 47}{space 3}0.328{col 55}{space 4}-9.803092{col 68}{space 3} 4.548154
{txt}{space 7}lead13 {c |}{col 15}{res}{space 2} .4112949{col 27}{space 2} 2.309693{col 38}{space 1}    0.18{col 47}{space 3}0.870{col 55}{space 4} -6.93918{col 68}{space 3}  7.76177
{txt}{space 7}lead12 {c |}{col 15}{res}{space 2}-.1064869{col 27}{space 2} 1.731349{col 38}{space 1}   -0.06{col 47}{space 3}0.955{col 55}{space 4}-5.616411{col 68}{space 3} 5.403437
{txt}{space 7}lead11 {c |}{col 15}{res}{space 2}-2.569814{col 27}{space 2} 3.044076{col 38}{space 1}   -0.84{col 47}{space 3}0.461{col 55}{space 4}-12.25742{col 68}{space 3} 7.117794
{txt}{space 7}lead10 {c |}{col 15}{res}{space 2}-4.001626{col 27}{space 2} 2.001894{col 38}{space 1}   -2.00{col 47}{space 3}0.139{col 55}{space 4}-10.37255{col 68}{space 3} 2.369296
{txt}{space 8}lead9 {c |}{col 15}{res}{space 2}-1.360602{col 27}{space 2} 2.302061{col 38}{space 1}   -0.59{col 47}{space 3}0.596{col 55}{space 4}-8.686788{col 68}{space 3} 5.965584
{txt}{space 8}lead8 {c |}{col 15}{res}{space 2} 4.890378{col 27}{space 2} 2.516998{col 38}{space 1}    1.94{col 47}{space 3}0.147{col 55}{space 4}-3.119832{col 68}{space 3} 12.90059
{txt}{space 8}lead7 {c |}{col 15}{res}{space 2} 3.867519{col 27}{space 2} 1.351127{col 38}{space 1}    2.86{col 47}{space 3}0.064{col 55}{space 4}-.4323688{col 68}{space 3} 8.167407
{txt}{space 8}lead6 {c |}{col 15}{res}{space 2}-4.147356{col 27}{space 2}  1.25484{col 38}{space 1}   -3.31{col 47}{space 3}0.046{col 55}{space 4}-8.140815{col 68}{space 3}-.1538957
{txt}{space 8}lead5 {c |}{col 15}{res}{space 2}-8.160896{col 27}{space 2} 2.397115{col 38}{space 1}   -3.40{col 47}{space 3}0.042{col 55}{space 4}-15.78959{col 68}{space 3}-.5322063
{txt}{space 8}lead4 {c |}{col 15}{res}{space 2}-5.331273{col 27}{space 2} 2.137977{col 38}{space 1}   -2.49{col 47}{space 3}0.088{col 55}{space 4}-12.13527{col 68}{space 3} 1.472724
{txt}{space 8}lead3 {c |}{col 15}{res}{space 2}-4.216909{col 27}{space 2} 2.091123{col 38}{space 1}   -2.02{col 47}{space 3}0.137{col 55}{space 4}-10.87179{col 68}{space 3} 2.437976
{txt}{space 8}lead2 {c |}{col 15}{res}{space 2}  1.54123{col 27}{space 2}  1.09056{col 38}{space 1}    1.41{col 47}{space 3}0.252{col 55}{space 4}-1.929418{col 68}{space 3} 5.011878
{txt}{space 9}lag0 {c |}{col 15}{res}{space 2} 1.252481{col 27}{space 2} .7729347{col 38}{space 1}    1.62{col 47}{space 3}0.204{col 55}{space 4}-1.207342{col 68}{space 3} 3.712304
{txt}{space 9}lag1 {c |}{col 15}{res}{space 2}-2.156571{col 27}{space 2} 1.857308{col 38}{space 1}   -1.16{col 47}{space 3}0.330{col 55}{space 4}-8.067355{col 68}{space 3} 3.754213
{txt}{space 9}lag2 {c |}{col 15}{res}{space 2}-1.309572{col 27}{space 2} 2.193507{col 38}{space 1}   -0.60{col 47}{space 3}0.593{col 55}{space 4}-8.290291{col 68}{space 3} 5.671147
{txt}{space 9}lag3 {c |}{col 15}{res}{space 2}-.2496323{col 27}{space 2} 2.992251{col 38}{space 1}   -0.08{col 47}{space 3}0.939{col 55}{space 4}-9.772312{col 68}{space 3} 9.273047
{txt}{space 9}lag4 {c |}{col 15}{res}{space 2} .2838386{col 27}{space 2} .9349005{col 38}{space 1}    0.30{col 47}{space 3}0.781{col 55}{space 4}-2.691432{col 68}{space 3} 3.259109
{txt}{space 9}lag5 {c |}{col 15}{res}{space 2} 1.757344{col 27}{space 2} 1.993591{col 38}{space 1}    0.88{col 47}{space 3}0.443{col 55}{space 4}-4.587152{col 68}{space 3} 8.101841
{txt}{space 9}lag6 {c |}{col 15}{res}{space 2} 1.543354{col 27}{space 2} 2.780161{col 38}{space 1}    0.56{col 47}{space 3}0.618{col 55}{space 4} -7.30436{col 68}{space 3} 10.39107
{txt}{space 9}lag7 {c |}{col 15}{res}{space 2} 5.120152{col 27}{space 2} 1.271662{col 38}{space 1}    4.03{col 47}{space 3}0.028{col 55}{space 4} 1.073158{col 68}{space 3} 9.167147
{txt}{space 9}lag8 {c |}{col 15}{res}{space 2}  4.91081{col 27}{space 2} 3.421994{col 38}{space 1}    1.44{col 47}{space 3}0.247{col 55}{space 4}-5.979502{col 68}{space 3} 15.80112
{txt}{space 9}lag9 {c |}{col 15}{res}{space 2} 5.610034{col 27}{space 2} 1.333087{col 38}{space 1}    4.21{col 47}{space 3}0.025{col 55}{space 4} 1.367555{col 68}{space 3} 9.852513
{txt}{space 8}lag10 {c |}{col 15}{res}{space 2} 3.663261{col 27}{space 2} 2.933438{col 38}{space 1}    1.25{col 47}{space 3}0.300{col 55}{space 4}-5.672247{col 68}{space 3} 12.99877
{txt}{space 8}lag11 {c |}{col 15}{res}{space 2}-.4705921{col 27}{space 2} 2.335067{col 38}{space 1}   -0.20{col 47}{space 3}0.853{col 55}{space 4}-7.901818{col 68}{space 3} 6.960633
{txt}{space 8}lag12 {c |}{col 15}{res}{space 2} .7178192{col 27}{space 2} 2.009279{col 38}{space 1}    0.36{col 47}{space 3}0.745{col 55}{space 4}-5.676604{col 68}{space 3} 7.112242
{txt}{space 8}lag13 {c |}{col 15}{res}{space 2} .6466914{col 27}{space 2}  1.73094{col 38}{space 1}    0.37{col 47}{space 3}0.734{col 55}{space 4}-4.861932{col 68}{space 3} 6.155315
{txt}{space 8}lag14 {c |}{col 15}{res}{space 2} 4.572683{col 27}{space 2} 1.000758{col 38}{space 1}    4.57{col 47}{space 3}0.020{col 55}{space 4} 1.387824{col 68}{space 3} 7.757542
{txt}{space 8}lag15 {c |}{col 15}{res}{space 2}  5.32762{col 27}{space 2} 4.160739{col 38}{space 1}    1.28{col 47}{space 3}0.290{col 55}{space 4} -7.91371{col 68}{space 3} 18.56895
{txt}{space 8}lag16 {c |}{col 15}{res}{space 2} 7.159789{col 27}{space 2} 1.929822{col 38}{space 1}    3.71{col 47}{space 3}0.034{col 55}{space 4} 1.018236{col 68}{space 3} 13.30134
{txt}{space 8}lag17 {c |}{col 15}{res}{space 2} 8.235265{col 27}{space 2} 1.015894{col 38}{space 1}    8.11{col 47}{space 3}0.004{col 55}{space 4} 5.002237{col 68}{space 3} 11.46829
{txt}{space 8}lag18 {c |}{col 15}{res}{space 2} 1.150473{col 27}{space 2} 2.321743{col 38}{space 1}    0.50{col 47}{space 3}0.654{col 55}{space 4} -6.23835{col 68}{space 3} 8.539296
{txt}{space 8}lag19 {c |}{col 15}{res}{space 2}-.9019195{col 27}{space 2} 1.523392{col 38}{space 1}   -0.59{col 47}{space 3}0.595{col 55}{space 4}-5.750031{col 68}{space 3} 3.946192
{txt}{space 8}lag20 {c |}{col 15}{res}{space 2} 8.747677{col 27}{space 2} 3.415323{col 38}{space 1}    2.56{col 47}{space 3}0.083{col 55}{space 4}-2.121406{col 68}{space 3} 19.61676
{txt}{space 8}lag21 {c |}{col 15}{res}{space 2} 4.736004{col 27}{space 2} 2.269749{col 38}{space 1}    2.09{col 47}{space 3}0.128{col 55}{space 4}-2.487349{col 68}{space 3} 11.95936
{txt}{space 8}lag22 {c |}{col 15}{res}{space 2} 2.550043{col 27}{space 2} 1.709572{col 38}{space 1}    1.49{col 47}{space 3}0.233{col 55}{space 4}-2.890578{col 68}{space 3} 7.990663
{txt}{space 8}lag23 {c |}{col 15}{res}{space 2} 3.643509{col 27}{space 2} 2.600561{col 38}{space 1}    1.40{col 47}{space 3}0.256{col 55}{space 4}-4.632638{col 68}{space 3} 11.91966
{txt}{space 8}lag24 {c |}{col 15}{res}{space 2} 2.534855{col 27}{space 2} 1.866151{col 38}{space 1}    1.36{col 47}{space 3}0.267{col 55}{space 4}-3.404071{col 68}{space 3} 8.473781
{txt}{space 8}lag25 {c |}{col 15}{res}{space 2} 3.537082{col 27}{space 2}  1.61337{col 38}{space 1}    2.19{col 47}{space 3}0.116{col 55}{space 4}-1.597381{col 68}{space 3} 8.671545
{txt}{space 8}lag26 {c |}{col 15}{res}{space 2} 2.278142{col 27}{space 2} 1.193897{col 38}{space 1}    1.91{col 47}{space 3}0.152{col 55}{space 4} -1.52137{col 68}{space 3} 6.077653
{txt}{space 8}lag27 {c |}{col 15}{res}{space 2}  2.32333{col 27}{space 2} 3.078711{col 38}{space 1}    0.75{col 47}{space 3}0.505{col 55}{space 4}-7.474502{col 68}{space 3} 12.12116
{txt}{space 8}lag28 {c |}{col 15}{res}{space 2} .8760626{col 27}{space 2} 2.298315{col 38}{space 1}    0.38{col 47}{space 3}0.728{col 55}{space 4}-6.438203{col 68}{space 3} 8.190328
{txt}{space 8}lag29 {c |}{col 15}{res}{space 2} 3.343917{col 27}{space 2} 3.942489{col 38}{space 1}    0.85{col 47}{space 3}0.459{col 55}{space 4}-9.202842{col 68}{space 3} 15.89068
{txt}{space 8}lag30 {c |}{col 15}{res}{space 2} 2.624095{col 27}{space 2} 2.317021{col 38}{space 1}    1.13{col 47}{space 3}0.340{col 55}{space 4}-4.749698{col 68}{space 3} 9.997889
{txt}{space 8}lag31 {c |}{col 15}{res}{space 2} 3.548057{col 27}{space 2} 2.300524{col 38}{space 1}    1.54{col 47}{space 3}0.221{col 55}{space 4}-3.773238{col 68}{space 3} 10.86935
{txt}{space 8}lag32 {c |}{col 15}{res}{space 2} 3.157492{col 27}{space 2} .6332825{col 38}{space 1}    4.99{col 47}{space 3}0.016{col 55}{space 4} 1.142104{col 68}{space 3} 5.172879
{txt}{space 8}lag33 {c |}{col 15}{res}{space 2} 2.274667{col 27}{space 2} 2.545271{col 38}{space 1}    0.89{col 47}{space 3}0.437{col 55}{space 4}-5.825521{col 68}{space 3} 10.37485
{txt}{space 8}lag34 {c |}{col 15}{res}{space 2}-.0139179{col 27}{space 2} 1.942783{col 38}{space 1}   -0.01{col 47}{space 3}0.995{col 55}{space 4} -6.19672{col 68}{space 3} 6.168885
{txt}{space 8}lag35 {c |}{col 15}{res}{space 2} 2.142652{col 27}{space 2} 3.190483{col 38}{space 1}    0.67{col 47}{space 3}0.550{col 55}{space 4} -8.01089{col 68}{space 3} 12.29619
{txt}{space 8}lag36 {c |}{col 15}{res}{space 2} 3.470022{col 27}{space 2} 2.690959{col 38}{space 1}    1.29{col 47}{space 3}0.288{col 55}{space 4}-5.093811{col 68}{space 3} 12.03385
{txt}{space 8}lag37 {c |}{col 15}{res}{space 2} 7.568857{col 27}{space 2} 1.665083{col 38}{space 1}    4.55{col 47}{space 3}0.020{col 55}{space 4} 2.269819{col 68}{space 3}  12.8679
{txt}{space 8}lag38 {c |}{col 15}{res}{space 2}-1.378425{col 27}{space 2} 1.050468{col 38}{space 1}   -1.31{col 47}{space 3}0.281{col 55}{space 4}-4.721484{col 68}{space 3} 1.964633
{txt}{space 8}lag39 {c |}{col 15}{res}{space 2} .0021868{col 27}{space 2} 3.032251{col 38}{space 1}    0.00{col 47}{space 3}0.999{col 55}{space 4} -9.64779{col 68}{space 3} 9.652164
{txt}{space 8}lag40 {c |}{col 15}{res}{space 2}-2.661953{col 27}{space 2}   2.9725{col 38}{space 1}   -0.90{col 47}{space 3}0.436{col 55}{space 4}-12.12177{col 68}{space 3} 6.797867
{txt}{space 8}lag41 {c |}{col 15}{res}{space 2} 2.667736{col 27}{space 2}   3.3813{col 38}{space 1}    0.79{col 47}{space 3}0.488{col 55}{space 4}-8.093071{col 68}{space 3} 13.42854
{txt}{space 8}lag42 {c |}{col 15}{res}{space 2} 2.563486{col 27}{space 2} 4.074674{col 38}{space 1}    0.63{col 47}{space 3}0.574{col 55}{space 4}-10.40395{col 68}{space 3} 15.53092
{txt}{space 8}lag43 {c |}{col 15}{res}{space 2}-1.424207{col 27}{space 2} 2.651016{col 38}{space 1}   -0.54{col 47}{space 3}0.628{col 55}{space 4}-9.860921{col 68}{space 3} 7.012508
{txt}{space 8}lag44 {c |}{col 15}{res}{space 2}-1.244164{col 27}{space 2} 2.498686{col 38}{space 1}   -0.50{col 47}{space 3}0.653{col 55}{space 4}-9.196098{col 68}{space 3}  6.70777
{txt}{space 8}lag45 {c |}{col 15}{res}{space 2} 2.973891{col 27}{space 2} 3.711375{col 38}{space 1}    0.80{col 47}{space 3}0.482{col 55}{space 4}-8.837362{col 68}{space 3} 14.78514
{txt}{space 8}lag46 {c |}{col 15}{res}{space 2}-1.580141{col 27}{space 2} 1.631925{col 38}{space 1}   -0.97{col 47}{space 3}0.404{col 55}{space 4}-6.773653{col 68}{space 3} 3.613372
{txt}{space 8}lag47 {c |}{col 15}{res}{space 2} 5.114331{col 27}{space 2} 2.345845{col 38}{space 1}    2.18{col 47}{space 3}0.117{col 55}{space 4}-2.351194{col 68}{space 3} 12.57986
{txt}{space 8}lag48 {c |}{col 15}{res}{space 2} 1.729025{col 27}{space 2}  3.20692{col 38}{space 1}    0.54{col 47}{space 3}0.627{col 55}{space 4}-8.476826{col 68}{space 3} 11.93488
{txt}{space 8}lag49 {c |}{col 15}{res}{space 2} .0372744{col 27}{space 2} 4.985693{col 38}{space 1}    0.01{col 47}{space 3}0.995{col 55}{space 4}-15.82943{col 68}{space 3} 15.90398
{txt}{space 8}lag50 {c |}{col 15}{res}{space 2}-5.100176{col 27}{space 2} 3.912111{col 38}{space 1}   -1.30{col 47}{space 3}0.283{col 55}{space 4}-17.55026{col 68}{space 3} 7.349907
{txt}{space 8}lag51 {c |}{col 15}{res}{space 2}-2.143832{col 27}{space 2} 1.547019{col 38}{space 1}   -1.39{col 47}{space 3}0.260{col 55}{space 4}-7.067138{col 68}{space 3} 2.779474
{txt}{space 8}lag52 {c |}{col 15}{res}{space 2} 1.378937{col 27}{space 2} 2.185416{col 38}{space 1}    0.63{col 47}{space 3}0.573{col 55}{space 4} -5.57603{col 68}{space 3} 8.333905
{txt}{space 8}lag53 {c |}{col 15}{res}{space 2}-5.828485{col 27}{space 2} 2.030864{col 38}{space 1}   -2.87{col 47}{space 3}0.064{col 55}{space 4} -12.2916{col 68}{space 3} .6346307
{txt}{space 8}lag54 {c |}{col 15}{res}{space 2} .2404115{col 27}{space 2} 1.901339{col 38}{space 1}    0.13{col 47}{space 3}0.907{col 55}{space 4}-5.810499{col 68}{space 3} 6.291322
{txt}{space 8}lag55 {c |}{col 15}{res}{space 2}-2.856778{col 27}{space 2} 3.663147{col 38}{space 1}   -0.78{col 47}{space 3}0.492{col 55}{space 4}-14.51455{col 68}{space 3} 8.800991
{txt}{space 8}lag56 {c |}{col 15}{res}{space 2} 5.703026{col 27}{space 2} 3.415416{col 38}{space 1}    1.67{col 47}{space 3}0.194{col 55}{space 4}-5.166353{col 68}{space 3} 16.57241
{txt}{space 8}lag57 {c |}{col 15}{res}{space 2} 2.896729{col 27}{space 2} 3.918952{col 38}{space 1}    0.74{col 47}{space 3}0.513{col 55}{space 4}-9.575126{col 68}{space 3} 15.36858
{txt}{space 8}lag58 {c |}{col 15}{res}{space 2} .4457913{col 27}{space 2} 2.621003{col 38}{space 1}    0.17{col 47}{space 3}0.876{col 55}{space 4}-7.895411{col 68}{space 3} 8.786993
{txt}{space 8}lag59 {c |}{col 15}{res}{space 2} 5.138911{col 27}{space 2}  2.86141{col 38}{space 1}    1.80{col 47}{space 3}0.170{col 55}{space 4}-3.967374{col 68}{space 3} 14.24519
{txt}{space 8}lag60 {c |}{col 15}{res}{space 2} 6.778636{col 27}{space 2}  2.21397{col 38}{space 1}    3.06{col 47}{space 3}0.055{col 55}{space 4}-.2672037{col 68}{space 3} 13.82448
{txt}{space 8}lag61 {c |}{col 15}{res}{space 2}-2.588772{col 27}{space 2} 5.163342{col 38}{space 1}   -0.50{col 47}{space 3}0.651{col 55}{space 4}-19.02083{col 68}{space 3} 13.84329
{txt}{space 8}lag62 {c |}{col 15}{res}{space 2}-4.999374{col 27}{space 2} 2.102856{col 38}{space 1}   -2.38{col 47}{space 3}0.098{col 55}{space 4} -11.6916{col 68}{space 3} 1.692851
{txt}{space 8}lag63 {c |}{col 15}{res}{space 2}-4.204841{col 27}{space 2}  4.62503{col 38}{space 1}   -0.91{col 47}{space 3}0.430{col 55}{space 4}-18.92375{col 68}{space 3} 10.51407
{txt}{space 8}lag64 {c |}{col 15}{res}{space 2}-6.019974{col 27}{space 2} 2.776254{col 38}{space 1}   -2.17{col 47}{space 3}0.119{col 55}{space 4}-14.85525{col 68}{space 3} 2.815304
{txt}{space 8}lag65 {c |}{col 15}{res}{space 2}-12.16092{col 27}{space 2} 4.968206{col 38}{space 1}   -2.45{col 47}{space 3}0.092{col 55}{space 4}-27.97197{col 68}{space 3} 3.650126
{txt}{space 8}lag66 {c |}{col 15}{res}{space 2} 2.326398{col 27}{space 2} 1.535703{col 38}{space 1}    1.51{col 47}{space 3}0.227{col 55}{space 4}-2.560895{col 68}{space 3} 7.213691
{txt}{space 8}lag67 {c |}{col 15}{res}{space 2} 2.121685{col 27}{space 2} 3.336413{col 38}{space 1}    0.64{col 47}{space 3}0.570{col 55}{space 4} -8.49627{col 68}{space 3} 12.73964
{txt}{space 8}lag68 {c |}{col 15}{res}{space 2} 1.632841{col 27}{space 2}  4.05923{col 38}{space 1}    0.40{col 47}{space 3}0.714{col 55}{space 4}-11.28544{col 68}{space 3} 14.55112
{txt}{space 8}lag69 {c |}{col 15}{res}{space 2}-9.001763{col 27}{space 2} 1.968238{col 38}{space 1}   -4.57{col 47}{space 3}0.020{col 55}{space 4}-15.26557{col 68}{space 3}-2.737953
{txt}{space 8}lag70 {c |}{col 15}{res}{space 2}-4.383102{col 27}{space 2} 4.568811{col 38}{space 1}   -0.96{col 47}{space 3}0.408{col 55}{space 4} -18.9231{col 68}{space 3} 10.15689
{txt}{space 8}lag71 {c |}{col 15}{res}{space 2}-4.225367{col 27}{space 2} 3.699827{col 38}{space 1}   -1.14{col 47}{space 3}0.336{col 55}{space 4}-15.99987{col 68}{space 3} 7.549132
{txt}{space 8}lag72 {c |}{col 15}{res}{space 2}-4.374002{col 27}{space 2} 3.540948{col 38}{space 1}   -1.24{col 47}{space 3}0.305{col 55}{space 4}-15.64288{col 68}{space 3} 6.894876
{txt}{space 8}lag73 {c |}{col 15}{res}{space 2} 1.461307{col 27}{space 2} 6.392049{col 38}{space 1}    0.23{col 47}{space 3}0.834{col 55}{space 4}-18.88105{col 68}{space 3} 21.80366
{txt}{space 8}lag74 {c |}{col 15}{res}{space 2} .6802432{col 27}{space 2} 4.066308{col 38}{space 1}    0.17{col 47}{space 3}0.878{col 55}{space 4}-12.26056{col 68}{space 3} 13.62105
{txt}{space 8}lag75 {c |}{col 15}{res}{space 2} 1.520614{col 27}{space 2} 4.803748{col 38}{space 1}    0.32{col 47}{space 3}0.772{col 55}{space 4}-13.76706{col 68}{space 3} 16.80828
{txt}{space 8}lag76 {c |}{col 15}{res}{space 2}-.5032656{col 27}{space 2}  5.24909{col 38}{space 1}   -0.10{col 47}{space 3}0.930{col 55}{space 4}-17.20821{col 68}{space 3} 16.20168
{txt}{space 8}lag77 {c |}{col 15}{res}{space 2}-3.794153{col 27}{space 2} 4.326131{col 38}{space 1}   -0.88{col 47}{space 3}0.445{col 55}{space 4}-17.56183{col 68}{space 3} 9.973527
{txt}{space 8}lag78 {c |}{col 15}{res}{space 2}-3.257045{col 27}{space 2} 4.973829{col 38}{space 1}   -0.65{col 47}{space 3}0.559{col 55}{space 4}-19.08599{col 68}{space 3}  12.5719
{txt}{space 8}lag79 {c |}{col 15}{res}{space 2}-4.790136{col 27}{space 2} 3.810281{col 38}{space 1}   -1.26{col 47}{space 3}0.298{col 55}{space 4}-16.91615{col 68}{space 3} 7.335877
{txt}{space 8}lag80 {c |}{col 15}{res}{space 2}-.5336362{col 27}{space 2} 5.573295{col 38}{space 1}   -0.10{col 47}{space 3}0.930{col 55}{space 4}-18.27035{col 68}{space 3} 17.20307
{txt}{space 8}lag81 {c |}{col 15}{res}{space 2}-3.429005{col 27}{space 2} 3.864603{col 38}{space 1}   -0.89{col 47}{space 3}0.440{col 55}{space 4} -15.7279{col 68}{space 3} 8.869886
{txt}{space 8}lag82 {c |}{col 15}{res}{space 2}-6.923238{col 27}{space 2} 2.283205{col 38}{space 1}   -3.03{col 47}{space 3}0.056{col 55}{space 4}-14.18942{col 68}{space 3} .3429401
{txt}{space 8}lag83 {c |}{col 15}{res}{space 2}  5.40065{col 27}{space 2} 2.519289{col 38}{space 1}    2.14{col 47}{space 3}0.121{col 55}{space 4}-2.616853{col 68}{space 3} 13.41815
{txt}{space 8}lag84 {c |}{col 15}{res}{space 2} 3.895207{col 27}{space 2} 4.517067{col 38}{space 1}    0.86{col 47}{space 3}0.452{col 55}{space 4}-10.48012{col 68}{space 3} 18.27053
{txt}{space 8}lag85 {c |}{col 15}{res}{space 2}-2.191598{col 27}{space 2} 4.631492{col 38}{space 1}   -0.47{col 47}{space 3}0.668{col 55}{space 4}-16.93107{col 68}{space 3} 12.54788
{txt}{space 8}lag86 {c |}{col 15}{res}{space 2}-2.658504{col 27}{space 2} 4.817259{col 38}{space 1}   -0.55{col 47}{space 3}0.619{col 55}{space 4}-17.98917{col 68}{space 3} 12.67216
{txt}{space 8}lag87 {c |}{col 15}{res}{space 2}-2.154425{col 27}{space 2}  4.74998{col 38}{space 1}   -0.45{col 47}{space 3}0.681{col 55}{space 4}-17.27098{col 68}{space 3} 12.96213
{txt}{space 8}lag88 {c |}{col 15}{res}{space 2}-.8979482{col 27}{space 2} 4.201151{col 38}{space 1}   -0.21{col 47}{space 3}0.844{col 55}{space 4}-14.26788{col 68}{space 3} 12.47199
{txt}{space 8}lag89 {c |}{col 15}{res}{space 2} 2.701128{col 27}{space 2} 4.014981{col 38}{space 1}    0.67{col 47}{space 3}0.549{col 55}{space 4}-10.07633{col 68}{space 3} 15.47859
{txt}{space 8}lag90 {c |}{col 15}{res}{space 2} 1.435211{col 27}{space 2}   3.0209{col 38}{space 1}    0.48{col 47}{space 3}0.667{col 55}{space 4}-8.178642{col 68}{space 3} 11.04906
{txt}{space 8}lag91 {c |}{col 15}{res}{space 2}-.9790423{col 27}{space 2} 5.017551{col 38}{space 1}   -0.20{col 47}{space 3}0.858{col 55}{space 4}-16.94713{col 68}{space 3} 14.98904
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}-141.8493{col 27}{space 2} 18.02266{col 38}{space 1}   -7.87{col 47}{space 3}0.004{col 55}{space 4}-199.2055{col 68}{space 3}-84.49317
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}   regionid1{col 14}{c |}{space 1}        4{col 27}{space 1}        4{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}        date{col 14}{c |}{space 1}     5267{col 27}{space 1}        1{col 39}{result}{space 1}     5266{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. graph export "results/EventStudy-MiddayElec-Dropping-Tasmania.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/simonpostler/Desktop/applied-econometrics-dst-master-2/results/EventStudy-MiddayElec-Dropping-Tasmania.png{rm}
saved as
PNG
format
{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/6h/778gphg5533gk87_wkb11wqh0000gn/T//SD01922.000000"
{txt}
{com}. gen ln_co2 = ln(co2_g_per_capita_vs_midday)
{txt}(447,951 missing values generated)

{com}. eventdd ln_co2 public_holiday c.temperature##c.temperature solar_exposure wind_3  [aweight = population], timevar(timevar) method(hdfe, absorb(regionid1 date) cluster(regionid1)) graph_op(ytitle("ln(Co2) g per capita") xtitle("Days until DST transition") title("Event Study - lnCO2 - Midday - w/o Tasmania"))
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}{txt}warning: missing F statistic; dropped variables due to collinearity or too few clusters
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}   563,307
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F( 190,      3)}{col 67}=          {res}.
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.2171
{txt}{col 51}Adj R-squared{col 67}= {res}    0.2095
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0084
{txt}{col 1}Number of clusters ({res}regionid1{txt}) {col 30}= {res}         4{txt}{col 51}Root MSE{col 67}= {res}    1.1264

{txt}{ralign 79:(Std. err. adjusted for {res:4} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}       ln_co2{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
public_holi~y {c |}{col 15}{res}{space 2} .1576274{col 27}{space 2} .0597885{col 38}{space 1}    2.64{col 47}{space 3}0.078{col 55}{space 4}-.0326463{col 68}{space 3} .3479011
{txt}{space 2}temperature {c |}{col 15}{res}{space 2} .0913018{col 27}{space 2}  .045874{col 38}{space 1}    1.99{col 47}{space 3}0.141{col 55}{space 4}-.0546898{col 68}{space 3} .2372934
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2}-.0015273{col 27}{space 2} .0009133{col 38}{space 1}   -1.67{col 47}{space 3}0.193{col 55}{space 4}-.0044339{col 68}{space 3} .0013792
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2} .0624025{col 27}{space 2} .0194037{col 38}{space 1}    3.22{col 47}{space 3}0.049{col 55}{space 4} .0006512{col 68}{space 3} .1241537
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2}-.0553575{col 27}{space 2} .0462803{col 38}{space 1}   -1.20{col 47}{space 3}0.318{col 55}{space 4}-.2026421{col 68}{space 3} .0919271
{txt}{space 7}lead94 {c |}{col 15}{res}{space 2} .1407922{col 27}{space 2} .2802148{col 38}{space 1}    0.50{col 47}{space 3}0.650{col 55}{space 4}-.7509763{col 68}{space 3} 1.032561
{txt}{space 7}lead93 {c |}{col 15}{res}{space 2}-.1106821{col 27}{space 2} .1059597{col 38}{space 1}   -1.04{col 47}{space 3}0.373{col 55}{space 4}-.4478931{col 68}{space 3} .2265289
{txt}{space 7}lead92 {c |}{col 15}{res}{space 2} .4788547{col 27}{space 2} .1197117{col 38}{space 1}    4.00{col 47}{space 3}0.028{col 55}{space 4} .0978788{col 68}{space 3} .8598307
{txt}{space 7}lead91 {c |}{col 15}{res}{space 2} .3377217{col 27}{space 2} .2165485{col 38}{space 1}    1.56{col 47}{space 3}0.217{col 55}{space 4}-.3514323{col 68}{space 3} 1.026876
{txt}{space 7}lead90 {c |}{col 15}{res}{space 2} .1972494{col 27}{space 2} .2060029{col 38}{space 1}    0.96{col 47}{space 3}0.409{col 55}{space 4}-.4583438{col 68}{space 3} .8528427
{txt}{space 7}lead89 {c |}{col 15}{res}{space 2} .0423983{col 27}{space 2} .1773413{col 38}{space 1}    0.24{col 47}{space 3}0.826{col 55}{space 4}-.5219809{col 68}{space 3} .6067775
{txt}{space 7}lead88 {c |}{col 15}{res}{space 2}  .166934{col 27}{space 2} .1554598{col 38}{space 1}    1.07{col 47}{space 3}0.362{col 55}{space 4}-.3278086{col 68}{space 3} .6616766
{txt}{space 7}lead87 {c |}{col 15}{res}{space 2}-.0148951{col 27}{space 2} .1318009{col 38}{space 1}   -0.11{col 47}{space 3}0.917{col 55}{space 4}-.4343442{col 68}{space 3}  .404554
{txt}{space 7}lead86 {c |}{col 15}{res}{space 2}-.1084588{col 27}{space 2} .1828245{col 38}{space 1}   -0.59{col 47}{space 3}0.595{col 55}{space 4}-.6902878{col 68}{space 3} .4733703
{txt}{space 7}lead85 {c |}{col 15}{res}{space 2}-.0707952{col 27}{space 2} .2423841{col 38}{space 1}   -0.29{col 47}{space 3}0.789{col 55}{space 4}-.8421697{col 68}{space 3} .7005792
{txt}{space 7}lead84 {c |}{col 15}{res}{space 2} .3661788{col 27}{space 2} .2180934{col 38}{space 1}    1.68{col 47}{space 3}0.192{col 55}{space 4}-.3278917{col 68}{space 3} 1.060249
{txt}{space 7}lead83 {c |}{col 15}{res}{space 2}  .150178{col 27}{space 2} .2355959{col 38}{space 1}    0.64{col 47}{space 3}0.569{col 55}{space 4}-.5995932{col 68}{space 3} .8999493
{txt}{space 7}lead82 {c |}{col 15}{res}{space 2} .0938482{col 27}{space 2} .1725409{col 38}{space 1}    0.54{col 47}{space 3}0.624{col 55}{space 4}-.4552539{col 68}{space 3} .6429504
{txt}{space 7}lead81 {c |}{col 15}{res}{space 2} .0467318{col 27}{space 2} .1479892{col 38}{space 1}    0.32{col 47}{space 3}0.773{col 55}{space 4} -.424236{col 68}{space 3} .5176996
{txt}{space 7}lead80 {c |}{col 15}{res}{space 2}-.1777496{col 27}{space 2}  .254005{col 38}{space 1}   -0.70{col 47}{space 3}0.534{col 55}{space 4} -.986107{col 68}{space 3} .6306077
{txt}{space 7}lead79 {c |}{col 15}{res}{space 2}-.1295812{col 27}{space 2} .1803579{col 38}{space 1}   -0.72{col 47}{space 3}0.524{col 55}{space 4}-.7035606{col 68}{space 3} .4443982
{txt}{space 7}lead78 {c |}{col 15}{res}{space 2} .0543202{col 27}{space 2} .2018223{col 38}{space 1}    0.27{col 47}{space 3}0.805{col 55}{space 4}-.5879685{col 68}{space 3} .6966089
{txt}{space 7}lead77 {c |}{col 15}{res}{space 2} .2737447{col 27}{space 2} .1291668{col 38}{space 1}    2.12{col 47}{space 3}0.124{col 55}{space 4}-.1373216{col 68}{space 3}  .684811
{txt}{space 7}lead76 {c |}{col 15}{res}{space 2} .0549357{col 27}{space 2} .1445628{col 38}{space 1}    0.38{col 47}{space 3}0.729{col 55}{space 4}-.4051277{col 68}{space 3} .5149991
{txt}{space 7}lead75 {c |}{col 15}{res}{space 2} .0817808{col 27}{space 2} .2466449{col 38}{space 1}    0.33{col 47}{space 3}0.762{col 55}{space 4}-.7031533{col 68}{space 3} .8667149
{txt}{space 7}lead74 {c |}{col 15}{res}{space 2} .1153984{col 27}{space 2} .1840698{col 38}{space 1}    0.63{col 47}{space 3}0.575{col 55}{space 4}-.4703939{col 68}{space 3} .7011908
{txt}{space 7}lead73 {c |}{col 15}{res}{space 2} .1790315{col 27}{space 2} .1638611{col 38}{space 1}    1.09{col 47}{space 3}0.354{col 55}{space 4}-.3424478{col 68}{space 3} .7005108
{txt}{space 7}lead72 {c |}{col 15}{res}{space 2} .2624995{col 27}{space 2} .1675624{col 38}{space 1}    1.57{col 47}{space 3}0.215{col 55}{space 4} -.270759{col 68}{space 3} .7957579
{txt}{space 7}lead71 {c |}{col 15}{res}{space 2}  .306712{col 27}{space 2} .1886883{col 38}{space 1}    1.63{col 47}{space 3}0.203{col 55}{space 4}-.2937782{col 68}{space 3} .9072022
{txt}{space 7}lead70 {c |}{col 15}{res}{space 2} .3672114{col 27}{space 2} .1759995{col 38}{space 1}    2.09{col 47}{space 3}0.128{col 55}{space 4}-.1928976{col 68}{space 3} .9273205
{txt}{space 7}lead69 {c |}{col 15}{res}{space 2} .1950791{col 27}{space 2} .2452903{col 38}{space 1}    0.80{col 47}{space 3}0.485{col 55}{space 4} -.585544{col 68}{space 3} .9757022
{txt}{space 7}lead68 {c |}{col 15}{res}{space 2} .0501023{col 27}{space 2} .2080219{col 38}{space 1}    0.24{col 47}{space 3}0.825{col 55}{space 4}-.6119162{col 68}{space 3} .7121207
{txt}{space 7}lead67 {c |}{col 15}{res}{space 2} .0593578{col 27}{space 2} .2113138{col 38}{space 1}    0.28{col 47}{space 3}0.797{col 55}{space 4}-.6131371{col 68}{space 3} .7318527
{txt}{space 7}lead66 {c |}{col 15}{res}{space 2} .1102399{col 27}{space 2} .1732651{col 38}{space 1}    0.64{col 47}{space 3}0.570{col 55}{space 4}-.4411669{col 68}{space 3} .6616467
{txt}{space 7}lead65 {c |}{col 15}{res}{space 2}  .167846{col 27}{space 2} .1947694{col 38}{space 1}    0.86{col 47}{space 3}0.452{col 55}{space 4}-.4519971{col 68}{space 3} .7876892
{txt}{space 7}lead64 {c |}{col 15}{res}{space 2} .2618745{col 27}{space 2} .1252263{col 38}{space 1}    2.09{col 47}{space 3}0.128{col 55}{space 4}-.1366515{col 68}{space 3} .6604004
{txt}{space 7}lead63 {c |}{col 15}{res}{space 2} .3043081{col 27}{space 2} .1085108{col 38}{space 1}    2.80{col 47}{space 3}0.068{col 55}{space 4}-.0410219{col 68}{space 3}  .649638
{txt}{space 7}lead62 {c |}{col 15}{res}{space 2} .1334981{col 27}{space 2} .1451791{col 38}{space 1}    0.92{col 47}{space 3}0.426{col 55}{space 4}-.3285267{col 68}{space 3} .5955229
{txt}{space 7}lead61 {c |}{col 15}{res}{space 2} .1578278{col 27}{space 2} .1554211{col 38}{space 1}    1.02{col 47}{space 3}0.385{col 55}{space 4}-.3367915{col 68}{space 3} .6524471
{txt}{space 7}lead60 {c |}{col 15}{res}{space 2} .1307404{col 27}{space 2} .1770973{col 38}{space 1}    0.74{col 47}{space 3}0.514{col 55}{space 4}-.4328622{col 68}{space 3} .6943429
{txt}{space 7}lead59 {c |}{col 15}{res}{space 2} .0043147{col 27}{space 2} .2366041{col 38}{space 1}    0.02{col 47}{space 3}0.987{col 55}{space 4}-.7486651{col 68}{space 3} .7572945
{txt}{space 7}lead58 {c |}{col 15}{res}{space 2}  .184835{col 27}{space 2} .2070894{col 38}{space 1}    0.89{col 47}{space 3}0.438{col 55}{space 4}-.4742159{col 68}{space 3}  .843886
{txt}{space 7}lead57 {c |}{col 15}{res}{space 2} .1721606{col 27}{space 2} .1748436{col 38}{space 1}    0.98{col 47}{space 3}0.397{col 55}{space 4}-.3842697{col 68}{space 3} .7285908
{txt}{space 7}lead56 {c |}{col 15}{res}{space 2} .4245489{col 27}{space 2} .1235781{col 38}{space 1}    3.44{col 47}{space 3}0.041{col 55}{space 4} .0312681{col 68}{space 3} .8178297
{txt}{space 7}lead55 {c |}{col 15}{res}{space 2} .2719625{col 27}{space 2} .1757997{col 38}{space 1}    1.55{col 47}{space 3}0.220{col 55}{space 4}-.2875105{col 68}{space 3} .8314355
{txt}{space 7}lead54 {c |}{col 15}{res}{space 2} .1223309{col 27}{space 2} .1618146{col 38}{space 1}    0.76{col 47}{space 3}0.505{col 55}{space 4}-.3926352{col 68}{space 3} .6372971
{txt}{space 7}lead53 {c |}{col 15}{res}{space 2} .2017239{col 27}{space 2} .1626852{col 38}{space 1}    1.24{col 47}{space 3}0.303{col 55}{space 4}-.3160131{col 68}{space 3} .7194609
{txt}{space 7}lead52 {c |}{col 15}{res}{space 2} .0361003{col 27}{space 2} .2652249{col 38}{space 1}    0.14{col 47}{space 3}0.900{col 55}{space 4}-.8079636{col 68}{space 3} .8801643
{txt}{space 7}lead51 {c |}{col 15}{res}{space 2} .0356166{col 27}{space 2} .1532496{col 38}{space 1}    0.23{col 47}{space 3}0.831{col 55}{space 4}-.4520919{col 68}{space 3} .5233251
{txt}{space 7}lead50 {c |}{col 15}{res}{space 2} .2319237{col 27}{space 2}  .122614{col 38}{space 1}    1.89{col 47}{space 3}0.155{col 55}{space 4}-.1582889{col 68}{space 3} .6221363
{txt}{space 7}lead49 {c |}{col 15}{res}{space 2} .1175229{col 27}{space 2} .0911044{col 38}{space 1}    1.29{col 47}{space 3}0.287{col 55}{space 4}-.1724119{col 68}{space 3} .4074578
{txt}{space 7}lead48 {c |}{col 15}{res}{space 2}  .017239{col 27}{space 2} .1110377{col 38}{space 1}    0.16{col 47}{space 3}0.886{col 55}{space 4}-.3361324{col 68}{space 3} .3706104
{txt}{space 7}lead47 {c |}{col 15}{res}{space 2}-.0595121{col 27}{space 2} .1611898{col 38}{space 1}   -0.37{col 47}{space 3}0.736{col 55}{space 4}-.5724899{col 68}{space 3} .4534657
{txt}{space 7}lead46 {c |}{col 15}{res}{space 2} .0770504{col 27}{space 2} .2126777{col 38}{space 1}    0.36{col 47}{space 3}0.741{col 55}{space 4}-.5997849{col 68}{space 3} .7538856
{txt}{space 7}lead45 {c |}{col 15}{res}{space 2} .1676638{col 27}{space 2} .1078238{col 38}{space 1}    1.55{col 47}{space 3}0.218{col 55}{space 4}-.1754796{col 68}{space 3} .5108072
{txt}{space 7}lead44 {c |}{col 15}{res}{space 2} .0226319{col 27}{space 2} .2186633{col 38}{space 1}    0.10{col 47}{space 3}0.924{col 55}{space 4}-.6732522{col 68}{space 3}  .718516
{txt}{space 7}lead43 {c |}{col 15}{res}{space 2} .0841696{col 27}{space 2} .1166485{col 38}{space 1}    0.72{col 47}{space 3}0.523{col 55}{space 4} -.287058{col 68}{space 3} .4553972
{txt}{space 7}lead42 {c |}{col 15}{res}{space 2}  .232516{col 27}{space 2} .0565598{col 38}{space 1}    4.11{col 47}{space 3}0.026{col 55}{space 4} .0525175{col 68}{space 3} .4125145
{txt}{space 7}lead41 {c |}{col 15}{res}{space 2} .0871816{col 27}{space 2} .1219134{col 38}{space 1}    0.72{col 47}{space 3}0.526{col 55}{space 4}-.3008013{col 68}{space 3} .4751646
{txt}{space 7}lead40 {c |}{col 15}{res}{space 2}-.0467882{col 27}{space 2} .1354209{col 38}{space 1}   -0.35{col 47}{space 3}0.753{col 55}{space 4}-.4777579{col 68}{space 3} .3841815
{txt}{space 7}lead39 {c |}{col 15}{res}{space 2} -.099873{col 27}{space 2} .2119618{col 38}{space 1}   -0.47{col 47}{space 3}0.670{col 55}{space 4}  -.77443{col 68}{space 3} .5746841
{txt}{space 7}lead38 {c |}{col 15}{res}{space 2} .0780071{col 27}{space 2} .1147054{col 38}{space 1}    0.68{col 47}{space 3}0.545{col 55}{space 4}-.2870368{col 68}{space 3}  .443051
{txt}{space 7}lead37 {c |}{col 15}{res}{space 2}-.0166075{col 27}{space 2} .1467237{col 38}{space 1}   -0.11{col 47}{space 3}0.917{col 55}{space 4}-.4835479{col 68}{space 3} .4503328
{txt}{space 7}lead36 {c |}{col 15}{res}{space 2} .1352407{col 27}{space 2} .1111088{col 38}{space 1}    1.22{col 47}{space 3}0.311{col 55}{space 4} -.218357{col 68}{space 3} .4888384
{txt}{space 7}lead35 {c |}{col 15}{res}{space 2} .3615065{col 27}{space 2} .0772594{col 38}{space 1}    4.68{col 47}{space 3}0.018{col 55}{space 4} .1156327{col 68}{space 3} .6073802
{txt}{space 7}lead34 {c |}{col 15}{res}{space 2} .1708969{col 27}{space 2} .0770742{col 38}{space 1}    2.22{col 47}{space 3}0.113{col 55}{space 4}-.0743877{col 68}{space 3} .4161814
{txt}{space 7}lead33 {c |}{col 15}{res}{space 2} .0062096{col 27}{space 2} .0786613{col 38}{space 1}    0.08{col 47}{space 3}0.942{col 55}{space 4}-.2441257{col 68}{space 3}  .256545
{txt}{space 7}lead32 {c |}{col 15}{res}{space 2}-.0581639{col 27}{space 2} .0902868{col 38}{space 1}   -0.64{col 47}{space 3}0.565{col 55}{space 4}-.3454969{col 68}{space 3} .2291691
{txt}{space 7}lead31 {c |}{col 15}{res}{space 2}-.0096552{col 27}{space 2} .0674422{col 38}{space 1}   -0.14{col 47}{space 3}0.895{col 55}{space 4}-.2242864{col 68}{space 3}  .204976
{txt}{space 7}lead30 {c |}{col 15}{res}{space 2} .1285359{col 27}{space 2} .0587935{col 38}{space 1}    2.19{col 47}{space 3}0.117{col 55}{space 4}-.0585714{col 68}{space 3} .3156432
{txt}{space 7}lead29 {c |}{col 15}{res}{space 2} .2257661{col 27}{space 2} .0771754{col 38}{space 1}    2.93{col 47}{space 3}0.061{col 55}{space 4}-.0198404{col 68}{space 3} .4713727
{txt}{space 7}lead28 {c |}{col 15}{res}{space 2} .3469048{col 27}{space 2} .0797396{col 38}{space 1}    4.35{col 47}{space 3}0.022{col 55}{space 4} .0931377{col 68}{space 3} .6006719
{txt}{space 7}lead27 {c |}{col 15}{res}{space 2} .2857678{col 27}{space 2} .0897007{col 38}{space 1}    3.19{col 47}{space 3}0.050{col 55}{space 4}    .0003{col 68}{space 3} .5712355
{txt}{space 7}lead26 {c |}{col 15}{res}{space 2} .0408392{col 27}{space 2} .0834357{col 38}{space 1}    0.49{col 47}{space 3}0.658{col 55}{space 4}-.2246906{col 68}{space 3} .3063689
{txt}{space 7}lead25 {c |}{col 15}{res}{space 2}-.1314974{col 27}{space 2} .0774172{col 38}{space 1}   -1.70{col 47}{space 3}0.188{col 55}{space 4}-.3778736{col 68}{space 3} .1148788
{txt}{space 7}lead24 {c |}{col 15}{res}{space 2} .0681804{col 27}{space 2} .0799109{col 38}{space 1}    0.85{col 47}{space 3}0.456{col 55}{space 4}-.1861316{col 68}{space 3} .3224924
{txt}{space 7}lead23 {c |}{col 15}{res}{space 2} .0527777{col 27}{space 2} .0759559{col 38}{space 1}    0.69{col 47}{space 3}0.537{col 55}{space 4}-.1889479{col 68}{space 3} .2945033
{txt}{space 7}lead22 {c |}{col 15}{res}{space 2} .0827438{col 27}{space 2} .0359451{col 38}{space 1}    2.30{col 47}{space 3}0.105{col 55}{space 4}-.0316495{col 68}{space 3} .1971371
{txt}{space 7}lead21 {c |}{col 15}{res}{space 2} .2639978{col 27}{space 2} .0580878{col 38}{space 1}    4.54{col 47}{space 3}0.020{col 55}{space 4} .0791363{col 68}{space 3} .4488592
{txt}{space 7}lead20 {c |}{col 15}{res}{space 2} .1855144{col 27}{space 2} .0660707{col 38}{space 1}    2.81{col 47}{space 3}0.067{col 55}{space 4} -.024752{col 68}{space 3} .3957808
{txt}{space 7}lead19 {c |}{col 15}{res}{space 2} .0329311{col 27}{space 2}  .031633{col 38}{space 1}    1.04{col 47}{space 3}0.374{col 55}{space 4}-.0677391{col 68}{space 3} .1336013
{txt}{space 7}lead18 {c |}{col 15}{res}{space 2} .0751938{col 27}{space 2} .0275322{col 38}{space 1}    2.73{col 47}{space 3}0.072{col 55}{space 4} -.012426{col 68}{space 3} .1628137
{txt}{space 7}lead17 {c |}{col 15}{res}{space 2} .0183927{col 27}{space 2} .0905467{col 38}{space 1}    0.20{col 47}{space 3}0.852{col 55}{space 4}-.2697673{col 68}{space 3} .3065526
{txt}{space 7}lead16 {c |}{col 15}{res}{space 2} .0006588{col 27}{space 2} .0766513{col 38}{space 1}    0.01{col 47}{space 3}0.994{col 55}{space 4}-.2432798{col 68}{space 3} .2445973
{txt}{space 7}lead15 {c |}{col 15}{res}{space 2} .0201299{col 27}{space 2} .0952699{col 38}{space 1}    0.21{col 47}{space 3}0.846{col 55}{space 4}-.2830614{col 68}{space 3} .3233211
{txt}{space 7}lead14 {c |}{col 15}{res}{space 2} .2821605{col 27}{space 2} .0230127{col 38}{space 1}   12.26{col 47}{space 3}0.001{col 55}{space 4} .2089237{col 68}{space 3} .3553973
{txt}{space 7}lead13 {c |}{col 15}{res}{space 2} .1397584{col 27}{space 2} .0183839{col 38}{space 1}    7.60{col 47}{space 3}0.005{col 55}{space 4} .0812527{col 68}{space 3} .1982641
{txt}{space 7}lead12 {c |}{col 15}{res}{space 2} .0293831{col 27}{space 2} .0958402{col 38}{space 1}    0.31{col 47}{space 3}0.779{col 55}{space 4}-.2756233{col 68}{space 3} .3343894
{txt}{space 7}lead11 {c |}{col 15}{res}{space 2}-.0832291{col 27}{space 2} .0836838{col 38}{space 1}   -0.99{col 47}{space 3}0.393{col 55}{space 4}-.3495484{col 68}{space 3} .1830902
{txt}{space 7}lead10 {c |}{col 15}{res}{space 2}-.0378108{col 27}{space 2} .0891102{col 38}{space 1}   -0.42{col 47}{space 3}0.700{col 55}{space 4}-.3213991{col 68}{space 3} .2457775
{txt}{space 8}lead9 {c |}{col 15}{res}{space 2}-.0103236{col 27}{space 2} .0776503{col 38}{space 1}   -0.13{col 47}{space 3}0.903{col 55}{space 4}-.2574415{col 68}{space 3} .2367943
{txt}{space 8}lead8 {c |}{col 15}{res}{space 2} .1423684{col 27}{space 2} .0656654{col 38}{space 1}    2.17{col 47}{space 3}0.119{col 55}{space 4}-.0666083{col 68}{space 3} .3513451
{txt}{space 8}lead7 {c |}{col 15}{res}{space 2} .2605146{col 27}{space 2} .0871854{col 38}{space 1}    2.99{col 47}{space 3}0.058{col 55}{space 4}-.0169482{col 68}{space 3} .5379775
{txt}{space 8}lead6 {c |}{col 15}{res}{space 2}-.0851186{col 27}{space 2} .0347744{col 38}{space 1}   -2.45{col 47}{space 3}0.092{col 55}{space 4}-.1957862{col 68}{space 3}  .025549
{txt}{space 8}lead5 {c |}{col 15}{res}{space 2}-.1361958{col 27}{space 2} .0838081{col 38}{space 1}   -1.63{col 47}{space 3}0.203{col 55}{space 4}-.4029107{col 68}{space 3} .1305191
{txt}{space 8}lead4 {c |}{col 15}{res}{space 2}-.1139927{col 27}{space 2} .0116271{col 38}{space 1}   -9.80{col 47}{space 3}0.002{col 55}{space 4}-.1509952{col 68}{space 3}-.0769902
{txt}{space 8}lead3 {c |}{col 15}{res}{space 2}-.1965524{col 27}{space 2} .0663558{col 38}{space 1}   -2.96{col 47}{space 3}0.059{col 55}{space 4}-.4077261{col 68}{space 3} .0146213
{txt}{space 8}lead2 {c |}{col 15}{res}{space 2}-.1286004{col 27}{space 2} .1075023{col 38}{space 1}   -1.20{col 47}{space 3}0.318{col 55}{space 4}-.4707207{col 68}{space 3}   .21352
{txt}{space 9}lag0 {c |}{col 15}{res}{space 2} .0794042{col 27}{space 2} .0605657{col 38}{space 1}    1.31{col 47}{space 3}0.281{col 55}{space 4}-.1133427{col 68}{space 3} .2721512
{txt}{space 9}lag1 {c |}{col 15}{res}{space 2}-.1544173{col 27}{space 2} .0729795{col 38}{space 1}   -2.12{col 47}{space 3}0.125{col 55}{space 4}-.3866706{col 68}{space 3}  .077836
{txt}{space 9}lag2 {c |}{col 15}{res}{space 2}-.0035181{col 27}{space 2} .0363908{col 38}{space 1}   -0.10{col 47}{space 3}0.929{col 55}{space 4}-.1193298{col 68}{space 3} .1122935
{txt}{space 9}lag3 {c |}{col 15}{res}{space 2}-.2264474{col 27}{space 2} .0142548{col 38}{space 1}  -15.89{col 47}{space 3}0.001{col 55}{space 4}-.2718124{col 68}{space 3}-.1810823
{txt}{space 9}lag4 {c |}{col 15}{res}{space 2} -.075071{col 27}{space 2} .0480804{col 38}{space 1}   -1.56{col 47}{space 3}0.216{col 55}{space 4}-.2280843{col 68}{space 3} .0779424
{txt}{space 9}lag5 {c |}{col 15}{res}{space 2} -.192766{col 27}{space 2} .0512665{col 38}{space 1}   -3.76{col 47}{space 3}0.033{col 55}{space 4}-.3559189{col 68}{space 3}-.0296131
{txt}{space 9}lag6 {c |}{col 15}{res}{space 2} -.096617{col 27}{space 2} .0410446{col 38}{space 1}   -2.35{col 47}{space 3}0.100{col 55}{space 4}-.2272391{col 68}{space 3} .0340051
{txt}{space 9}lag7 {c |}{col 15}{res}{space 2} .0500628{col 27}{space 2}  .032663{col 38}{space 1}    1.53{col 47}{space 3}0.223{col 55}{space 4}-.0538853{col 68}{space 3}  .154011
{txt}{space 9}lag8 {c |}{col 15}{res}{space 2} .0399495{col 27}{space 2} .0887591{col 38}{space 1}    0.45{col 47}{space 3}0.683{col 55}{space 4}-.2425217{col 68}{space 3} .3224206
{txt}{space 9}lag9 {c |}{col 15}{res}{space 2} .0011551{col 27}{space 2} .0598357{col 38}{space 1}    0.02{col 47}{space 3}0.986{col 55}{space 4}-.1892689{col 68}{space 3}  .191579
{txt}{space 8}lag10 {c |}{col 15}{res}{space 2}-.1895485{col 27}{space 2} .0688564{col 38}{space 1}   -2.75{col 47}{space 3}0.071{col 55}{space 4}-.4086802{col 68}{space 3} .0295831
{txt}{space 8}lag11 {c |}{col 15}{res}{space 2}-.0693345{col 27}{space 2} .0498112{col 38}{space 1}   -1.39{col 47}{space 3}0.258{col 55}{space 4} -.227856{col 68}{space 3} .0891869
{txt}{space 8}lag12 {c |}{col 15}{res}{space 2}-.0295912{col 27}{space 2} .0311963{col 38}{space 1}   -0.95{col 47}{space 3}0.413{col 55}{space 4}-.1288719{col 68}{space 3} .0696895
{txt}{space 8}lag13 {c |}{col 15}{res}{space 2} .0834139{col 27}{space 2} .0313562{col 38}{space 1}    2.66{col 47}{space 3}0.076{col 55}{space 4}-.0163756{col 68}{space 3} .1832034
{txt}{space 8}lag14 {c |}{col 15}{res}{space 2} .0151363{col 27}{space 2} .0321396{col 38}{space 1}    0.47{col 47}{space 3}0.670{col 55}{space 4}-.0871463{col 68}{space 3} .1174188
{txt}{space 8}lag15 {c |}{col 15}{res}{space 2}-.0014862{col 27}{space 2} .1046252{col 38}{space 1}   -0.01{col 47}{space 3}0.990{col 55}{space 4}-.3344504{col 68}{space 3}  .331478
{txt}{space 8}lag16 {c |}{col 15}{res}{space 2} .0931435{col 27}{space 2} .0448899{col 38}{space 1}    2.07{col 47}{space 3}0.130{col 55}{space 4}-.0497163{col 68}{space 3} .2360034
{txt}{space 8}lag17 {c |}{col 15}{res}{space 2} .0609442{col 27}{space 2} .0352192{col 38}{space 1}    1.73{col 47}{space 3}0.182{col 55}{space 4}-.0511389{col 68}{space 3} .1730273
{txt}{space 8}lag18 {c |}{col 15}{res}{space 2}-.1053589{col 27}{space 2} .0559341{col 38}{space 1}   -1.88{col 47}{space 3}0.156{col 55}{space 4}-.2833663{col 68}{space 3} .0726484
{txt}{space 8}lag19 {c |}{col 15}{res}{space 2} .0301195{col 27}{space 2} .0359677{col 38}{space 1}    0.84{col 47}{space 3}0.464{col 55}{space 4}-.0843457{col 68}{space 3} .1445847
{txt}{space 8}lag20 {c |}{col 15}{res}{space 2} -.000514{col 27}{space 2} .0376682{col 38}{space 1}   -0.01{col 47}{space 3}0.990{col 55}{space 4} -.120391{col 68}{space 3} .1193631
{txt}{space 8}lag21 {c |}{col 15}{res}{space 2} .2289821{col 27}{space 2}  .108221{col 38}{space 1}    2.12{col 47}{space 3}0.125{col 55}{space 4}-.1154253{col 68}{space 3} .5733896
{txt}{space 8}lag22 {c |}{col 15}{res}{space 2} .0419043{col 27}{space 2} .1009677{col 38}{space 1}    0.42{col 47}{space 3}0.706{col 55}{space 4}  -.27942{col 68}{space 3} .3632285
{txt}{space 8}lag23 {c |}{col 15}{res}{space 2} .0283717{col 27}{space 2}  .021211{col 38}{space 1}    1.34{col 47}{space 3}0.273{col 55}{space 4} -.039131{col 68}{space 3} .0958744
{txt}{space 8}lag24 {c |}{col 15}{res}{space 2} .1281999{col 27}{space 2} .0211297{col 38}{space 1}    6.07{col 47}{space 3}0.009{col 55}{space 4} .0609559{col 68}{space 3} .1954438
{txt}{space 8}lag25 {c |}{col 15}{res}{space 2}-.0034443{col 27}{space 2} .0552764{col 38}{space 1}   -0.06{col 47}{space 3}0.954{col 55}{space 4}-.1793585{col 68}{space 3} .1724699
{txt}{space 8}lag26 {c |}{col 15}{res}{space 2}-.0152029{col 27}{space 2} .0354262{col 38}{space 1}   -0.43{col 47}{space 3}0.697{col 55}{space 4} -.127945{col 68}{space 3} .0975391
{txt}{space 8}lag27 {c |}{col 15}{res}{space 2} .0552286{col 27}{space 2}  .057017{col 38}{space 1}    0.97{col 47}{space 3}0.404{col 55}{space 4}-.1262251{col 68}{space 3} .2366822
{txt}{space 8}lag28 {c |}{col 15}{res}{space 2} .0202727{col 27}{space 2} .0849109{col 38}{space 1}    0.24{col 47}{space 3}0.827{col 55}{space 4}-.2499518{col 68}{space 3} .2904972
{txt}{space 8}lag29 {c |}{col 15}{res}{space 2}-.0051727{col 27}{space 2} .0805584{col 38}{space 1}   -0.06{col 47}{space 3}0.953{col 55}{space 4}-.2615453{col 68}{space 3}    .2512
{txt}{space 8}lag30 {c |}{col 15}{res}{space 2}-.0871214{col 27}{space 2} .0601056{col 38}{space 1}   -1.45{col 47}{space 3}0.243{col 55}{space 4}-.2784043{col 68}{space 3} .1041616
{txt}{space 8}lag31 {c |}{col 15}{res}{space 2}-.1341911{col 27}{space 2} .1237938{col 38}{space 1}   -1.08{col 47}{space 3}0.358{col 55}{space 4}-.5281582{col 68}{space 3}  .259776
{txt}{space 8}lag32 {c |}{col 15}{res}{space 2}-.1210872{col 27}{space 2} .0282144{col 38}{space 1}   -4.29{col 47}{space 3}0.023{col 55}{space 4}-.2108778{col 68}{space 3}-.0312965
{txt}{space 8}lag33 {c |}{col 15}{res}{space 2}-.1059673{col 27}{space 2} .0166359{col 38}{space 1}   -6.37{col 47}{space 3}0.008{col 55}{space 4}  -.15891{col 68}{space 3}-.0530246
{txt}{space 8}lag34 {c |}{col 15}{res}{space 2}-.1734395{col 27}{space 2} .0772509{col 38}{space 1}   -2.25{col 47}{space 3}0.110{col 55}{space 4}-.4192863{col 68}{space 3} .0724072
{txt}{space 8}lag35 {c |}{col 15}{res}{space 2}-.0115273{col 27}{space 2} .0610871{col 38}{space 1}   -0.19{col 47}{space 3}0.862{col 55}{space 4}-.2059337{col 68}{space 3} .1828791
{txt}{space 8}lag36 {c |}{col 15}{res}{space 2}-.0345489{col 27}{space 2} .0281624{col 38}{space 1}   -1.23{col 47}{space 3}0.307{col 55}{space 4}-.1241742{col 68}{space 3} .0550764
{txt}{space 8}lag37 {c |}{col 15}{res}{space 2}-.0375209{col 27}{space 2}  .055247{col 38}{space 1}   -0.68{col 47}{space 3}0.546{col 55}{space 4}-.2133414{col 68}{space 3} .1382995
{txt}{space 8}lag38 {c |}{col 15}{res}{space 2}-.0787147{col 27}{space 2} .0325907{col 38}{space 1}   -2.42{col 47}{space 3}0.095{col 55}{space 4}-.1824327{col 68}{space 3} .0250034
{txt}{space 8}lag39 {c |}{col 15}{res}{space 2}-.2266392{col 27}{space 2} .0137327{col 38}{space 1}  -16.50{col 47}{space 3}0.000{col 55}{space 4}-.2703427{col 68}{space 3}-.1829357
{txt}{space 8}lag40 {c |}{col 15}{res}{space 2}-.0312823{col 27}{space 2}   .05051{col 38}{space 1}   -0.62{col 47}{space 3}0.580{col 55}{space 4}-.1920277{col 68}{space 3} .1294632
{txt}{space 8}lag41 {c |}{col 15}{res}{space 2}-.1041064{col 27}{space 2} .0713281{col 38}{space 1}   -1.46{col 47}{space 3}0.241{col 55}{space 4}-.3311043{col 68}{space 3} .1228916
{txt}{space 8}lag42 {c |}{col 15}{res}{space 2}-.0878062{col 27}{space 2} .0234112{col 38}{space 1}   -3.75{col 47}{space 3}0.033{col 55}{space 4} -.162311{col 68}{space 3}-.0133015
{txt}{space 8}lag43 {c |}{col 15}{res}{space 2}-.1905642{col 27}{space 2} .0294473{col 38}{space 1}   -6.47{col 47}{space 3}0.007{col 55}{space 4}-.2842787{col 68}{space 3}-.0968496
{txt}{space 8}lag44 {c |}{col 15}{res}{space 2}-.1895181{col 27}{space 2} .0666024{col 38}{space 1}   -2.85{col 47}{space 3}0.065{col 55}{space 4}-.4014765{col 68}{space 3} .0224403
{txt}{space 8}lag45 {c |}{col 15}{res}{space 2}-.2395626{col 27}{space 2} .0645078{col 38}{space 1}   -3.71{col 47}{space 3}0.034{col 55}{space 4}-.4448551{col 68}{space 3}  -.03427
{txt}{space 8}lag46 {c |}{col 15}{res}{space 2}-.1561849{col 27}{space 2} .1276928{col 38}{space 1}   -1.22{col 47}{space 3}0.309{col 55}{space 4}-.5625603{col 68}{space 3} .2501905
{txt}{space 8}lag47 {c |}{col 15}{res}{space 2}-.1508541{col 27}{space 2} .0494677{col 38}{space 1}   -3.05{col 47}{space 3}0.055{col 55}{space 4}-.3082823{col 68}{space 3}  .006574
{txt}{space 8}lag48 {c |}{col 15}{res}{space 2}  .040191{col 27}{space 2} .0253444{col 38}{space 1}    1.59{col 47}{space 3}0.211{col 55}{space 4}-.0404663{col 68}{space 3} .1208483
{txt}{space 8}lag49 {c |}{col 15}{res}{space 2}-.0757656{col 27}{space 2} .0732991{col 38}{space 1}   -1.03{col 47}{space 3}0.377{col 55}{space 4}-.3090359{col 68}{space 3} .1575047
{txt}{space 8}lag50 {c |}{col 15}{res}{space 2}-.1572363{col 27}{space 2} .0308144{col 38}{space 1}   -5.10{col 47}{space 3}0.015{col 55}{space 4}-.2553016{col 68}{space 3} -.059171
{txt}{space 8}lag51 {c |}{col 15}{res}{space 2}-.0554429{col 27}{space 2} .0268359{col 38}{space 1}   -2.07{col 47}{space 3}0.131{col 55}{space 4}-.1408466{col 68}{space 3} .0299607
{txt}{space 8}lag52 {c |}{col 15}{res}{space 2}-.0998233{col 27}{space 2} .0485844{col 38}{space 1}   -2.05{col 47}{space 3}0.132{col 55}{space 4}-.2544406{col 68}{space 3} .0547939
{txt}{space 8}lag53 {c |}{col 15}{res}{space 2}-.0842833{col 27}{space 2}  .032341{col 38}{space 1}   -2.61{col 47}{space 3}0.080{col 55}{space 4}-.1872069{col 68}{space 3} .0186403
{txt}{space 8}lag54 {c |}{col 15}{res}{space 2}-.2032099{col 27}{space 2} .0437404{col 38}{space 1}   -4.65{col 47}{space 3}0.019{col 55}{space 4}-.3424113{col 68}{space 3}-.0640085
{txt}{space 8}lag55 {c |}{col 15}{res}{space 2}-.1040785{col 27}{space 2} .0568451{col 38}{space 1}   -1.83{col 47}{space 3}0.165{col 55}{space 4} -.284985{col 68}{space 3}  .076828
{txt}{space 8}lag56 {c |}{col 15}{res}{space 2}-.0414048{col 27}{space 2} .1012785{col 38}{space 1}   -0.41{col 47}{space 3}0.710{col 55}{space 4}-.3637182{col 68}{space 3} .2809086
{txt}{space 8}lag57 {c |}{col 15}{res}{space 2}-.1097542{col 27}{space 2} .0409143{col 38}{space 1}   -2.68{col 47}{space 3}0.075{col 55}{space 4}-.2399618{col 68}{space 3} .0204533
{txt}{space 8}lag58 {c |}{col 15}{res}{space 2} -.066828{col 27}{space 2} .0652214{col 38}{space 1}   -1.02{col 47}{space 3}0.381{col 55}{space 4}-.2743915{col 68}{space 3} .1407355
{txt}{space 8}lag59 {c |}{col 15}{res}{space 2}-.0576485{col 27}{space 2} .0484516{col 38}{space 1}   -1.19{col 47}{space 3}0.320{col 55}{space 4}-.2118432{col 68}{space 3} .0965461
{txt}{space 8}lag60 {c |}{col 15}{res}{space 2}-.0508233{col 27}{space 2} .0462701{col 38}{space 1}   -1.10{col 47}{space 3}0.352{col 55}{space 4}-.1980754{col 68}{space 3} .0964288
{txt}{space 8}lag61 {c |}{col 15}{res}{space 2}-.0480847{col 27}{space 2} .0465429{col 38}{space 1}   -1.03{col 47}{space 3}0.378{col 55}{space 4} -.196205{col 68}{space 3} .1000355
{txt}{space 8}lag62 {c |}{col 15}{res}{space 2}-.0385203{col 27}{space 2} .0466802{col 38}{space 1}   -0.83{col 47}{space 3}0.470{col 55}{space 4}-.1870775{col 68}{space 3}  .110037
{txt}{space 8}lag63 {c |}{col 15}{res}{space 2}-.1484287{col 27}{space 2} .0720006{col 38}{space 1}   -2.06{col 47}{space 3}0.131{col 55}{space 4}-.3775668{col 68}{space 3} .0807093
{txt}{space 8}lag64 {c |}{col 15}{res}{space 2} -.015128{col 27}{space 2} .0290671{col 38}{space 1}   -0.52{col 47}{space 3}0.639{col 55}{space 4}-.1076325{col 68}{space 3} .0773765
{txt}{space 8}lag65 {c |}{col 15}{res}{space 2}-.3218321{col 27}{space 2} .1029367{col 38}{space 1}   -3.13{col 47}{space 3}0.052{col 55}{space 4}-.6494224{col 68}{space 3} .0057583
{txt}{space 8}lag66 {c |}{col 15}{res}{space 2} .0033224{col 27}{space 2} .0340439{col 38}{space 1}    0.10{col 47}{space 3}0.928{col 55}{space 4}-.1050205{col 68}{space 3} .1116654
{txt}{space 8}lag67 {c |}{col 15}{res}{space 2}-.0460442{col 27}{space 2} .0343175{col 38}{space 1}   -1.34{col 47}{space 3}0.272{col 55}{space 4}-.1552577{col 68}{space 3} .0631693
{txt}{space 8}lag68 {c |}{col 15}{res}{space 2} .0107164{col 27}{space 2} .0194774{col 38}{space 1}    0.55{col 47}{space 3}0.621{col 55}{space 4}-.0512695{col 68}{space 3} .0727022
{txt}{space 8}lag69 {c |}{col 15}{res}{space 2}-.1330174{col 27}{space 2} .0464611{col 38}{space 1}   -2.86{col 47}{space 3}0.064{col 55}{space 4}-.2808772{col 68}{space 3} .0148425
{txt}{space 8}lag70 {c |}{col 15}{res}{space 2}-.1258798{col 27}{space 2} .0645888{col 38}{space 1}   -1.95{col 47}{space 3}0.146{col 55}{space 4}-.3314302{col 68}{space 3} .0796706
{txt}{space 8}lag71 {c |}{col 15}{res}{space 2}-.0756683{col 27}{space 2} .0918281{col 38}{space 1}   -0.82{col 47}{space 3}0.470{col 55}{space 4}-.3679064{col 68}{space 3} .2165698
{txt}{space 8}lag72 {c |}{col 15}{res}{space 2} .0034273{col 27}{space 2} .0865876{col 38}{space 1}    0.04{col 47}{space 3}0.971{col 55}{space 4}-.2721332{col 68}{space 3} .2789877
{txt}{space 8}lag73 {c |}{col 15}{res}{space 2}-.0546208{col 27}{space 2} .0251094{col 38}{space 1}   -2.18{col 47}{space 3}0.118{col 55}{space 4}-.1345303{col 68}{space 3} .0252887
{txt}{space 8}lag74 {c |}{col 15}{res}{space 2}-.1114704{col 27}{space 2} .0222288{col 38}{space 1}   -5.01{col 47}{space 3}0.015{col 55}{space 4}-.1822124{col 68}{space 3}-.0407284
{txt}{space 8}lag75 {c |}{col 15}{res}{space 2}-.0092495{col 27}{space 2} .0645193{col 38}{space 1}   -0.14{col 47}{space 3}0.895{col 55}{space 4}-.2145786{col 68}{space 3} .1960796
{txt}{space 8}lag76 {c |}{col 15}{res}{space 2}-.1166685{col 27}{space 2} .0333971{col 38}{space 1}   -3.49{col 47}{space 3}0.040{col 55}{space 4}-.2229529{col 68}{space 3}-.0103841
{txt}{space 8}lag77 {c |}{col 15}{res}{space 2} .0050707{col 27}{space 2} .0298563{col 38}{space 1}    0.17{col 47}{space 3}0.876{col 55}{space 4}-.0899456{col 68}{space 3} .1000869
{txt}{space 8}lag78 {c |}{col 15}{res}{space 2} .0979851{col 27}{space 2} .0334863{col 38}{space 1}    2.93{col 47}{space 3}0.061{col 55}{space 4}-.0085832{col 68}{space 3} .2045534
{txt}{space 8}lag79 {c |}{col 15}{res}{space 2} .0411485{col 27}{space 2} .0578289{col 38}{space 1}    0.71{col 47}{space 3}0.528{col 55}{space 4}-.1428888{col 68}{space 3} .2251859
{txt}{space 8}lag80 {c |}{col 15}{res}{space 2}  .088775{col 27}{space 2} .0241901{col 38}{space 1}    3.67{col 47}{space 3}0.035{col 55}{space 4} .0117912{col 68}{space 3} .1657588
{txt}{space 8}lag81 {c |}{col 15}{res}{space 2}-.0360328{col 27}{space 2} .0441818{col 38}{space 1}   -0.82{col 47}{space 3}0.474{col 55}{space 4} -.176639{col 68}{space 3} .1045733
{txt}{space 8}lag82 {c |}{col 15}{res}{space 2} -.112773{col 27}{space 2} .0387819{col 38}{space 1}   -2.91{col 47}{space 3}0.062{col 55}{space 4}-.2361943{col 68}{space 3} .0106484
{txt}{space 8}lag83 {c |}{col 15}{res}{space 2} .0429975{col 27}{space 2} .0676587{col 38}{space 1}    0.64{col 47}{space 3}0.570{col 55}{space 4}-.1723227{col 68}{space 3} .2583176
{txt}{space 8}lag84 {c |}{col 15}{res}{space 2} .0641361{col 27}{space 2} .0638588{col 38}{space 1}    1.00{col 47}{space 3}0.389{col 55}{space 4}-.1390911{col 68}{space 3} .2673633
{txt}{space 8}lag85 {c |}{col 15}{res}{space 2}-.0641297{col 27}{space 2}  .050743{col 38}{space 1}   -1.26{col 47}{space 3}0.296{col 55}{space 4}-.2256165{col 68}{space 3} .0973571
{txt}{space 8}lag86 {c |}{col 15}{res}{space 2}-.0651113{col 27}{space 2} .0500233{col 38}{space 1}   -1.30{col 47}{space 3}0.284{col 55}{space 4}-.2243077{col 68}{space 3}  .094085
{txt}{space 8}lag87 {c |}{col 15}{res}{space 2}-.0279819{col 27}{space 2} .0631348{col 38}{space 1}   -0.44{col 47}{space 3}0.688{col 55}{space 4}-.2289049{col 68}{space 3} .1729411
{txt}{space 8}lag88 {c |}{col 15}{res}{space 2}-.0999222{col 27}{space 2} .0500449{col 38}{space 1}   -2.00{col 47}{space 3}0.140{col 55}{space 4}-.2591874{col 68}{space 3}  .059343
{txt}{space 8}lag89 {c |}{col 15}{res}{space 2}-.0596085{col 27}{space 2} .0254483{col 38}{space 1}   -2.34{col 47}{space 3}0.101{col 55}{space 4}-.1405963{col 68}{space 3} .0213793
{txt}{space 8}lag90 {c |}{col 15}{res}{space 2}-.1502536{col 27}{space 2} .0143729{col 38}{space 1}  -10.45{col 47}{space 3}0.002{col 55}{space 4}-.1959946{col 68}{space 3}-.1045127
{txt}{space 8}lag91 {c |}{col 15}{res}{space 2} .0496274{col 27}{space 2} .0169042{col 38}{space 1}    2.94{col 47}{space 3}0.061{col 55}{space 4}-.0041693{col 68}{space 3} .1034241
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} 1.685459{col 27}{space 2} .6580051{col 38}{space 1}    2.56{col 47}{space 3}0.083{col 55}{space 4}-.4086066{col 68}{space 3} 3.779525
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}   regionid1{col 14}{c |}{space 1}        4{col 27}{space 1}        4{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}        date{col 14}{c |}{space 1}     5267{col 27}{space 1}        1{col 39}{result}{space 1}     5266{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. graph export "results/EventStudy-ln(MiddayCo2)-Dropping-Tasmania.png", replace
{txt}{p 0 4 2}
file {bf}
/Users/simonpostler/Desktop/applied-econometrics-dst-master-2/results/EventStudy-ln(MiddayCo2)-Dropping-Tasmania.png{rm}
saved as
PNG
format
{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/6h/778gphg5533gk87_wkb11wqh0000gn/T//SD01922.000000"
{txt}
{com}. use "data/06-half-hourly.dta", clear
{txt}
{com}. gen ln_CO2 = ln(co2_kg_per_capita)
{txt}(132,208 missing values generated)

{com}. gen ln_Elec = ln(energy_kwh_per_capita)
{txt}
{com}. /// DDD regression - adjusting for midday emissions
> reg ln_CO2 c.dst_here_anytime##c.dst_now_anywhere##c.not_midday weekend_local public_holiday temperature c.temperature#c.temperature solar_exposure wind_3 [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5333803746322.688)

Linear regression                               Number of obs     = {res} 1,131,864
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1712
                                                {txt}Root MSE          =    {res} .42908

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}       ln_CO2{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.3448359{col 27}{space 2} .1198504{col 38}{space 1}   -2.88{col 47}{space 3}0.045{col 55}{space 4}-.6775939{col 68}{space 3} -.012078
{txt}dst_now_any~e {c |}{col 15}{res}{space 2} .1161044{col 27}{space 2} .0509292{col 38}{space 1}    2.28{col 47}{space 3}0.085{col 55}{space 4}-.0252976{col 68}{space 3} .2575065
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0425423{col 27}{space 2} .0509024{col 38}{space 1}   -0.84{col 47}{space 3}0.450{col 55}{space 4}-.1838701{col 68}{space 3} .0987854
{txt}{space 13} {c |}
{space 3}not_midday {c |}{col 15}{res}{space 2} .0534911{col 27}{space 2} 2.13e-12{col 38}{space 1} 2.5e+10{col 47}{space 3}0.000{col 55}{space 4} .0534911{col 68}{space 3} .0534911
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 1}c.not_midday {c |}{col 15}{res}{space 2}-.0058936{col 27}{space 2} .0244315{col 38}{space 1}   -0.24{col 47}{space 3}0.821{col 55}{space 4}-.0737262{col 68}{space 3}  .061939
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_now_any~e#{c |}
{space 1}c.not_midday {c |}{col 15}{res}{space 2}-.0526362{col 27}{space 2} 4.35e-12{col 38}{space 1}-1.2e+10{col 47}{space 3}0.000{col 55}{space 4}-.0526362{col 68}{space 3}-.0526362
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e#{c |}
{space 1}c.not_midday {c |}{col 15}{res}{space 2}  .011612{col 27}{space 2} .0288288{col 38}{space 1}    0.40{col 47}{space 3}0.708{col 55}{space 4}-.0684295{col 68}{space 3} .0916535
{txt}{space 13} {c |}
weekend_local {c |}{col 15}{res}{space 2}-.0774448{col 27}{space 2} .0123539{col 38}{space 1}   -6.27{col 47}{space 3}0.003{col 55}{space 4}-.1117447{col 68}{space 3} -.043145
{txt}public_holi~y {c |}{col 15}{res}{space 2}-.0900281{col 27}{space 2} .0225819{col 38}{space 1}   -3.99{col 47}{space 3}0.016{col 55}{space 4}-.1527254{col 68}{space 3}-.0273308
{txt}{space 2}temperature {c |}{col 15}{res}{space 2}-.0178305{col 27}{space 2} .0351848{col 38}{space 1}   -0.51{col 47}{space 3}0.639{col 55}{space 4}-.1155192{col 68}{space 3} .0798582
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2} .0005005{col 27}{space 2} .0005778{col 38}{space 1}    0.87{col 47}{space 3}0.435{col 55}{space 4}-.0011037{col 68}{space 3} .0021047
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2}-.0171217{col 27}{space 2}  .020374{col 38}{space 1}   -0.84{col 47}{space 3}0.448{col 55}{space 4} -.073689{col 68}{space 3} .0394455
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2}-.2051848{col 27}{space 2} .1020475{col 38}{space 1}   -2.01{col 47}{space 3}0.115{col 55}{space 4}-.4885141{col 68}{space 3} .0781445
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}-.2734649{col 27}{space 2} .5250564{col 38}{space 1}   -0.52{col 47}{space 3}0.630{col 55}{space 4}-1.731255{col 68}{space 3} 1.184325
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo ln_CO2_DDD
{txt}
{com}. 
. reg ln_Elec c.dst_here_anytime##c.dst_now_anywhere##c.not_midday weekend_local public_holiday c.temperature##c.temperature solar_exposure wind_3 [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.3996
                                                {txt}Root MSE          =    {res} .22073

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}      ln_Elec{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.4015115{col 27}{space 2} .0444403{col 38}{space 1}   -9.03{col 47}{space 3}0.001{col 55}{space 4}-.5248976{col 68}{space 3}-.2781255
{txt}dst_now_any~e {c |}{col 15}{res}{space 2} .0920684{col 27}{space 2} .0280328{col 38}{space 1}    3.28{col 47}{space 3}0.030{col 55}{space 4} .0142369{col 68}{space 3} .1698999
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0506099{col 27}{space 2} .0332126{col 38}{space 1}   -1.52{col 47}{space 3}0.202{col 55}{space 4}-.1428229{col 68}{space 3}  .041603
{txt}{space 13} {c |}
{space 3}not_midday {c |}{col 15}{res}{space 2} .0303547{col 27}{space 2} 1.67e-13{col 38}{space 1} 1.8e+11{col 47}{space 3}0.000{col 55}{space 4} .0303547{col 68}{space 3} .0303547
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 1}c.not_midday {c |}{col 15}{res}{space 2}  .002958{col 27}{space 2}  .010206{col 38}{space 1}    0.29{col 47}{space 3}0.786{col 55}{space 4}-.0253783{col 68}{space 3} .0312943
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_now_any~e#{c |}
{space 1}c.not_midday {c |}{col 15}{res}{space 2}-.0598007{col 27}{space 2} 7.98e-13{col 38}{space 1}-7.5e+10{col 47}{space 3}0.000{col 55}{space 4}-.0598007{col 68}{space 3}-.0598007
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e#{c |}
{space 1}c.not_midday {c |}{col 15}{res}{space 2} .0088624{col 27}{space 2}  .023308{col 38}{space 1}    0.38{col 47}{space 3}0.723{col 55}{space 4}-.0558509{col 68}{space 3} .0735758
{txt}{space 13} {c |}
weekend_local {c |}{col 15}{res}{space 2}-.0947336{col 27}{space 2} .0108571{col 38}{space 1}   -8.73{col 47}{space 3}0.001{col 55}{space 4}-.1248776{col 68}{space 3}-.0645896
{txt}public_holi~y {c |}{col 15}{res}{space 2}-.1098852{col 27}{space 2} .0154849{col 38}{space 1}   -7.10{col 47}{space 3}0.002{col 55}{space 4}-.1528781{col 68}{space 3}-.0668923
{txt}{space 2}temperature {c |}{col 15}{res}{space 2}-.0401995{col 27}{space 2} .0224744{col 38}{space 1}   -1.79{col 47}{space 3}0.148{col 55}{space 4}-.1025985{col 68}{space 3} .0221995
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2} .0008715{col 27}{space 2} .0003803{col 38}{space 1}    2.29{col 47}{space 3}0.084{col 55}{space 4}-.0001844{col 68}{space 3} .0019275
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2}-.0147691{col 27}{space 2} .0091327{col 38}{space 1}   -1.62{col 47}{space 3}0.181{col 55}{space 4}-.0401257{col 68}{space 3} .0105874
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2} .0050325{col 27}{space 2} .0205966{col 38}{space 1}    0.24{col 47}{space 3}0.819{col 55}{space 4}-.0521528{col 68}{space 3} .0622178
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}  .104604{col 27}{space 2}  .365545{col 38}{space 1}    0.29{col 47}{space 3}0.789{col 55}{space 4}-.9103116{col 68}{space 3}  1.11952
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo ln_Elec_DDD
{txt}
{com}. 
. esttab ln_CO2_DDD ln_Elec_DDD using "results/ln-DDD-results.tex", label se stats(r2 r2_a) replace
{res}{txt}(output written to {browse  `"results/ln-DDD-results.tex"'})

{com}. 
{txt}end of do-file

{com}. do "/var/folders/6h/778gphg5533gk87_wkb11wqh0000gn/T//SD01922.000000"
{txt}
{com}. use "data/06-half-hourly.dta", clear
{txt}
{com}. //DDD Regression for CO2
. reg co2_kg_per_capita c.dst_here_anytime##c.dst_now_anywhere##c.not_midday [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1532
                                                {txt}Root MSE          =    {res} .14871

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}co2_kg_per_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.1217906{col 27}{space 2} .0427221{col 38}{space 1}   -2.85{col 47}{space 3}0.046{col 55}{space 4}-.2404062{col 68}{space 3} -.003175
{txt}dst_now_any~e {c |}{col 15}{res}{space 2}  .050264{col 27}{space 2} 4.04e-13{col 38}{space 1} 1.2e+11{col 47}{space 3}0.000{col 55}{space 4}  .050264{col 68}{space 3}  .050264
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0409616{col 27}{space 2}  .004272{col 38}{space 1}   -9.59{col 47}{space 3}0.001{col 55}{space 4}-.0528227{col 68}{space 3}-.0291006
{txt}{space 13} {c |}
{space 3}not_midday {c |}{col 15}{res}{space 2} .0268428{col 27}{space 2} 3.07e-13{col 38}{space 1} 8.7e+10{col 47}{space 3}0.000{col 55}{space 4} .0268428{col 68}{space 3} .0268428
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 1}c.not_midday {c |}{col 15}{res}{space 2}-.0130771{col 27}{space 2} .0080707{col 38}{space 1}   -1.62{col 47}{space 3}0.180{col 55}{space 4}-.0354849{col 68}{space 3} .0093306
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_now_any~e#{c |}
{space 1}c.not_midday {c |}{col 15}{res}{space 2}-.0296795{col 27}{space 2} 4.09e-13{col 38}{space 1}-7.3e+10{col 47}{space 3}0.000{col 55}{space 4}-.0296795{col 68}{space 3}-.0296795
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e#{c |}
{space 1}c.not_midday {c |}{col 15}{res}{space 2}  .009133{col 27}{space 2} .0123822{col 38}{space 1}    0.74{col 47}{space 3}0.502{col 55}{space 4}-.0252455{col 68}{space 3} .0435114
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .5524908{col 27}{space 2} 2.49e-13{col 38}{space 1} 2.2e+12{col 47}{space 3}0.000{col 55}{space 4} .5524908{col 68}{space 3} .5524908
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo CO2_DDD_base
{txt}
{com}. //DDD Regression for Electricity
. reg energy_kwh_per_capita c.dst_here_anytime##c.dst_now_anywhere##c.not_midday  [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.3274
                                                {txt}Root MSE          =    {res} .12655

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}energy_kwh_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.1763276{col 27}{space 2} .0252469{col 38}{space 1}   -6.98{col 47}{space 3}0.002{col 55}{space 4}-.2464243{col 68}{space 3} -.106231
{txt}dst_now_any~e {c |}{col 15}{res}{space 2} .0676145{col 27}{space 2} 2.11e-13{col 38}{space 1} 3.2e+11{col 47}{space 3}0.000{col 55}{space 4} .0676145{col 68}{space 3} .0676145
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0674011{col 27}{space 2} .0134699{col 38}{space 1}   -5.00{col 47}{space 3}0.007{col 55}{space 4}-.1047996{col 68}{space 3}-.0300025
{txt}{space 13} {c |}
{space 3}not_midday {c |}{col 15}{res}{space 2} .0200269{col 27}{space 2} 1.52e-13{col 38}{space 1} 1.3e+11{col 47}{space 3}0.000{col 55}{space 4} .0200269{col 68}{space 3} .0200269
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 1}c.not_midday {c |}{col 15}{res}{space 2}-.0036856{col 27}{space 2} .0053219{col 38}{space 1}   -0.69{col 47}{space 3}0.527{col 55}{space 4}-.0184617{col 68}{space 3} .0110905
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_now_any~e#{c |}
{space 1}c.not_midday {c |}{col 15}{res}{space 2}-.0410905{col 27}{space 2} 2.65e-13{col 38}{space 1}-1.6e+11{col 47}{space 3}0.000{col 55}{space 4}-.0410905{col 68}{space 3}-.0410905
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e#{c |}
{space 1}c.not_midday {c |}{col 15}{res}{space 2} .0121404{col 27}{space 2} .0104284{col 38}{space 1}    1.16{col 47}{space 3}0.309{col 55}{space 4}-.0168136{col 68}{space 3} .0410943
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .6384254{col 27}{space 2} 1.19e-13{col 38}{space 1} 5.3e+12{col 47}{space 3}0.000{col 55}{space 4} .6384254{col 68}{space 3} .6384254
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo Elec_DDD_base
{txt}
{com}. 
{txt}end of do-file

{com}. save "/Users/simonpostler/Downloads/06-half-hourly_log.dta"
{txt}{p 0 4 2}
file {bf}
/Users/simonpostler/Downloads/06-half-hourly_log.dta{rm}
saved
{p_end}

{com}. use "/Users/simonpostler/Downloads/06-half-hourly_log.dta"

. use "/Users/simonpostler/Downloads/06-half-hourly_log.dta"

. 